export const testingName = `Экономика, құқық және қаржылық сауаттылық`;
export const testingStr = `
<question1> Адамдардың қарым-қатынасын реттейтін, мінез-құлық ережесі.
<variantright> Құқық
<variant> Нормативтікакт
<variant> Заң
<variant> Әдеп-ғұрып
<variant> Заңдықұжат

<question1> Құқықтың қағидалары дегеніміз:
<variantright> Құқықтың қызмет етуінің негізгі және жетекші бастамалары
<variant> Құқықтың пайда болуының түрлі теориялары
<variant> Құқықтық презумпциялар болып табылады
<variant> Құқықта көрініс тапқан мемлекеттің еркі
<variant> Қоғамдық қатынастарды реттеуші құқық белгілерінің жиынтығы

<question1> Рулық қауым ыдырап пайда болған саяси құрылым
<variantright> Мемлекет
<variant> Дінибірлестік
<variant> Тайпа
<variant> Саяси партия
<variant> Қоғамдық бірлестік

<question1> Саяси құқықтарға не жатады?
<variantright> Митингке құқық
<variant> Еңбекке құқығы
<variant> Заңды демалыс құқығы
<variant> Өмір сүру құқығы
<variant> Дінді таңдау құқығы

<question1> Төмендегілердің ішінен мемлекеттік құрылыс нысанын білдіретін терминді көрсет.
<variantright> Федерация
<variant> Тоталитаризм
<variant> Демократия
<variant> Республика
<variant> Монархия

<question1> Құқық дегеніміз:
<variantright> Мемлекет шығаратын жалпыға бірдей мінез -құлық ережесінің жүйесі
<variant> Белгілі бір мемлекеттің сот шешімдерінің жинағы
<variant> Тарихи пайда болған, ұзақ қолданылып әдеттікке айналған мінез - құлық
<variant> Түсініктерге сәйкес қүрылатын мінез -қүлық ережелер
<variant> Ең жоғарғы нормативтік акт

<question1>  ҚР ҚІЖК сәйкес соттың санкциясынсыз адамды ұстау уақыты?
<variantright> 72 сағаттан артық емес
<variant> 48 сағаттан артық емес
<variant> 24 сағаттан артық емес
<variant> 1 айдан артық емес
<variant> 10 күнненартықемес

<question1> Заң шығарушылық қызметпен айналысатын биліктің бір тармағы.
<variantright> Парламент
<variant> Үкімет
<variant> Сот
<variant> Президент
<variant> Прокуратура

<question1> Әкімшілік қамаққа алу қанша тәулікке дейінгі мерзімге белгілінеді?
<variantright>  30
<variant> 15
<variant> 10
<variant> 35
<variant> 40

<question1> Мемлекет функциясы әрекет ету мерзіміне қарай қандай түрлерге бөлінеді?
<variantright> Тұрақты, уақытша
<variant> Ішкі, сыртқы
<variant> Негізгі, негізгі емес
<variant> Экономикалық, әлеуметтік
<variant> Атқарушы, сот

<question1> Қазақстан Республикасы азаматтарының Қазақстан Республикасының Президентi, Қазақстан Республикасы Парламентiнiң, мәслихатының депутаты, жергiлiктi өзiн-өзi басқару органына мүше болып сайлану құқығы бұл:
<variantright> Бәсең сайлау
<variant> Жанама сайлау
<variant> Төте  сайлау
<variant> Белсенді сайлау
<variant> Жасырын сайлау

<question1> ҚР Соттың шығарған шешімдері кімнің атынан шығарылады?
<variantright> ҚР атынан
<variant> Президенттің атынан
<variant> Конституцияның атынан
<variant> Судьяның атынан
<variant> Прокурордың

<question1> Моральдық нормалардың құқықтық нормалардан айырмашылығы:
<variantright> Мемлекеттік органдар бекітпейді
<variant> Әлеуметтік нормаға жатады
<variant> Бір саясатқа бағынады
<variant> Еріксіз түрде орындалады
<variant> Заңды жауапкершілік болады

<question1> Қылмыстық іс жүргізу құқығының жүйесі қанша бөліктен тұрады?
<variantright> 2 бөлік
<variant> Бөлінбейді
<variant> 4 бөлік
<variant> 3 бөлік
<variant> 5 бөлік

<question1> 18 жасқа толған Қазақстан Республикасының азаматтарының сайлауда дауыс беру құқығы:
<variantright> Белсенді сайлау
<variant> Бәсең сайлау
<variant> Жанама сайлау
<variant> Тікелей сайлау
<variant> Төте сайлау

<question1> Сот процесінде мемлекеттің мүддесін кім білдіреді?
<variantright> Прокурор
<variant> Сот
<variant> Қорғаушы
<variant> Тергеуші
<variant> Адвокат

<question1> Конституциялық соттың төрт судьясын кім тағайындайды?
<variantright> Президент
<variant> Сенат
<variant> Мәжіліс
<variant> Жоғарғы сот
<variant> Бас прокурор

<question1> «ҚР мемлекеттік қызметі туралы» Заңы қашан қабылданды?
<variantright> 2015ж. 23 қараша
<variant> 2005ж. 30 тамыз
<variant> 1993 ж. 25 қазан
<variant> 1999 ж. 23 шілде
<variant> 2017 ж. 30 мамыр

<question1> Кінәсіздік презумпциясы - бұл
<variantright> Адамның кінәсін сот арқылы анықтағанға дейін оның кінәсіз деп саналатындығы
<variant> Құқық бүзушылық үшін қайтадан қылмыстық жауапқа тартуға болмайды
<variant> Соттың шешімінсіз тұрғын үйден айыруға жол берілмеу
<variant> Конституцияда бекітілген меншікке қол сұқпаушылық, мүлікке тиіспеушілік
<variant> Адамдарды тұтқындауға жол бермеу

<question1> Азаматтық беру туралы мәселені кім қарайды?
<variantright> Президент 
<variant> Премьер-министр
<variant> Ішкі істер органы
<variant> Депутаттар
<variant> Сот

<question1> Құқықтық норманың элементтері:
<variantright> Диспозиция, гипотеза, санкция
<variant> Демократия, санкция, гипотеза
<variant> Қаулы, гипотеза, міндет
<variant> Диспозиция, акт, гипотеза
<variant> Прецедент, регламент, ереже

<question1> Қазақстан Республикасының Президенті қанша жылға сайланады?
<variantright> 7жылға
<variant> 5 жылға
<variant> 4 жылға
<variant> 6 жылға
<variant> 3 жылға

<question1> Конституциялық заңдар - бұл ...
<variantright> Мемлекеттік құрылысты анықтайтын заңдар 
<variant> Уақытша заңдар
<variant> Жергілікті билік органдарын реттейтін заңдар
<variant> Жай заңдар
<variant> Нормативтік заңдар

<question1> Қазақстан Республикасының Конституциясы қанша баптан тұрады?
<variantright> 99
<variant> 97	
<variant> 107
<variant> 98
<variant> 100

<question1> ҚР Конституциясына қанша рет өзгерістер мен толықтырулар енгізілді?
<variantright> 7
<variant> 6
<variant> 5
<variant> 9
<variant> 12

<question1> Шетелдіктердіңқандайқұқықтарышектелуімүмкін?
<variantright> Сайлау құқығы 
<variant> Экономикалық-әлеуметтік құқықтары
<variant> Еңбек ету құқықтары
<variant> Шектелмейді
<variant> Білім алу құқығы

<question1> Әкімшілік жауап беру қабілеттілігі қай жастан бастап туындайды?
<variantright> 16жастан бастап 
<variant> 18жастан бастап
<variant> Теріс қылық жасағаннан бастап
<variant> Туылған кезден бастап
<variant> 20 жастан бастап

<question1> Мемлекет отбасының өсіп-өркендеуінен пайда болады деп есептейтін теория
<variantright> Патриархалдық теория
<variant> Материалистік теория
<variant> Теологиялық теория
<variant> Сыныптық теория
<variant> Келісім-шарттық теория

<question1> Азаматтардың еңбек ету құқығын қандай бостандықтар тобына жатқызамыз?
<variantright> Әлеуметтік
<variant> Саяси
<variant> Азаматтық	
<variant> Қылмыстық
<variant> Экономикалық

<question1> Сыбайлас жемқорлыққа қарсы іс-қимылды өз құзыреті шегінде... жүргізуге міндетті?
<variantright> барлық мемлекеттік органдар
<variant> Тек мемлекеттік органдар
<variant> Тек құқық қорғау органдары ғана
<variant> Тек лауазымды адамдар ғана
<variant> Қазақстан Республикасының азаматтары

<question1> Мәжілісте қанша депутат бар?
<variantright> 98
<variant> 77
<variant> 67
<variant> 47
<variant> 107

<question1> Азаматтардың мемлекеттік органдар мен ұйымдардың заңсыз әрекеттеріне берілетін арызын қай орган қабылдайды?
<variantright> Сот
<variant> Әділеторганы
<variant> Прокуратура
<variant> Президент
<variant> Соттарәкімшілігі

<question1> ҚР Неке және отбасы туралы кодекс бойынша суррогат ананың жас мөлшері:
<variantright> 20-35 жас
<variant> 18-25 жас
<variant> 30-45 жас
<variant> 20-25 жас
<variant> 18-40 жас

<question1> Судьякімге бағынады?
<variantright> Заңға
<variant> Прокурорға
<variant> Парламентке
<variant> Президентке
<variant> КонституциялықСотқа

<question1> ҚР Конституциясымен және т.б. заңдармен соттар өкілеттілігі қандай мерзімге дейін шектелген?
<variantright> Мерзім шектелмеген
<variant> 20 жылға дейін
<variant> 15 жылға дейін
<variant> 5 жылға дейін
<variant> 10 жылға

<question1> Облыс прокурорын және оған теңестірілетін прокурорларды кім тағайындайды?
<variantright> Бас Прокурор
<variant> Парламент
<variant> Президент
<variant> Конституциялық Сот
<variant> Үкімет

<question1> Ол адамдарға керекті қаржы өнімдерін, қызметтерін дұрыс таңдауға, оларды дұрыс бағалауға, пайдалану кезінде туындауы мүмкін тәекелдерді қабылдауға мүмкіндік береді
<variantright> қаржылық сауаттылық 
<variant> қаржылық кәсіпкерлік
<variant> қаржылық стратегия
<variant> қаржылық жүйе
<variant> қаржылық тактика 

<question1> Бұл адам үміттеріне сәйкес болашақта сақталынатын табыс 
<variantright> тұрақты табыс 
<variant> нақты табыс
<variant> уақытша табыс
<variant> айлық табыс
<variant> қаражаттық табыс 

<question1> Отбасы  мүшелерінің  тапқан барлық қаражаттары бірге қосылады және алынған қаражаттарды  бөлу мен пайдалану мәселелері бірлесіп шешіледі
<variantright> бірлескен бюджет 
<variant> нақтыланған бюджет
<variant> бөлектенген бюджет
<variant> мемлекеттік бюджет
<variant> республикалық бюджет 

<question1> Қаражаттарды пайдалану кезінде  алдымен ортақ қажеттіліктерге арналған сома есептелініп шығарылады, ал қалған сома отбасы мүшелерінің арасында тепе – тең, не ортақ бюджетке әрбір мүшесінің  үлесіне сәйкес бөлінеді мәселелері бірлесіп шешіледі
<variantright> бірлескен – бөлектенген бюджет 
<variant> нақтыланған – бөлектенген бюджет
<variant> есептеліп - бөлектенген бюджет
<variant> бекітілген мемлекеттік бюджет
<variant> нақтыланған  республикалық бюджет 

<question1> Әрбір мүшесінің жоғары табысы бар және өзін өзі қамтамасыз ететін отбасылары үшін қабылданған бюджет
<variantright> бөлектелген бюджет 
<variant> сақталынған бюджет
<variant> есептелген бюджет
<variant> бекітілген  бюджет
<variant> нақтыланған   бюджет 

<question1> Отбасы қарамағындағы жиынтық ақша қалай аталынады
<variantright> қаржылық ресурстары 
<variant> қаражаттық қорлары
<variant> қормен қаруланулары
<variant> қаражаттық табыстары
<variant> қаражаттың сақтадынуы

<question1> Адам үміттеріне сәйкес  болашақта сақталатын  табысы
<variantright> тұрақты табыс 
<variant> нақты табыс
<variant> күнделікті табыс
<variant> өткізген табысы
<variant> қаражаттық табыс

<question1> Өндіріс үрдісінде жасалатын және шаруашылық мүшелерінің материалдық және рухани қажеттіліктерін қанағаттандыруға арналған ұлттық табыстың бір бөлігі
<variantright> жанұя табыстары 
<variant> күнкөріс табыстары
<variant> күнделікті табыстары
<variant> сатқан табыстары
<variant> шығарған өнімінің табыстары

<question1> Бұл ақшалай табыстар, тағамдық азық – түліктердің натуралдық түсімдерінің және мемлекет пен кәсіпорындар көрсеткен натуралдық тұлғанымдағы жеңілдіктердің, жәрдемақылардығ, сыйлықтардың құны 
<variantright> жанұяның жалпы табысы 
<variant> күнкөрістің жалпы табысы
<variant> күнделікті табыстар жиынтығы
<variant> жанұяның ақшалай табыстары
<variant> шығарған өнімінің табыстары

<question1> Міндетті  төлемдер  мен жарнамаларды шегергеннен кейінгі ақшалай табыстар 
<variantright> қолдағы ақшалай табыстар 
<variant> қалған ресурстардың көлемі
<variant> күнделікті жұмсалынатын қаражаттар
<variant> сақтауға қойылған қаражаттар
<variant> жинақталатын қаржы мөлшері

<question1> Тұтыну  бағаларын ескере отырыа міндетті төлемдер мен жарналарды шегергеннен кейінгші ақшалай табыстар 
<variantright> нақтылы қолдағы ақшалай табыстар
<variant> нақты есептелген қаржы ресурстары
<variant> нақты есептелген отбасы бюджеті
<variant> нақты есептелген резервтері
<variant> нақты есептеген қаржат қорлары

<question1> Тұтыну тауарлары мен қызметтерді сатып алуға бағытталған халықтың ақшалай шығысиарының бір бөлігі
<variantright> тұтыну шығыстары
<variant> азық түлік шығыстары
<variant> азық түлік емес шығыстар
<variant> есептелген шығыстар
<variant> басқа да шығыстар

<question1> Қаржы ресурстарын қайта бөлуді, кәсіпорындар мен халықты қаржыландыруды, ақша айналымын реттеуді және экономиканың түрлі секторларын қолдауды жүзеге асыратын орган
<variantright> банк жүйесі
<variant> қаржы жүйесі
<variant> қаржылық қатынастар
<variant> қаржы секторы
<variant> қаржы институты

<question1> Елдің ақша – несие саясатын жүзеге асыратиын, инфляцияны бақылауға, ұлттық валютаны қорғауға, банктердің қызметін реттеуге және жалпы қаржы жүйесінің қауіпсіздігін қамтамасыз етуге жауапты орган 
<variantright> Ұлттық Банк
<variant> Орталық Банк
<variant> Екінші деңгейлі Банк
<variant> Қаржы секторы
<variant> Қаржы институты

<question1> Олар жеке тұлғалар мен заңды тұлғаларға қызмет көрсетеді, несиелер береді, депозиттер қабылдайды, валюта айырбастаумен айналысады 
<variantright> коммерциялық банктер
<variant> қаржы секторлары
<variant> қаржы ұйымдары
<variant> қаржы басқармалары
<variant> қаражат органдары

<question1> Бұл ақша бірлігінің тұрақтылығымен, несие ресурстарының қол жетімділігімен және халықтың нақты табысының экономикалық өсуі мен өсуін қамтамасыз ететін инфляция деңгейімен сипатталатын ақша жүйесінің жағдайы 
<variantright> айналым қауіпсіздігі
<variant> қаражаттық қауіпсіздік
<variant> сақтық қауіпсізік
<variant> салықтық қауірсіздік
<variant> инвестициялық қауіпсіздік

<question1> Отбасылық бюджетті жақсарту және қаржылық тұрақтылыққа қол жеткізу үшін жасалуы керек ең маңызды нәрселердің бірі 
<variantright> отбасылық қорды құру
<variant> қаржы секторларын қалыптастыру
<variant> депозитке ақша салу жолын анықтау
<variant> инвестициялық жолды таңдай білуі
<variant> қаражат қорларын қалыптастыру

<question1> Құны бар өтімді актив, ол кейіннен тауарларға, қызметтерге немесе басқа активтерге айырбастау үшін ұзақ уақыт жақсы сақталады 
<variantright> жинақ құралы
<variant> жинақ салымдары
<variant> депозит салымы
<variant> инвестициялық салым
<variant> қаражат қорлары

<question1> Бұл адамның қаржылық ресурстарын тиімді пайдалану, оларды ьасқару және қаржылық мақсаттарға қол жеткізу қабілеті 
<variantright> қаржылық әлеует
<variant> қаржылық жинақ
<variant> қаржылық салымдар
<variant> қаржылық инвестиция
<variant> қаржылық қорлар

<question1> Артық шығындардан бас тарту, ақшаны мақсатты түрде жинақтау 
<variantright> үнемдеу әдеттері
<variant> сақтау әдеті
<variant> тиімді әдеттер
<variant> қалыптастыру әдеті
<variant> инвестициялық әдеттер

<question1> Қарызды төлеудің жоспарлары, неғұрлым қымбат қарыздарды бірінші кезекте төлеу
<variantright> қарызды басқару стратегиясы
<variant> қарызды беру жолы
<variant> қарыз алу жолдары
<variant> қарыздарын анықтау
<variant> қарыздарды есептеу

<question1> Жеке  тұлғаның қаржылық сауаттылығы мен ақшаны тиімді басқару, инвестициялау және қаржылық жоспарлау қабілетімен байланысты әлеует
<variantright> қаржылық білім әлеуеті
<variant> қаржылық сауаттылық әлеуеті
<variant> қарыз алуды есептеу әлеуеті
<variant> қарыздарын анықтау әлеуеті
<variant> қарыздарды беру жүйесі

<question1> Адамдардың қаржылық қиындықтардан қорғау қабілеті 
<variantright> қаржылық қауіпсіздік әлеуеті
<variant> қаражаттық  сауаттылық әлеуеті
<variant> қаржылық білімнің әлеуеті
<variant> қарыздарын есептеудің әлеуеті
<variant> қарыздарды сақтау әлеуеті

<question1> Қаржылық активтерді әртүрлі салаларға немесе активтерге бөлу жолы
<variantright> диверсификация
<variant> гиперинфляция
<variant> диферинфлияция
<variant> қаржыны үйлестіру
<variant> қаржыны тұрақтандыру

<question1> Отбасының белгілі бір уақыт кезеңіне арналған кіріс және шығыс жоспары...
<variantright> отбасылық бюджет
<variant> бизнес-жоспар
<variant> қаржылық мақсат
<variant> өтелу мерзімі
<variant> дисконтталған құн

<question1> Тауарлы өндіріспен бірге, қоғамның тапқа бөлінуінің және мемлекеттің пайда болуымен, оған әсер, сот, қызметкерлер ұстауға  қажет болуынан пайда болды
<variantright> салық
<variant> алым
<variant> төлем
<variant> баж
<variant> айыптар

<question1> Өздерінің функциялары мен міндеттерін жүзеге асыру үшін мемлекет жұмылдыратын ұлттық табыстың бір бөлігі табылатындығында 
<variantright> салықтардың экономикалық мәні
<variant> қаржы жүйесінің экономикалық мәні
<variant> қаражат қорларының экономикалық мәні
<variant> қаражаттық жүйені экономикалық мәні
<variant> сақтандырудың экономикалық жүйесі

<question1> Қандай да бір қызметті жүзеге асыруға немесе қандайда бір игілікті қолдануға  құқық беретін, арнайы құқықтық қатысуды иелену үшін жеке және заңды тұлғалардан алынатын бір жолғы жарна 
<variantright> алым
<variant> төлемақы
<variant> салық
<variant> жарна
<variant> кедендік баж

<question1> Қайтарылатын және эвиваленті төлем, ол мемлекет азаматтық құқық субьектісі болған жағдайда, азаматтық – құқықтық қатынастарға жанама түрде жүреді
<variantright> төлемақы
<variant> есептелген қаржы
<variant> салықтарды төлеу
<variant> жарна аудару
<variant> мемлекетттік баж

<question1> Құқықтық маңызы бар қызметтерді жзеге асырғаны үшін және соған мемлекеттік органдар немесе құзырлы тұрған өкілеттілік берген құжаттарды беру кезінде алынатын міндетті төлемақы
<variantright> мемлекеттік баж
<variant> кедендік төлем
<variant> салықты аудару
<variant> жарна беру
<variant> сақтық төлем

<question1> Оның көмегімен  бюджеттік қор қалыптасады, мұның өзі салықтардың қоғамдық міндеттерін арттыра түсетін функция 
<variantright> фискалдық
<variant> есептілік
<variant> реттеушілік
<variant> нақтылық
<variant> қалыптастырушылық

<question1> Бұл орайда салықтардың нысандарын таңдау, олардың ставкаларының, алу әдістерінің өзгеруі, жеңілдіктер мен шегерімдер пайдаланлады 
<variantright> реттеушілік
<variant> қайта бөлу
<variant> нақтылау
<variant> есептеу
<variant> жинақтау

<question1> Түрлі субьектілер табысының бір бөлігі мемлекеттің қарамағына өтетін қызмет
<variantright> қайта бөлу
<variant> қайта есептеу
<variant> нақтысын шығару
<variant> есептеу тәсілі
<variant> жинақтау жүйесі

<question1> «Экономия» термині алғаш рет ұсынылды:
<variantright> Ксенофонт
<variant> Аристотель
<variant> К.Маркс
<variant> В.И. Ленин
<variant> Ф.Энгельс

<question1> Өндіріс дегеніміз:
<variantright> экономикалық тауарлар мен қызметтерді құру процесі
<variant> өнімді немесе табысты оны өндіруге қатысатындар арасында бөлу
<variant> өнімнің орнына ақша немесе басқа өнім алынатын процесс
<variant> өнімді пайдалану немесе жою кезеңі
<variant> қатысушылар арасында өнімді бөлу

<question1> Экономикалық ресурстар, яғни өнім өндіру және қызмет көрсету үшін пайдаланылатын ресурстар:
<variantright> өндіріс факторлары
<variant> ресурстарды үнемдеу
<variant> қажеттіліктер
<variant> өндіріс
<variant> сирек кездесетіндер

<question1> Берілген ресурстармен екі тауарды өндірудің максималды мүмкін болатын көлемдерін және оларды толық пайдалануды көрсететін график:
<variantright> өндірістік мүмкіндіктер қисығы
<variant> тауар
<variant> өндіріс факторлары
<variant> экономикалық құндылықтардың ұдайы өндірісі
<variant> сирек кездесетіндер

<question1> Бөлістіру бұл:
<variantright> өндіріс процесіне қатысушылардың үлесін анықтау
<variant> іскерлік қарым-қатынастың әдістері мен формалары
<variant> үстеме құн теориясы
<variant> капитал
<variant> пайдалы тұтыну тауарларын жасау процесі

<question1> Тауарларды өндіру, айырбастау, бөлу және тұтыну саласындағы мемлекет қызметінің мақсатты жүйесі .............. болып табылады
<variantright> экономикалық саясат
<variant> ұйымдастыру теориясы
<variant> басқару
<variant> нарықтық экономиканы реттеу
<variant> ғылыми модельдеу

<question1> Ұдайы өндіріс дегеніміз:
<variantright> өндіру, бөлу, айырбастау, тұтыну
<variant> баға белгілеу, жоспарлау
<variant> өндіріс, тұтыну
<variant> өндіру, тұтыну, бөлу
<variant> материалдық және материалдық емес игіліктер өндірісі

<question1> Позитивті экономикалық теория зерттейді:
<variantright> нақты экономикадағы жағдайды
<variant> экономика қандай болуы керек жағдайды
<variant> қолда бар ресурстар және оларды пайдалану бойынша ұсыныстар береді
<variant> болашақ экономика
<variant> экономиканың қандай болуы керектігі туралы бағалық пайымдаулар

<question1> «Экономикалық ресурстар» ұғымына мыналар жатпайды:
<variantright> тамақ өнімдері
<variant> жер
<variant> еңбек ресурстары
<variant> капитал
<variant> кәсіпкерлік дағдылар

<question1> Еркін кәсіпкерлік принциптеріне негізделген экономикалық жүйе?
<variantright> нарықтық жүйе
<variant> дәстүрлі жүйе
<variant> командалық жүйе
<variant> аралас жүйе
<variant> өнеркәсіптік

<question1> Пайдалы нәтиже алу үшін шаруашылық қызмет процесінде адамдардың жасаған кез келген ақыл-ой және дене күштері:
<variantright> еңбек
<variant> жер
<variant> капитал
<variant> өндіріс факторлары
<variant> кәсіпкерлік қызмет

<question1> Өнімдер мен қызметтерді өндіруде қолданылатын барлық табиғи ресурстар:
<variantright> жер
<variant> өндіріс факторлары
<variant> капитал
<variant> еңбек
<variant> кәсіпкерлік қызмет

<question1> Айырбастау сферасындағы алтынның орнын толтыратын мемлекеттік эмиссиялық міндетті банкноттар
<variantright> қағаз ақша
<variant> ақша айналысының заңы
<variant> айырбас құны
<variant> баға
<variant> алмасу теңдеуі

<question1> Бәсекелестік дегеніміз:
<variantright> тұтынушы үшін нарықтағы экономикалық агенттердің бәсекесі
<variant> экономиканы әкімшілік басқару
<variant> жеке меншікті жою
<variant> экономикалық қызмет еркіндігін реттеу
<variant> тұтынушылардың арзан тауарлар мен қызметтерді сатып алу бәсекесі

<question1> Нарық субъектілері:
<variantright> үй шаруашылықтары, фирмалар, үкімет
<variant> тауар-ақша қатынастары
<variant> бәсеке арқылы қалыптасатын бағалар
<variant> бәсеке, сұраныс пен ұсыныс, баға
<variant> респонденттер мен референттер

<question1> Микроэкономиканы зерттейтін экономикалық ғылым саласы ретінде анықтауға болады:
<variantright> тұтынушылардың, фирмалардың және ресурстар иелерінің экономикалық мінез-құлқы
<variant> жеке кәсіпкерлер мен шағын фирмалардың экономикалық тәртібі
<variant> қоғамның әртүрлі таптарының жеке өкілдері арасындағы қарым-қатынастар
<variant> экономикалық зерттеулерде микрокомпьютерлерді қолдану
<variant> жеке элементтердің біртұтас органикалық тұтастыққа қосылуы

<question1> Адам мен қоғамның өмір сүруі және дамуы үшін қажетті тауарларды (өнімдерді және қызметтерді) жасау процесі.....
<variantright> Өндіріс
<variant> Ресурстар
<variant> Өндіріс факторлары
<variant> Қажеттіліктер
<variant> Сирек кездесетін

<question1> Сұранысқа әсер ететін факторлар .......
<variantright> Тұтынушылардың талғамдары мен табыстары
<variant> ҒТП, технология
<variant> Ресурстарға баға, Жаңа технологияны пайдалану
<variant> Технологияны жетілдіру
<variant> ҒТП, салықтар

<question1> Кеңейтілген ұдайы өндіріс:
<variantright> экономикалық өсумен сипатталатын ұдайы өндіріс
<variant> өзгермейтін мөлшерде жылдан жылға жаңарып отыратын ұдайы өндіріс
<variant> жеке еңбекке негізделген ұдайы өндіріс
<variant> жеке тұтынудың төмендеуі
<variant> алтын өндірісінің артуына байланысты ұдайы өндіріс

<question1> Баға өскен сайын тауарлар мен қызметтердің ұсынысы көбейеді – мәні мынада:
<variantright> ұсыныс заңы
<variant> сұраныс заңы
<variant> құн заңы
<variant> үнемділік парадоксы
<variant> Леонтьев парадоксы

<question1> Нарықтық баға тепе-теңдіктен төмен:
<variantright> ұсыныс сұраныстан аз
<variant> ұсыныс сұраныстан көп
<variant> сатып алушы нарығы қалыптасуда
<variant> ресурстардың бағасы төмендейді
<variant> артық тауарлар пайда болады

<question1> Орталықтандырылған, жоспарлы, тоталитарлық жүйе?
<variantright> командалық жүйе
<variant> нарықтық жүйе
<variant> дәстүрлі жүйе
<variant> аралас жүйе
<variant> өнеркәсіптік

<question1> Үздіксіз, үнемі жаңарып отыратын өндірістік процесс?
<variantright> ұдайы өндіріс
<variant> айырбастау
<variant> бөлу
<variant> өндіріс
<variant> тұтыну

<question1> Қай термин адамдардың бір нәрсе үшін төлеуге қабілеті мен дайындығын көрсетеді?
<variantright> сұраныс
<variant> мұқтаждық
<variant> қажеттілік
<variant> тілек
<variant> мұқтаж

<question1> Макроэкономика зерттейді:
<variantright> тұтас алғанда халық шаруашылығында болып жатқан процестер
<variant> мемлекеттің экономикадағы рөлі
<variant> адамзаттың экономикалық дамуының ғаламдық мәселелері
<variant> терминнің бастапқы мағынасында саяси экономия сияқты мәселелер.
<variant> тауарларды өндіру және бөлу мәселелері

<question1> Шектеусіз қажеттіліктерді қанағаттандыратын шектеулі ресурстар
<variantright> сирек кездесетіндер
<variant> ресурстар
<variant> Өндіріс факторлары
<variant> өндіріс
<variant> қажеттіліктер

<question1> Позитивті экономикалық теория:
<variantright> экономиканың нақты жағдайын зерттейді
<variant> экономиканың қалай дамуы керектігін зерттейді
<variant> Тауарлар мен қызметтер нарығындағы қатынастарды зерттейді
<variant> негізінен оң процестерді бөліп көрсетеді
<variant> микроэкономикалық процестерді зерттейді

<question1> «Капитал» өнімінің бағасы:
<variantright> несие бойынша пайыз
<variant> өндірістік шығындар
<variant> пайда
<variant> капитал құны
<variant> Жалақы

<question1> Рента дегеніміз:
<variantright> жылжымайтын мүлік иесі алатын табыс
<variant> зейнетақы төлемдері
<variant> сақтандыру полистері бойынша төлемдер
<variant> мәдени сапарлардың нәтижелеріне байланысты кірістер
<variant> өндіріс факторы ретіндегі еңбекке ақы төлеу

<question1> КПВ үлгісі мынаны көрсетеді:
<variantright> ресурстардың шектеулілігін
<variant> сыртқы сауда қызметінің дамуы
<variant> ЖІӨ өсімі
<variant> бағаның өсуі
<variant> жұмыссыздықтың өсуі

<question1> Әртүрлі жүйелердің ерекшеліктерін біріктіретін экономика?
<variantright> аралас жүйе
<variant> нарықтық жүйе
<variant> командалық жүйе
<variant> дәстүрлі жүйе
<variant> өнеркәсіптік

<question1> Барлық басқа факторларды біріктіретін және олардың өндірісті ұйымдастырудағы кәсіпкердің білімі, бастамасы, тапқырлығы және тәуекелдігі арқылы өзара әрекеттесуін қамтамасыз ететін нақты өндіріс факторы?
<variantright> кәсіпкерлік қызмет
<variant> жер
<variant> капитал
<variant> еңбек
<variant> өндіріс факторлары

<question1> Айналыстағы ақша мөлшері тауар массасының бағаларының қосындысына тура пропорционал және ақша айналысының жылдамдығына кері пропорционал?
<variantright> ақша айналысының заңы
<variant> ақша құны
<variant> Айырбас құны
<variant> баға
<variant> алмасу теңдеуі

<question1> Ақшамен көрсетілген тауар құны?
<variantright> баға
<variant> ақша айналысының заңы
<variant> Айырбас құны
<variant> ақша құны
<variant> алмасу теңдеуі

<question2> Қылмыстың объектісі:
<variantright> Қылмыстықзаңменқорғалатынқоғамдыққатынастар
<variant> Лауазымдытұлғаларарасындағықатынастарды
<variant> Мүліктікжәнемүліктікемесқатынастарды
<variant> Денсаулыққақасақанаауырзиянкелтіру
<variant> Мемлекеттікбиліктіжүзегеасырудыңәдістерініңжиынтығы

<question2> ҚР Азаматтары қай жастан бастап сайлауға қатыса алады
<variantright> 18 ж.
<variant> 16 ж.
<variant> 19 ж.
<variant> 20 ж.
<variant> 25 ж

<question2> Азаматқандайжағдайдасайлауғақатысаалмайды?
<variantright> Әрекет қабілеті жоқ болса 
<variant> Депутат қызметін атқарған болса
<variant> Шет елде жүрген болса
<variant> Зейнеткер болса
<variant> Соттылығы болса

<question2> Сыбайлас жемқорлыққа қарсы іс-қимылға жәрдем көрсететін адам туралы ақпарат...
<variantright> Мемлекеттік құпия болып табылады
<variant> Қызметтік құпия болып табылады
<variant> Әскери құпия болып табылады
<variant> Қызметтік жасырын болып табылады
<variant> Мемлекеттік жасырын болып табылады

<question2> Азаматтардың құқық қабілеттілігі қай кезден басталып, қай кезде тоқтатылады?
<variantright> Туылған кезден басталып, қайтыс болғанда тоқтайды
<variant> 14 жасқа толғанда басталып, қайтыс болғанда тоқтайды
<variant> Кәмілеттік жасқа толғанда басталып, зейнеткерлікке шыққанда тоқтайды
<variant> Мектеп бітіргенде басталып, зейнеткерлікке шыққанда тоқтатылады
<variant> Жұмыс істегеннен басталып, зейнетке шыққаннан кейін тоқтатылады

<question2> Сенаттың өкілеттік мерзімі қанша жыл?
<variantright> 6
<variant> 5
<variant> 3
<variant> 7
<variant> 4

<question2> Жазалау қатерімен тыйым салынған, айыпты, қоғамға қауіпті әрекет немесе әрекетсіздік қалай аталады?
<variantright> Қылмыс
<variant> Әкімшілік құқық бұзушылық
<variant> Теріс қылық
<variant> Құқықтық нигилизм
<variant> Қоғамға қарсы әрекет

<question2> Өз тәуелсіздігін толық сақтаған, белгілі бір мақсатқа жету үшін біріккен мемлекеттердің одағы
<variantright> Конфедерация
<variant> Анархия
<variant> Тоталитарлық режим
<variant> Федерация
<variant> Монархия

<question2> Әкімшілік құқық бұзушылықтың ескіру мерзімі
<variantright> 1 ай
<variant> 1 жыл
<variant> 3 ай
<variant> 6 ай
<variant> 2 жыл

<question2> Қазақстан Республикасында салықтың қанша түрі бар? 
<variantright> 12
<variant> 10
<variant> 9
<variant> 11
<variant> 17

<question2> Әскери қылмыстар үшін қылмыстық жауаптылық қанша жастан басталады
<variantright> 18ж.
<variant> 25ж.
<variant> 16 ж.
<variant> 23 ж.
<variant> 20ж.

<question2> Жоғарғы сот органдары болып табылмайды:
<variantright> Ұлттық қауіпсіздік органдары
<variant> Қадағалау алқасы
<variant> Жалпы отырыс
<variant> Қылмыстық істер жөніндегі алқа
<variant> Азаматтық істер жөніндегі алқа

<question2> Қоғамға зор қауіп төндірмейтін, жеке адамға, ұйымға, қоғамға немесе мемлекетке болмашы зиян келтірген не зиян келтіру қатерін туғызған, айыпты жасалған іс-әрекет – бұл
<variantright> Қылмыстық теріс қылық
<variant> Әкімшілік құқық бұзушылық
<variant> Қылмыс
<variant> Құқықтық нигилизм
<variant> Қоғамға қарсы әрекет

<question2> ҚР меншіктің қанша түрі бар
<variantright> 2 түрі бар
<variant> 3 түрібар
<variant> 4 түрібар
<variant> 5 түрі бар
<variant> түргебөлінбейді

<question2> ҚР ақшасы (төл теңгесі) қашан шықты?
<variantright> 1993ж. 15 қараша
<variant> 1992ж. 2наурыз
<variant> 1993ж. 15 қазан
<variant> 1995ж. 15 қараша
<variant> 2000ж 24 ақпан

<question2> Маслихат депутаты бола алады?
<variantright> 20 жасқа толған ҚР азаматы
<variant> 18 жасқа толған ҚР азаматы
<variant> 25 жасқа толған ҚР азаматы
<variant> 30 жасқа толған ҚР азаматы
<variant> 35 жасқа толған ҚР азаматы

<question2> Жалған неке дегеніміз не?
<variantright> Отбасын құру ниетінсіз жасалған неке
<variant> Мәжбүрлеп қиылған неке
<variant> Заңсыз жолмен қиылған неке
<variant> Шет ел азаматымен жасалған неке
<variant> Заңды некедегі адаммен жасалған неке

<question2> ҚР Ұлттық Банкі қашан құрылды
<variantright> 1992 жылы
<variant> 1995 жылы
<variant> 2002 жылы
<variant> 1997 жылы
<variant> 1996 жылы

<question2> Еңбек заңына сәйкес аптасына қалыпты жұмыс уақытының ұзақтығы қанша сағат болуы керек.
<variantright> 40 сағаттан аспауы керек
<variant> 24 сағаттан аспауы керек
<variant> 36 сағаттан аспауы керек
<variant> 32 сағаттан аспауы керек
<variant> 56 сағаттан аспауы керек

<question2> ҚР Үкіметін кім құрады?
<variantright> ҚР Президенті
<variant> ҚР Парламенті
<variant> Маслихат
<variant> Халық
<variant> Жоғарғы сот

<question2> Неке жасы қанша жылға дейін төмендетілуі мүмкін
<variantright> 2 жылға
<variant> 1 жылға
<variant> 3 жылға
<variant> төмендетілмейді
<variant> 5 жылға

<question2> Жергілікті өзін-өзі басқару жүзеге асырылады:
<variantright> Маслихат арқылы
<variant> ХҚКО арқылы
<variant> Агенттіктер арқылы
<variant> Министрліктер арқылы
<variant> Сот арқылы

<question2> Тұрғындардың етене тұрмыстық сұраныстары болып келетін, көп рет қайталануы себепті қалыптасып кеткен мінез-құлық ережелері
<variantright> Әдет-ғұрып
<variant> Корпоративтік нормалар
<variant> Мораль нормасы
<variant> Заңдық прецедент
<variant> Заң

<question2> Азаматтық құқық мүліктік қатынастармен қатар қандай қатынастарды реттейді:
<variantright> Жеке мүліктік емес қатынастарды
<variant> Қаржы қатынастарын
<variant> Жер пайдалану қатынастарын
<variant> Әкімшілік қатынастарын
<variant> Еңбек қатынастарын

<question2> Мәслихаттың негізгі қызметінің түрі қандай формада жүреді:
<variantright> Сессия
<variant> Коллегия
<variant> Отырыс
<variant> Диспут
<variant> Пікір талас

<question2> ҚР Президенті қандай құқықтық акт шығарады?
<variantright> Жарлық
<variant> Қаулы
<variant> Бұйрық
<variant> Шешім
<variant> Жолдау

<question2> ҚР Әкімшілік құқық бұзушылық туралы кодексі қай жылы қабылданды?
<variantright> 2014 ж.
<variant> 2017 ж.
<variant> 1999 ж.
<variant> 2002 ж.
<variant> 2021 ж.

<question2> Азаматтың құқық қабілеттілігі қашан басталады:
<variantright> Туылған кезден бастап
<variant> Кәмелетке толғаннан кейін
<variant> 16 жасқа толғаннан кейін
<variant> 21 жасқа толғаннан кейін
<variant> 18 жасқа толғаннан кейін

<question2> Әркімнің өмір сүруге деген құқығы ҚР Конституциясының қай бабында жазылған?
<variantright> 15 бап
<variant> 7 бап
<variant> 5 бап
<variant> 14 бап
<variant> 6 бап

<question2> Әкімшілік жауаптылықтан босатудың негіздері:
<variantright> Мәжбүрлі тәуекел
<variant> Бұйрықты орындамау
<variant> Абайсыздық
<variant> Рецедивтілік
<variant> Қасақаналық

<question2> Қылмыс құрамы қанша элементтен тұрады
<variantright> 4
<variant> 3
<variant> 7
<variant> 2
<variant> 6

<question2> Мемлекеттің нысаны қаншаға бөлінеді?
<variantright> 3
<variant> 2
<variant> 5
<variant> 4
<variant> 7

<question2> Барлық заңдық нормалар құрайтын өзара тәуелді, бір-бірімен байланысты бірыңғай жүйе
<variantright> Құқықжүйесі
<variant> Сотжүйесі
<variant> Әлеуметтік жүйе
<variant> Көмек жүйесі
<variant> Заңсыздықтын алдын алу жүйесі

<question2> Резиденттік болып табылатындар
<variantright> Шетелде жүрген ҚР тұрғылықты тұрғыны
<variant> ҚР шетелдегі, солардың заңы негізінде құрылып, қызмет етуші заңды тұлғалар
<variant> ҚР территориясындағы шетелдік дипломатиялық өкілдер
<variant> ҚР уақытша жүрген шетел азаматтары
<variant> Бұрыңғы президент

<question2> ҚР Бас Прокурорын кім қызметке тағайындайды? Қанша жылға?
<variantright> Сенат келісімімен ҚР Президенті 5 жылға
<variant> Парламент 7 жылға
<variant> Жоғарғы соттар тағайындайды 7 жылға
<variant> Премьер – Министр 10 жылға
<variant> Үкімет 3 жылға

<question2> Өз әрекеттерімен азаматтық құқықтары мен міндеттерін жүзеге асыру қабілеттілігі, ол:
<variantright> Әрекет қабілеттілік
<variant> Құқық қабілеттілік
<variant> Деликт қабілеттілік
<variant> Шектелген қабілеттілік
<variant> Жартылай қабілеттілік

<question2> Салықтық мөлшері мен оны төлеу мерзімі алдын ала және дәл анықталуы керек қағидат
<variantright> анықтылық
<variant> шынайылық
<variant> ақпараттық
<variant> нақтылық
<variant> тиімділік

<question2> Әрбір салық төлеуші үшін  неғұрдым қолайлы  уақытта және әдіспен алыныуы тиіс қағидат
<variantright> қолайлылық
<variant> нақтылық
<variant> тиімділік
<variant> үнемділік
<variant> қарапаймдылық

<question2> Салықтан жиналған  түсімнен оны жинауға кеткен шығын аз болуы тиіс қағидат
<variantright> үнемділік
<variant> сезімталдылық
<variant> қолайлылық
<variant> заңдылық
<variant> әділдік

<question2> Салық механизмі салық төлеушіге түсінікті болуы тиіс, ол айқын  әрі жеңіл болуы тиіс қағидат
<variantright> қарапаймдылық
<variant> түсініктілігі
<variant> бейтараптылығы
<variant> заңдылықтары
<variant> әділдіктері

<question2> Бұл мемлекеттің заң актілерімен анықталатын салықтың қрылу принциптері мен салық салуды ұйымдастыру
<variantright> салық элементтері
<variant> салықтар механизмі
<variant> салықтар жүйесі
<variant> қаржылық жүйелер
<variant> қаржылық элементтер

<question2> Заң бойынша салық төдеу міндеттілігі жүктелген тұлға, алайда нарық механизмі арқылы салық ауыртпалығы басқа тұлғаға – салық салынушыға аударылуы мүмкін
<variantright> салық төлеуші
<variant> салық жеңілдігі
<variant> салық органы
<variant> салық басқармасы
<variant> салық жүйесі

<question2> Нақты салық ауыртпалығы (салық жүктемесі) түсетін фактілер жиынтығы (дерек, іс – қимыл, жағдай, оқиға). Мүлік пен іс – әрекеттер салық обьектілері  және салық салуға байланысты обьектілер болып табылады, олардың болуына байланысты салық төлеушінің салықтық міндеттемесі туындайды 
<variantright> салық обьектісі
<variant> салық субьектісі
<variant> салық жеңілдігі
<variant> салық салушылары
<variant> салық мөлшері

<question2> Салық салу обьектісі мен салық салуға байланысты обьектінің құндық, заттай немесе өзге де сипатамалары, олардың негізінде бюджетке төленуге тиіс салықтар және бас да міндетті төлемдердің сомасы анықталынады 
<variantright> салық базасы
<variant> салық жеңілдігі
<variant> салық механизмі
<variant> салық ауыртпалығы
<variant> салық жүйелері

<question2> Салық базасын сандық тұрғыдан көрсетуге пайдаланылатын салық салу ауқымын көрсетеді
<variantright> салық бірлігі
<variant> салық құны
<variant> салық мөлшерлері
<variant> салық төлемдері
<variant> салық  көлемі

<question2> Салық базасының өлшем  абсолютті сомада немесе процентпен белгіленетін салықтық есептеу мөлшері  
<variantright> салық стакасы
<variant> салық құндылығы
<variant> салық пайызы
<variant> салық бірліктері
<variant> салық  көлемдері

<question2> Табыс көзіне қарамастан  салық салу бірлігіне  абсолюттік  сомада белгіленеді 
<variantright> тұрақты ставка
<variant> нақты ставка
<variant> жанама ставка
<variant> қосалқы ставка
<variant> пайыздық мөлшер

<question2> Салық базасына қарай алынатын табыстың мөлшеріне  байланысты салық өлшем бірлігіне жатады 
<variantright> проценттік ставкалар
<variant> нақты ставкалар
<variant> қосарлы ставкалар
<variant> жанама ставкалар
<variant> үйлесімді ставкалар

<question2> Салық обьектісіне (оның мөлшерін саралауды есепке алай) бірдей пайыздық қатынаста іс – ірекет етеді 
<variantright> үйлесімді салық ставкалары
<variant> нақтыланған салық ставкалары
<variant> қосарлы есептелген ставкалары
<variant> жанама есептелген ставкалар
<variant> үйлесімді есептелген ставкалар

<question2> Салық салынатын табыстың артуына сәйкес өсіп отратын салық ставкалары  
<variantright> прогрессивті ставкалар
<variant> регрессивті ставкалар
<variant> қосарлы ставкалар
<variant> жанамаланған ставкалар
<variant> үйлесімді ставкалар

<question2> Табыстың өсуіне қарай  төмендейді және табысы көп тұлғаға  тиімді болып келеді, ал табысы аз адамдардың иығына ауыртпалық түседі 
<variantright> регрессивті ставкалар
<variant> прогрессивті ставкалар
<variant> тұрақты ставкалар
<variant> жоғарғы ставкалар
<variant> есептелген ставкалар

<question2> Заңға сәйкес төлеушілерді салықтан толық немесе ішнара босату 
<variantright> салық жеңілдіктері
<variant> салық ауыртпашылығы
<variant> тұрақты ставкалар
<variant> нақты базалар
<variant> салық механизмдері

<question2> Салық салынудан толық босатылатын салық обьектісінің ең аз бөлігі  
<variantright> салық салынбайтын минимум
<variant> салық салынбайтын максимум
<variant> салық жеңілдіктері берілгендер
<variant> салықтан босатылған тұлғалар
<variant> салық механизмдерін қолданатындар

<question2> Салық  бойынша заңмен белгіленген жеңілдіктердің іс – әрекет ететін уақыты 
<variantright> жеңілдік кезеңі
<variant> жеңілдік уақыты
<variant> жеңілдік мерзімі
<variant> жеңілдік салымы
<variant> жеңілдік төлемі

<question2> Заңмен белгіленген әдістер мен салықты бюджетке аудару шаралары 
<variantright> салық төлеу мерзімі мен тәртібі
<variant> салықты есептеу және жүргізу уақыты
<variant> жеңілдік мерзіміне байланысты төлеуі
<variant> жеңілдік салымын есептеп шығару
<variant> жеңілдік төлемін анықтау уақыты

<question2> Салық қызметі органдарының салық заңының орындалуын, жинақтаушы зейнетақы қорларына міндетті зейнетақы жарналарының толық және уақытылы аударылуын бақылауы 
<variantright> салықтық бақылау
<variant> салықтық тексеру
<variant> салықтық ревизия
<variant> салықтық құрылым
<variant> салықтық мониторинг

<question2> Салық қызметінің жүргізілуінің қадағалану процесі
<variantright> салықтық бақылау қызметі
<variant> салықтық тексеру қызметі
<variant> салықтық ревизия жасау
<variant> салықтық акт
<variant> салықтық төлемдерді тексеру

<question2> Экономикалық ерекшелiгiне байланысты салықтар-
<variantright> табысқа, тұтынуға
<variant> нақты, дербес
<variant> тұтынуға, нақты
<variant> табысқа, арнайы
<variant> арнайы, нақты

<question2> Салықтық жазалау шаралары
<variantright> салық төлеушiлерге қолданылатын шаралар
<variant> төлем жасау уақытында табысты ұстау
<variant> салық базасына түзетулер жасау
<variant> мiндеттi хабарлап отыратын ақпарттар
<variant> салықты міндетті төлеу

<question2> Тұрақты мекеме дегенiмiз не
<variantright> салық төлеушiнiң тұрақты қызмет орны
<variant> тәуелсiз мәртебесi бар агент
<variant> жеке тұлғаларды басқарытын орын
<variant> нұсқау алатын мекеме
<variant> заңды тұлғаларды басқаратын орын

<question2> Жеке тұлғалардың табыс салығының ставкасы неге байланысты
<variantright> процент ставкасына
<variant> еңбек ақыға
<variant> салық уақытына
<variant> процент мөлшерiне
<variant> табыс көлемiне 

<question2> Арнаулы салық режимі негізінде әрекет ететін жеке тұлғаларға қатысты қандай салық салу әдісі қолданылуы мүмкін
<variantright> патент және оңайлатылған декларация 
<variant> декларация негізінде
<variant> салық хабарламасы негізінде
<variant> шот-фактура негізінде
<variant> төлем көзінен салықты ұстап қалу

<question2> Салық төлеуші салық төлеуден қашқан жағдайда салық органдары қандай тәсілге жүгінеді
<variantright> салықты мәжбүрлеп өндіру 
<variant> декларация негізінде
<variant> салық ескертуі негізінде
<variant> бір жолғы талонды алу
<variant> өздігінен салықты есептеу

<question2> Жанама салықтарға қандай салықтар жатады
<variantright> қосылған құн салығы, акциздер
<variant> жер қойнауын пайдаланушылардың салығы
<variant> жер, көлiк құралдарына салынатын салық
<variant> әлеуметтiк, акциз, жеке табыс салығы
<variant> мүлікке салынатын салық

<question2> Бюджетке түскен сөң ешқандай дербессiз жалпы мақсатқа жұмсалатын салық
<variantright> жалпы
<variant> арнайы
<variant> жеке
<variant> үстеме
<variant> бюджеттік

<question2> Бюджетке түскен соң арнайы мақсаттарға жұмсалатын салықтар
<variantright> арнайы
<variant> тiкелей
<variant> жалпы
<variant> дербес
<variant> бюджеттік

<question2> Салық салу органына байланысты салықтар қандай түрлерге бөлiнедi
<variantright> жергiлiктi, мемлекеттiк
<variant> арнайы, жалпы
<variant> жергiлiктi, нақтылы
<variant> мемлекеттiк, бюджеттiк
<variant> жалпы, жеке

<question2> Салық салу обьектiсiн бағалау дәрежесiне байланысты салықтар қалай жiктеледi
<variantright> нақты, дербес
<variant> табысқа, тұтынуға
<variant> тiкелей, жанама
<variant> жалпы, арнайы
<variant> жалпы, жеке

<question2> Нақтылы салықтар дегенiмiз не
<variantright> салық төлеушiнiң табысына емес төленетiн салықтар
<variant> салық төлеушiнiң табысына төленетiн салықтар
<variant> тұтынушының табысына төленетiн салықтар
<variant> тұтынушының табысына емес төленетiн салықтар
<variant> салық төлеушінің табысына төленбейтін салықтар

<question2> Еңбек өнімі болып табылатын және айырбас үшін өндірілген экономикалық игілік?
<variantright> тауар
<variant> ресурстар
<variant> өндіріс факторлары
<variant> өндіріс
<variant> сирек кездесетін

<question2> Осы тауардың қосымша көлемін алу үшін өндірісі тоқтатылуы тиіс басқа тауардың мөлшері?
<variantright> альтернативті шығындар
<variant> ресурстар
<variant> Өндіріс факторлары
<variant> өндіріс
<variant> сирек кездесетін

<question2> Экономика, экономикалық дамудың мақсаттары және экономикалық саясат қандай болуы керек деген құндылық пайымдауларға негізделген экономикалық ғылымдағы бағыт
<variantright> нормативтік экономика
<variant> мүмкіндік құны
<variant> нарықтық инфрақұрылым
<variant> өндіріс
<variant> сирек кездесетін

<question2> Микроэкономика зерттеулері:
<variantright> тұтынушылардың, фирмалардың жеке топтарының мінез-құлқы
<variant> тек жеке кәсіпкерлердің мінез-құлқы
<variant> инфляция
<variant> ұдайы өндіріс
<variant> жұмыссыздық

<question2> Меншік құқығының экономикалық теориясы бойынша меншік дегеніміз:
<variantright> ресурстарды пайдалану құқығының жиынтығы
<variant> өндірістік және ақша капиталы
<variant> зауыттар, ғимараттар, машиналар, жабдықтар
<variant> өндірістік және еңбек ресурстары
<variant> меншіктің өзі маңызды

<question2> Ұсынысқа қандай факторлар әсер етеді?
<variantright> ҒТП, салықтар, ресурстар бағасы
<variant> Табыс пен тұтынушылардың қалауы
<variant> Сән, тұтынушылық талғам
<variant> Тұтынушылардың күтулері
<variant> Әлеуметтік қамсыздандыру, әлеуметтік қорғау

<question2> Нарықтық экономиканың сипаттамасы?
<variantright> шектеулі ресурстар және жеке меншік
<variant> өндіріске толық әкімшілік бақылау
<variant> тұтынуға толық әкімшілік бақылау
<variant> өндіру және өткізу процесі
<variant> мемлекет диктаторлық болып табылады

<question2> Нарық инфрақұрылымының элементтеріне:
<variantright> тауар және қор биржалары
<variant> өндірістік кәсіпорындар
<variant> зауыттар
<variant> фабрикалар
<variant> прокуратура

<question2> Экономикалық жүйе шешетін негізгі сұрақтар?
<variantright> нені өндіреді, қалай өндіреді, кім үшін өндіреді
<variant> инфляция мен жұмыссыздықтың және циклдік ауытқулардың себептері қандай
<variant> қашан, қайда, кім
<variant> қалай, неге, кім үшін
<variant> кім, неге, неге

<question2> Кез келген инновацияға тыйым салынған жүйе:
<variantright> дәстүрлі жүйе
<variant> нарықтық жүйе
<variant> командалық жүйе
<variant> аралас жүйе
<variant> өнеркәсіптік

<question2> Тауарлар мен қызметтерді өндіруде қолданылатын еңбек құралдарының жиынтығы
<variantright> капитал
<variant> жер
<variant> Өндіріс факторлары
<variant> Еңбек
<variant> Кәсіпкерлік қызмет

<question2> Экономикалық қызметті бағыттау және үйлестіру үшін ресурстар жеке меншігінде және нарықтар мен бағалар қолданылатын экономикалық жүйе
<variantright> нарықтық жүйе
<variant> дәстүрлі жүйе
<variant> командалық жүйе
<variant> аралас жүйе
<variant> экономикалық жүйе

<question2> Экономикалық мәселелерді ішінара нарық, ішінара үкімет шешсе, онда экономика..
<variantright> аралас
<variant> нарық
<variant> дәстүрлі
<variant> команда
<variant> өтпелі

<question2> Кез келген бір өнімді өндіруде өндірушілердің мамандануы
<variantright> қоғамдық еңбек бөлінісі
<variant> жер
<variant> Өндіріс факторлары
<variant> еңбек
<variant> кәсіпкерлік қызмет

<question2> Тауардың белгілі бір пропорцияда басқа тауарларға айырбастау мүмкіндігі?
<variantright> айырбас құны
<variant> мұқтаж
<variant> қажеттілік
<variant> тілек
<variant> мұқтаждық

<question2> Сатып алу қабілеті, яғни. ақша бірлігіне сатып алуға болатын тауарлардың саны:
<variantright> ақшаның құны
<variant> пайдалану құны
<variant> қажеттілік
<variant> тілек
<variant> сату бағасы

<question2> Тұтыну нәтижесінде рахат немесе қанағат әкелетін тауардың қасиеті?
<variantright> пайдалану құны
<variant> айырбас құны
<variant> қажеттілік
<variant> тілек
<variant> ақша құны

<question2> Құнды сақтау мүмкіндігі:
<variantright> Жинақтау құралы
<variant> Айырбас құны
<variant> Пайдалану құны
<variant> Тілек
<variant> Ақшаның құны

<question2> Ақшаның кез келген уақытта төлем құралы ретінде әрекет ету мүмкіндігі?
<variantright> төлем құралы
<variant> Айырбас құны
<variant> пайдалану құны
<variant> құндылық қоймасы
<variant> ақшаның құны

<question2> Экономикалық тауарларды сатып алушылар мен сатушылардың өзара әрекеттесу механизмі
<variantright> нарық
<variant> нарықтық жүйе
<variant> инфрақұрылым
<variant> нарықтың бұрмалануы
<variant> нарық құрылымы

<question2> Нарықтың жай-күйі туралы ақпаратты жинау және өңдеу, сатып алушыны (сатушыны) іздеу және онымен келіссөздер жүргізу және шарт жасасу, сондай-ақ оның сақталуын бақылау жөніндегі шығыстар
<variantright> транзакциялық шығындар
<variant> нарық құрылымы
<variant> инфрақұрылым
<variant> нарықтың бұрмалануы
<variant> нарық

<question2> Бір сатушының билігі
<variantright> монополия
<variant> монопсония
<variant> олигополия
<variant> олигопсония
<variant> монополиялық бәсеке

<question2> Бір сатып алушының билігі
<variantright> монопсония
<variant> монополия
<variant> олигополия
<variant> олигопсония
<variant> монополиялық бәсеке

<question2> Бірнеше ірі фирмалардың билігі
<variantright> олигополия
<variant> монопсония
<variant> монополия
<variant> олигопсония
<variant> монополиялық бәсеке

<question2>  Бірнеше ірі сатып алушылардың билігі
<variantright> олигопсония
<variant> монопсония
<variant> олигополия
<variant> монополия
<variant> монополиялық бәсеке

<question2>  Әртүрлі күшті және әсерлі сатушылар арасындағы бәсекелестіктер
<variantright> монополистік бәсеке
<variant> монопсония
<variant> олигополия
<variant> олигопсония
<variant> монополия

<question2> Кәсіпкерлік:
<variantright> еңбек, жер және капиталды тиімді байланыстыруға мүмкіндік беретін қызмет түрі
<variant> бірлескен өндірістік қызмет үшін мүшелік негізінде азаматтардың ерікті бірлестігі арқылы құрылған меншіктен бөлінбейтін
<variant> болжанбайтын әрекет
<variant> кез келген кәсіп
<variant> экономикада әлсіз рөл атқарады

<question2> Кәсіпкердің өндірісті ұйымдастырудағы білімі, бастамасы, тапқырлығы және тәуекелдігі арқылы барлық басқа факторларды біріктіретін және олардың өзара әрекетін қамтамасыз ететін нақты өндіріс факторы
<variantright> кәсіпкерлік қызмет
<variant> жер
<variant> капитал
<variant> еңбекпен жасалған және тауарларда бейнеленген құн
<variant> өндіріс факторлары

<question2> «Кәсіпкерлік» ұғымын анықтайтын негізгі сөздер:
<variantright> инновация, бастама, тәуекел, пайда
<variant> сұраныс, ұсыныс, нарық, қажеттілік
<variant> мәміле, келісім-шарт, сұраныс, ұсыныс
<variant> қажеттілік, қажеттілік, бәсеке, ұсыныс
<variant> төлем қабілеттілігі, несие, тәуекел, инвестиция

<question2> Тауарларды сатып алу-сату бойынша сауда және айырбастау операциялары кәсіпкерліктің қай түріне жатады?
<variantright> коммерциялық
<variant> қаржылық
<variant> өндіріс
<variant> кеңес беру
<variant> инновациялық

<question2> Жауапты толықтырыңыз: Негізгі мақсаты ретінде пайданы көздемейтін ұйымдар  деп аталады
<variantright> коммерциялық емес
<variant> қаржылық
<variant> өндіріс
<variant> кеңес беру
<variant> инновациялық

<question2> Акционерлік қоғам акционерлерінің саны неден аспауы керек?
<variantright> Шексіз
<variant> 30 адам
<variant> 25 адам
<variant> 100 адам
<variant> 50 адам

<question3> Республика аумағындағы бағалы қағаз және шетел бағалы қағаздарына бақылауды кімдер жүзеге асырады
<variantright> Қаржы министрлігі
<variant> Парламент
<variant> Президент
<variant> Ұлттық Банк
<variant> Кедендік бақылау департаменті

<question3> Қандай орган валюталық реттеудің негізгі органы және шетел валютасының курсын белгілейді
<variantright> ҰлттықБанк
<variant> Президент
<variant> Сот
<variant> Қаржы минстрлігі
<variant> Салық комитеті

<question3> ҚР қос азаматтық рұқсат етіледі ме?
<variantright> Рұқсат етілмейді
<variant> Премьер-министрдің рұқсатымен
<variant> Президентпен
<variant> Ерекше жағдайда
<variant> Кейбір жағдайларда

<question3> Қазақстан Республикасы өзін қандай мемлекет ретінде орнықтырады
<variantright> Әлеуметтік
<variant> Теократиялық
<variant> Парламенттік
<variant> Үкіметтік
<variant> Халықаралық

<question3> Жүргізүші жол ережесін бұзды, яғни бағдаршамның қызыл шамына өтіп кетті. Қандайқұқықбұзушылықжасалды?
<variantright> Әкімшілік
<variant> Құқықтық
<variant> Азаматтық
<variant> Тәртіптік
<variant> Қылмыстық

<question3> «Сыбайлас жемқорлыққа қарсы іс қимыл туралы» Заңы қашан қабылданды?
<variantright> 2015 жылы 18 қараша
<variant> 2017 жылы 3 тамыз
<variant> 2001 жылы 24 тамыз
<variant> 1998 жылы 2 шілде
<variant> 2012 жылы 5 қыркүйек

<question3> Тәртіптік жазаның мерзімі қандай?
<variantright> 6 ай
<variant> 1 ай
<variant> 1 жыл
<variant> 3 ай
<variant> 9 ай

<question3> Азаматтардың құқықтары мен заңды міндеттерін белгілеуге, өзгертуге және тоқтатуға бағытталған әрекеттері
<variantright> Мәміле
<variant> Шарт
<variant> Келісім
<variant> Өсиет
<variant> Заңдықұжат

<question3> Некені бұзу қандай тәртіппен жүзеге асырылады.
<variantright> АХАТ және сот тәртібімен
<variant> Тек сот тәртібімен
<variant> АХАТ тәртібімен
<variant> Нотариуспен және сотпен
<variant> Әкімшікпен

<question3> Бір-бірінен құқықтық реттеудің заты және әдісімен ерекшеленетін бірыңғай құқықтық қатынастарды реттейтін құқық нормаларының жиынтығы
<variantright> Құқық саласы
<variant> Құқық институты
<variant> Әлеуметтік жүйе
<variant> Көмек жүйесі
<variant> Заңсыздықтын алдын алу жүйесі

<question3> Мемлекетпен рұқсат етілген, бекітілген жеке тұлғаның мүддесін жүзеге асыру барысындағы жалпыға бірдей міндетті мінез-құлықтардың ережелері қалай аталады?
<variantright> Құқық нормасы
<variant> Құқық институты
<variant> Әлеуметтік жүйе
<variant> Көмек жүйесі
<variant> Заңсыздықтын алдын алу жүйесі

<question3> «Сыбайлас жемқорлыққа қарсы іс қимыл туралы» Заңы қашан қабылданды?
<variantright> 2015 жылы 18 қараша
<variant> 2017 жылы 3 тамыз
<variant> 2001 жылы 24 тамыз
<variant> 1998 жылы 2 шілде
<variant> 2012 жылы 5 қыркүйек

<question3> Еңбек кодексі бойынша қалыпты жұмыс уақыты аптасына қанша сағаттан аспауы керек?
<variantright> 40 сағаттан
<variant> 36 сағаттан
<variant> 48 сағаттан
<variant> 72 сағаттан
<variant> 20 сағаттан

<question3> Мемлекеттің сыртқы қызметтері:
<variantright> Отанды қорғау
<variant> Экономикалық
<variant> Саяси
<variant> Әлеуметтік
<variant> Идеологиялық

<question3> Қылмыс жасау сатыларын атаңыз
<variantright> Дайындалу, оқталу, аяқталу
<variant> Дайындалу және аяқталу
<variant> Оқталу және аяқталу
<variant> Басталуы мен аяқталу
<variant> Жасау және аяқталу

<question3> Арнаулы құқықтық мәртебенің түрлері:
<variantright> Студенттер
<variant> Азаматтық
<variant> Заңды тұлғалар
<variant> Әкімшілік
<variant> Жергілікті

<question3> Табиғиапаттар, апат болған жағдайда мемлекеттік билік органдары шешімімен қоғам мүддесіне мүлікті тартыпалу қалай аталады?
<variantright> Реквизиция
<variant> Новация
<variant> Тәркілеу
<variant> Национализация
<variant> Жекешелендіру

<question3> Салықтар салық салу объектісіне қарай қандай топтарға бөлiнедi?
<variantright> Тiкелей және жанама
<variant> Жалпы және арнайы
<variant> Дербесжәненақты
<variant> Үстеме
<variant> Нақты

<question3> Ұлттық валютаның құнын шетел валютасына қатысты төмендету қалай аталады?
<variantright> Девальвация
<variant> Ревальвация
<variant> Деноминация
<variant> Номинация
<variant> Клиринг

<question3> Республикалық тұрпаттың белгілері:
<variantright> Мемлекет басшысының сайлануы
<variant> Билікті мерзімсізп айдалану
<variant> Мемлекеттік басшысының жауапкершілігі
<variant> Билікті мұраға қалдыру
<variant> Сыйға тарту

<question3> Іс әрекетті таңдау мүмкіндігін бекітетін құқықтық нормалар:
<variantright> Диспозитивті
<variant> Императивті
<variant> Сануция
<variant> Құрылым
<variant> Фикция

<question3> Қазақстанда қанша деңгейлі банкілік жүйе қалыптасты?
<variantright> Екі деңгейлі банкілік жүйе
<variant> Бір деңгейлі банкілік жүйе
<variant> Үш деңгейлі банкілік жүйе
<variant> Төрт деңгейлі
<variant> Жүйеге бөлінбейді

<question3> 14 пен 16 жас аралығындағы қызметкерлердің еңбек уақытының ұзактығы неше уакыт болу керек?
<variantright> Аптасына 24 сағат
<variant> Аптасына 20 сағат
<variant> Аптасына 30 сағат
<variant> Аптасына 25 сағат
<variant> Аптасына 36 сағат

<question3> Прокурор соттың шешімімен, үкімімен және өзге де қаулысымен келіспеген жағдайда қандай актіні енгізуге құқылы:
<variantright> Наразылық
<variant> Өтініш
<variant> Ұйғарым
<variant> Шешім
<variant> Қаулы

<question3> Мемлекеттiк бюджеттiң кiрiсiн топтастырып, әлеуметтiк,  әскери қорганыс шараларын реттеу салық салудың қандай қызметiн атқарады
<variantright> Фискалдық
<variant> Қайтабөлу
<variant> Реттеушiлiк
<variant> Теңестiрушiлiк
<variant> Сипаттаушылық

<question3> Салық салу объектiсiне қарай салықтар қандай түрге бөлiнедi?
<variantright> Тiкелей және жанама салықтар
<variant> Үстеме және қосымша салықтар
<variant> Дербес және үстеме салықта
<variant> Жалпы және арнайы салықтар
<variant> Нақты және дербес салықтар

<question3> Жалғансыз немесе тiкелей табысқа немесе мүлiкке салынатын салық қалай аталады?
<variantright> Тікелей
<variant> Жанама
<variant> Қосымша
<variant> Дербес
<variant> Үстеме

<question3> Коммерциялық ұйым болып табылатын заңды тұлға тек мына түрде құрыла алады:
<variantright> Мемлекеттік кәсіпорын, акционерлік қоғам, шаруашылық серіктестік және өндірістік кооператив
<variant> Акционерлік қоғам,шаруашылық серіктестік және өндірістік кооператив
<variant> Қазыналық кәсіпорын, акционерлік қоғам және жауапкершілігі қосымша және шектелген серіктестік
<variant> Қазыналық кәсіпорын, акционерлік қоғам және шаруашылық серіктестік
<variant> Акционерлік қоғам және шаруашылық серіктестік

<question3> Қоғамдық жұмыстар қылмыстық теріс қылықтар үшін қанша мерзімге белгіленеді:
<variantright> 20 сағаттан – 200 сағатқа дейін
<variant> 40 сағаттан – 300 сағатқа дейін
<variant> 30 сағаттан – 100 сағатқа дейін
<variant> 50 сағаттан – 250 сағатқа дейін
<variant> 60 сағаттан – 120 сағатқа дейін

<question3> Мемлекеттік мәжбүрлеуді жүзеге асыру мүмкіндігі шаралары тән әлеуметтік норма:
<variantright> Заңи талаптар
<variant> Моральдық норма
<variant> Өнеге нормалары
<variant> Әдет-ғұрып нормалары
<variant> Дәстүр

<question3> Құқық аналогиясы
<variantright> Істі шешу кезінде жалпы қағидаларға, құқықтың мағынасына қарап шешу
<variant> Істі заңдардың жалпы бағытына, субьектісіне сүйене отырып шешу
<variant> Қаралған іс бойынша құқық қолдану актісін қабылдау
<variant> Заңды әрекетті шешуге арналған құкықтық норма ұқсастығы
<variant> Заңдылықты құқықтық тәртіпті нығайтудағы рөлі бар құқықтық қағида

<question3> Істі заңдардың жалпы бағытына және мағынасына сүйене отырып шешу
<variantright> Заң ұқсастығы
<variant> Құқық ұқсастығы
<variant> Құқытық қатынас ұқсастығы
<variant> Кұқықтық норма
<variant> Кұкықты колдану

<question3> Мемлекет атынан жасалатын, тараптардың құқықтары мен міндеттерінің бары-жоғын анықтайтын, шараларды белгілейтін орган актісі
<variantright> Нормативті акті
<variant> Құқық колданатын акті
<variant> Күшіне енген акт
<variant> Кодекс
<variant> Конституциялық заң

<question3> Дербес салықтар дегенiмiз не
<variantright> табысына төленетiн салық
<variant> табысына байланысты емес салық
<variant> тұтынушының төленетiн салық
<variant> тұтынушының мүлікіне төленетiн салық
<variant> табысқа төленген жанама салық

<question3> Салық төлеушiлер өз тарапынан қандай мiндеттердi атқаруы тиiс
<variantright> уақытылы салық комитетiне тiркелiп, нөмерiн алуға
<variant> жүргiзiлген салықтық тексеру актiсiмен танысуға
<variant> Салық обьектiлерiнiң есебiн уақытылы алуға
<variant> Салықтарды уақытылы төлеуге
<variant> Салықтарды толық төлеуге

<question3> Бұл нарықтық  жүйе, оның аясында сатып алушылар мен сатушылар арасында бағалы қағаздардың айналымы жүріп отырады 
<variantright> қор нарығы
<variant> валюта нарығы
<variant> еңбек нарығы
<variant> сақтандыру нарығы
<variant> салық нарығы

<question3> Бағалы қағаздармен барлық сауда операциялары жасалатын орын  
<variantright> қор биржасы
<variant> валюта биржасы
<variant> еңбек биржасы
<variant> сақтандыру биржасы
<variant> салық биржасы

<question3> Дивидедтерді алу және акциялардың жиналысына қатысу құқығымен ерекшеленетін компанияның меншігіндегі үлесі болып табылатын  активтердің ең көп таралған түрі 
<variantright> жай акция
<variant> күрделі акция
<variant> қарапайым акция
<variant> нақты акция
<variant> шығарылған акция

<question3> Олар дивидендтен тіркелген табысты бірінші болып алуға мүмкіндік береді, бірақ акционерлердің жиналысына қатысу құқығын шектейді
<variantright> артықшылықты акция
<variant> пұрсатты акциялар
<variant> шығарылған акциялар
<variant> салыстырмалы акциялар
<variant> қолданыстағы акциялар

<question3> Бұл белгілі бір мерзім өткеннен кейін пайыздармен қоса оның номиналды құнын қайтарып алуға құқық беретін, өзінің мәні бойынга борыштық қолхат болып табылады
<variantright> облигациялар
<variant> акциялар
<variant> вексельдер
<variant> банктік сертификаттар
<variant> чектар

<question3> Бағалы қағаздардың есебін жүргізеді және сертификаттарды сақтайды
<variantright> депозиторийлер
<variant> тізім ұстаушылар
<variant> делдалдар
<variant> алып сатарлар
<variant> нарықтың қатысушылары

<question3> Бұл белгілі бір мерзімге салынған немесе арнайы келісім негізінде банкке клиент тарапынан салынатын ақша қаражаты
<variantright> депозит
<variant> инвестиция
<variant> салымдар
<variant> күрделі қаржылар
<variant> бағалы қағаздар

<question3> Бұл белгілі бір уақыт аралығында салынатын депозиттер 
<variantright> мерзімді депозиттер
<variant> нақты депозиттер
<variant> шығарылған депозиттер
<variant> күрделі депозиттер
<variant> арнайы депозиттер

<question3> Бұл депозит  түрінде ақша клиенттің талап етуі бойынша кез келген уақытта шешіліп алынатын депозит түрі  
<variantright> талап ету депозиті
<variant> мерзімі өткен депозиттер
<variant> шығарылған депозиттер
<variant> халыққа тиімді депозиттер
<variant> пайыздық депозиттер

<question3> Бұл салымшының белгілі бір мақсатта ақша жинау үшін ашылатын депозиті. Бұл депозит түрі ұзақ мерзімді болады және пайыздар әр түрлі болуы мүмкін
<variantright> жинақ депозиттері
<variant> салымдық депозиттері
<variant> табысты депозиттері
<variant> икемді депозиттер
<variant> сабырлы депозиттер

<question3> Бұл белгілі бір мерзімге ақша салғанымен, салымшыға ақша алу құқығын береді. Яғни, салымшы кез келген уақытта депозитті толық немесе жартылай шешіп ала алады, бірақ ол үшін пайыздық мөлшерлеме өзгеруі мүмкін
<variantright> икемді депозиттер
<variant> мерзімді депозиттер
<variant> қолайлы депозиттері
<variant> тұрғы үй  депозиттері
<variant> арнайы депозиттер

<question3> Бұл белгілі бір уақыт  ішінде  белгілі бір соманы қаызға алу немесе беру келісімі. Бұл бір тараптың  екінші тарапқа  белгілі бір мөлшерде ақша немесе тауарды уақытша беріп, оны кейіннен пайызбен немесе пайыссыз қайтаруңа келісім жасуы дегенді білдіреді.
<variantright> несие
<variant> депозит
<variant> салым
<variant> инвестиция
<variant> қаржы

<question3> Егер пайыздық мөлшерлемелер төмендесе, қарызды қайта қаржыландыруды қарастыруға болады.Бұл қарызды қайта құрылымдау және төмен пайызбен  ұзақ мерзімге  алу арқылы  жеңілдетуге мүмкіндік береді
<variantright> қарызды қайта қаржыландыру
<variant> қарыздарды көбейту жолын анықтау
<variant> қарыздардың жолын жабу
<variant> сырттан қаржы тарту
<variant> айлығынан 10 пайыз қалдырып отыру

<question3> Шаруашылық жүргізуші  субьектілер мен мемлекет шығарған  бағалы қағаздардың  сан салуан  түрлері сатылатын және сатып алатын қаржы нарығының бөлігі 
<variantright> бағалы қағаздар нарығы
<variant> валюталық нарықтар
<variant> сақтандыру нарықтары
<variant> несиелік нарықтар
<variant> қаражаттық нарықтар

<question3> Иеленушілеріне мүліктік құқықтар мен белгілі бір ақша сомаларын алуға құқық беретін ақшалай немесе тауарлық құжаттар 
<variantright> бағалы қағаздар
<variant> акцияның түрлері
<variant> депозит шарттары
<variant> несиелік қатынастар
<variant> қаражат қатынастары

<question3> Капиталды жұмсаудың  обьектісі болып табылатын  бағалы қағаздар 
<variantright> инвестициялық бағалы қағаздар
<variant> мемлекеттік бағалы қағаздар
<variant> жергілікті бағалы қағаздар
<variant> сақтық бағалы қағаздар
<variant> шығарылған бағалы қағаздар

<question3> Ерікті негізде халық арасында таратылатын мемлекеттік бағалы қағаздарды түрі, ол иелерінің ақшаны бюджетке аударғанын куәләндландырады және осы бағалы қағаздарды  бүкіл иелену кезінде тіркелген табыс алуына құқық береді 
<variantright> қазынашылық міндеттемелер
<variant> мемлелекеттің міндеттемелері
<variant> кәсіпорынның міндеттемелері
<variant> сақтық міндеттемелер
<variant> есептелген міндеттемелер

<question3> Биржалардағы мерзімдік мәмілелер, олардың мәнісі қаржылық және кредиттік құралдарды шикізат тауарларын, алтынды, валютаны мәсіле жасау сәтінде тіркелетін бағамен сатып алуда және сатуда, бұл орайда операциялар белгілі бір уақыт аралығында орындалады
<variantright> фьючестік операциялар
<variant> опциондық операциялар
<variant> нақты операциялар
<variant> сақтықоперациялар
<variant> есептелген операциялар

<question3> Мерзімдік биржа мәмілелерінде енгізілген шарт бойынша тараптардың біріне мәміленің бірін – бірі жоққа шығаратын жекелеген шарттардың бірін таңдау немесе оның бастапқы шарттарын өзгеру құқығы беріледі
<variantright> опциондық мәміле
<variant> фьючерстік мәміде
<variant> свот мәмілесі
<variant> варанттық мәміле
<variant> нақты мәміле

<question3> Шұғыл жеткізілген шартымен қайсібір активті – қор құндылықтарын, валюта, басқа заттарды, тауарларды сатып алу (сату) жөнінде мәмілелер жасалады, бұл орайда  сонымен бірге белгілі бір мерзімге кері мәміле жасалады
<variantright> своптар  мәмілесі
<variant> қаржылық мәмілелер
<variant> қаражаттық мәмілелер
<variant> варанттық мәмілелер
<variant> сақтық мәмілелер

<question3> Туынды бағалы қағаздар, олар белгілі бір баға бойынша  белгілі бір кезеңнің ішінде эмитенттің акцияларды сатып алуға жеңілдікті құқығын білдіреді
<variantright> варанттар
<variant> депощитарий
<variant> опциондар
<variant> фьючерлік
<variant> делдалдар

<question3> Бұл жарғылық капиталды  капиталды қалыптастыру немесе қарыздық қаражаттарды тарту мақсатымен бағалы қағаздар шығару және орналастыру
<variantright> бағалы қағаздар эмиссиясы
<variant> бағалы қағаздар инвестициясы
<variant> бағалы қағаздар инвесторы
<variant> бағалы қағаздар варанттары
<variant> бағалы қағаздар келісімдері

<question3> Өз қаражаттарын бағалы қағаздарға салуды инвестицияны жүзеге асыратын жеке немесе заңды тұлғалар 
<variantright> инвесторлар
<variant> эмитенттер
<variant> салымшылар
<variant> құрылтайшылар
<variant> ұйымдастырушылар

<question3> Қолданыстағы  заңдарға сәйкес  эмиссиялық  бағалы қағаздар шығаруды жүзеге асыратын заңды тұлғалар 
<variantright> эмитенттер
<variant> брокерлер
<variant> диллерлер
<variant> маклерлер
<variant> салымшылар

<question3> Бағалы қағаздар нарығының  қаржылық құралдарын және клиенттер ақшасының есебінен алуды және олар бойынша құқықтарды растауды, клиенттердің құжатты қаржылық құралдардың сақталуы жөнінде өзіне міндеттемелер қабылдай отырып оларды сақтауды жүзеге асыратын кәсіпқой қатысушы 
<variantright> кастадион
<variant> андеррайтер
<variant> қатысушылар
<variant> салымшылар
<variant> ұйымдастырушылар

<question3> Бағалы қағаздар нарығының брокерлік – дилерлік қызметті жүзеге асыруға лицензиясы бар және эмитентке эмиссиялық бағалы қағаздарды шығару жөнінде  қызмет көрсететін кәсіпқой қатысушы  
<variantright> андеррайтер
<variant> варанттар
<variant> мәміле жасаушвлар
<variant> инвестиция берушілер
<variant> сатушылар

<question3> Бағалы қағаздар нарығының клиенттің тапсырмасы бойынша, соның есебінен және мүдделерін көздеп, эмиссиялық бағалы қағаздармен және өзге қаржылық құралдармен мәміле жасайтын кәсіпқой қатысушы  
<variantright> брокер
<variant> варант
<variant> инвестор
<variant> салымшы
<variant> ұйымдастырушы

<question3> Бағалы қағаздар нарығының ұйымдастырылған бағалы қағаздар нарығында баға белгілеуді ұсыну және оларды бұқаралық ақпарат құралдарына жариялау арқылы өз мүдделерін көздеп және өз есебінен эмиссиялық бағалы қағаздармен және өзге қаржылы құралдарме мәмілелер жасайтын кәсіпқой қатысушы  
<variantright> диллер
<variant> кәсіпқой қатысушы
<variant> кәсіпқой салымшы
<variant> кәсіпқой беруші
<variant> кәсіпқой делдалдар

<question3> Мемлекеттің өзінің  ұлттық мүдделеріне сәйкес  дербес  қаржы – экономикалық саясатты жүзеге асыру қабілеті 
<variantright> қаржылық қауіпсіздік
<variant> қаржылық сақтық
<variant> қаржылық режимдер
<variant> қаржылық тәртіп
<variant> қаржылық жүйелер

<question3> Мемлекеттік және жергілікті бюджеттердің  кірістері мен  шығыстарының  теңгерімін және бюджет қаражатын  пайдалану  тиімділігін ескере отырып, мемлекеттің төлем қабілеттілігін қамтамасыз ету жағдайы
<variantright> бюджеттік қауіпсіздік
<variant> салықтық қауіпсіздік
<variant> сақтандыру қауіпсіздігі
<variant> қаржылық қауірсіздік
<variant> қаражаттық қауіпсіздік

<question3> Мемлекеттің фискалдық мүдделерін және салық төлеушілердің жеке, корпоративтік мүдделерін оңтайлы біріктіруге тиісмемлекеттің салық саясатының тиімділігі  
<variantright> салық қауіпсіздігі
<variant> банк қауіпсіздігі
<variant> айналым қауіпсіздігі
<variant> қаражаттық қауіпсіздігі
<variant> инвестициялық қауіпсіздік

<question3> Бұл адамның жеке және қоғам ішінде  материалдық  және рухани қажеттіліктерін қанағаттандыру үшін  қаржылық қауіпсіздікке  ие болуының әлеуметтік – экономикалық мүмкіндігі, сондай ақ болашақта осы тәуелсіздікті  сақтау және оны одан әрі арттыру 
<variantright> жеке қаржылық 
<variant> банктік қауіпсіздік бағыты
<variant> инвестициялық қауіпсіздік бағыты
<variant> қаражаттық қауіпсіздік бағыты
<variant> қоғамдық қауіпсіздік жолы

<question3> Акционерлік қоғамның жоғары органы болып табылады
<variantright> Акционерлердің жалпы жиналысы
<variant> Директорлар кеңесі
<variant> Мемлекеттік орган
<variant> Қазақстан Республикасының Ұлттық банкі
<variant> Қазақстан Республикасының Салық комитеті

<question3> Сату көлемі 36 000 мың теңге, нарықтағы жалпы сұраныс 180 000 мың теңге болғаны белгілі болса, «Айвенго» ЖШС-нің нарықтағы үлесін анықтаңыз.
<variantright> 20%
<variant> 25%
<variant> 100%
<variant> 10%
<variant> 50%

<question3>  Жеке кәсiпкерлiк субъектiсi анықтайтын және қорғайтын, заңды түрде шектеулi тұлғалар шеңберiне еркiн қол жеткiзiлетiн, ашылуы, алынуы, пайдаланылуы оның мүдделерiне зиян келтiруi мүмкiн ақпарат
<variantright> коммерциялық құпия
<variant> баланс
<variant> зияткерлік меншік
<variant> табыс туралы есеп
<variant> бизнес жоспар

<question3> Қазақстан Республикасының Кәсіпкерлік кодексіне сәйкес кәсіпкерлік субъектілерін көлемі бойынша бөлу өлшемдеріне мыналар жатады:
<variantright> жұмысшылардың орташа жылдық саны және орташа жылдық табыс
<variant> жұмысшылардың орташа жылдық саны ғана
<variant> тек орташа жылдық табыс
<variant> қызметкерлердің орташа жылдық саны және кәсіпорын қызметінің түрі
<variant> кәсіпорын қызметінің түрі және орташа жылдық табысы

<question3> ЖШС құрылтайшыларының ең аз саны
<variantright> 1
<variant> 2
<variant> 3
<variant> 4
<variant> 5

<question3> Қазақстан Республикасында «Сыбайлас жемқорлыққа қарсы іс-қимыл туралы» Заңға сәйкес кәсіпкерлік қызметпен айналысуға кімнің құқығы жоқ 
<variantright> салық қызметкерлері
<variant> ЖОО оқытушылары
<variant> Дәрігерлер
<variant> студенттер
<variant> көлік ұйымдарының қызметкерлері

<question3> Қазақстан Республикасындағы шағын кәсіпорындарда жұмысшылар саны қанша болуы керек?
<variantright> 100 адамға дейін
<variant> 150-ден 200 адамға дейін
<variant> 15 адамға дейін
<variant> 200-300 адам
<variant> 50-ден 150 адамға дейін

<question3> Қазақстан Республикасының Кәсіпкерлік кодексінің қабылданған күні
<variantright> 29.10. 2015
<variant> 1991 жылы 16 желтоқсан
<variant> 31.01.2015 ж
<variant> 10.01.2002 ж
<variant> 1993 жылғы 15 қараша

<question3> Қаржылық кәсiпкерлiк – негiзi болып табылатын кәсiпкерлiк түрi:
<variantright> Ақша, шетел валютасы, бағалы қағаздар
<variant> Тек бағалы қағаздар
<variant> Жылжымалы мүлік және жылжымайтын мүлік
<variant> Қызмет көрсету
<variant> Тауарлар мен қызметтерді өндіру

<question3> Жеке кәсіпкерліктің экономикалық негізі... меншік болып табылады.
<variantright> Жеке
<variant> Қоғамдық
<variant> Мемлекет
<variant> Муниципалдық
<variant> Ұжымдық 

<question3> Қандай ұйымдық-құқықтық нысандағы заңды тұлғалар Қазақстан Республикасының заңнамасына сәйкес эмиссиялық бағалы қағаздарды шығаруға құқылы?
<variantright> акционерлік қоғам
<variant> толық серіктестік
<variant> коммандиттік серіктестік
<variant> кооператив
<variant> жауапкершілігі шектеулі серіктестік

<question3> Шағын наубайхана ашу кәсіпкерліктің қандай түріне жатады?
<variantright> өндіріс
<variant> қаржылық
<variant> коммерциялық
<variant> кеңес беру
<variant> инновациялық

<question3> ЖШС ... өткен сәттен бастап құрылған болып саналады
<variantright> Мемлекеттік тіркеу
<variant> Салық есептерін беру
<variant> Статистикалық есептерді ұсыну
<variant> Әкімдіктің бекітуі
<variant> Төлемдер жасау

<question3> Бизнес-жобаны қаржыландырудың қарыз көздеріне мыналар жатады:
<variantright> Несиелер
<variant> Амортизациялық аударымдар
<variant> Жарғылық капитал
<variant> Акциялар эмиссиясы
<variant> Бөлінбеген пайда

<question3> Белгілі бір ережелерді сақтай отырып, белгілі бір брендпен шектелген аумақта белгілі бір кәсіпкерлікті жүргізу құқығы дегеніміз:
<variantright> франшиза
<variant> жөнелтілім
<variant> ноу-хау
<variant> лизинг
<variant> лицензия

<question3> Франчайзинг дегеніміз:
<variantright> пайданың бір бөлігіне айырбас ретінде белгілі тауар белгісімен бизнес жүргізу құқығын алу
<variant> өндірушінің өнімді өткізу құқығын қамтамасыз етуі
<variant> жартылай төлем негізінде ұзақ мерзімді пайдалануға жабдықты беру
<variant> өз өніміне белгілі тауар белгісін пайдалану құқығын алу
<variant> коммерциялық құпия туралы құпия ақпаратты ақылы түрде беру

<question3> Кәсіпорынның маркетингтік тәжірибесіндегі SWOT талдаудың негізгі элементтері: күшті жақтары - әлсіз жақтары - мүмкіндіктер - ...:
<variantright> қауіп-қатер
<variant> тәуекелдер
<variant> бәсекелестер
<variant> перспективалар
<variant> тенденциялар

<question3> Нарықты жеке топтарға бөлу қалай аталады?
<variantright> нарықты сегменттеу
<variant> нарықты таңдау
<variant> нарыққа енгізу
<variant> нарықтық айырмашылық
<variant> нарықты араластыру

<question3> Бренд дегеніміз:
<variantright> сатып алушының санасында тауар белгісі тудыратын бейне
<variant> бір адамның тауарын екінші тұлғаның тауарынан ажыратуға мүмкіндік беретін белгі
<variant> өнім графикасы
<variant> көркем орындалған фирма логотипі
<variant> компания белгісінде көрсетілген өнім белгісі

<question3> Кәсіпорынның ішкі ортасына мыналар жатады:
<variantright> кәсіпорын персоналы
<variant> мемлекеттік органдар
<variant> жабдықтаушылар
<variant> өнімді тұтынушылар
<variant> өнеркәсіп

<question3> Тауарлармен, жұмыстармен, қызметтермен, ақпараттармен халықаралық алмасу саласындағы кәсіпкерлік дегеніміз:
<variantright> Сыртқы сауда қызметі
<variant> Халықаралық еңбек бөлінісі
<variant> Халықаралық келісім
<variant> Сауда шарты
<variant> Бизнес-инкубатор

<question3> Нарық механизмінің негізгі элементтері
<variantright> Бәсеке, баға, сұраныс және ұсыныс
<variant> Құн, құн, баға
<variant> Сұраныс, ұсыныс және бәсеке
<variant> Құн, құн, баға, ұсыныс, ұсыныс және бәсеке
<variant> Құн, сұраныс, өндіріс және тұтыну

<question3> Бизнес-жобаның тиімділігі дегеніміз не?
<variantright> нәтижені шығындармен салыстыру және оны бағалау
<variant> көлемдік түрдегі кез келген өндірістің нәтижесі
<variant> өндірістің дамуының соңғы нәтижесі
<variant> операциялық пайда
<variant> өндіріске енгізу нәтижелері

<question3> Табыс пен өндіріс шығындарының айырмашылығы:
<variantright> пайда
<variant> құн
<variant> шығындар
<variant> табыс
<variant> табыстылық

<question3> Кәсіпкердің қаржылық ресурстары
<variantright> жарғылық капитал, несиелер
<variant> өнімнің өзіндік құны
<variant> негізгі және айналым капиталы
<variant> материалдық емес активтер
<variant> тауарлы-материалдық қорлар

<question3>  Теріс әлеуметтік бағыттағы жігерлі кәсіпкерді қалай атаймыз?
<variantright> «Акула»
<variant> «Шаян»
<variant> «Дельфин»
<variant> «Бегемот»
<variant> «Піл»

<question3> Позитивті әлеуметтік бағыттағы жігерлі кәсіпкерді қалай атаймыз?
<variantright> «Дельфин»
<variant> «Шаян»
<variant> «Акула»
<variant> «Бегемот»
<variant> «Піл»

<question3> Теріс әлеуметтік бағыттағы энергиясы төмен кәсіпкер қалай аталады?
<variantright> «Шаян»
<variant> «Акула»
<variant> «Дельфин»
<variant> «Бегемот»
<variant> «Балық»

<question3> Canvas бизнес үлгісі неше қадамнан (кезеңнен) тұрады?
<variantright> 9
<variant> 7
<variant> 5
<variant> 3
<variant> 10

<question3> Бизнес-жоспардың ұсынылып отырған жобаның нәтижелері мен қорытындыларын сипаттайтын бөлімінде өндіріс пен өнімнің жаңалығы туралы айтылады:
<variantright> Түйіндеме
<variant> Маркетингтік жоспар
<variant> Қаржылық жоспар
<variant> Ұйымдастыру-басқару жоспары
<variant> Өндіріс жоспары

<question3> Маркетинг дегеніміз:
<variantright> тұтынушылардың қажеттіліктерін қанағаттандыру арқылы пайда табуға бағытталған компанияның әрекеті
<variant> жүзеге асыру барысында өзгерген жағдайларға сәйкес түзетілуі мүмкін кез келген жоспарланған және әзірленген іс-қимыл бағдарламалары арқылы мақсаттар мен оларға жету жолдарын анықтау
<variant> өндірісті басқарудың әдістерінің, формалары мен құралдарының, оны барынша тиімді пайдалануға мүмкіндік беретін жиынтығы
<variant> нарықты зерттеу әдістерінің жиынтығы
<variant> өнімдер мен қызметтерді жарнамалау шараларының жүйесі

<question3> Маркетингтің негізгі элементтерін қамтитын модель, аббревиатура:
<variantright> Модель 4Р
<variant> Модель 5P
<variant> Модель 4D
<variant> Модель 5D
<variant> Модель 5С
`