export const testingName = `Компьютерлік моделдеу`;
export const testingStr = `
<question1> Модельдеудің модельдеу мақсаттарын анықтау, яғни мәселені қою кезеңі:
<variantright> Бірінші кезең
<variant> Екінші кезең
<variant> Үшінші кезең
<variant> Төртінші кезең
<variant> Бесінші кезең

<question1> Объектіні математикалық түрде сипаттау кезеңі?
<variantright> Үшінші кезең
<variant> Бірінші кезең 
<variant> Екінші кезең
<variant> Төртінші кезең
<variant> Бесінші кезең

<question1> Эксперименттер жоспарын құру кезеңі?
<variantright> Бесінші кезең
<variant> Екінші кезең
<variant> Үшінші кезең
<variant> Төртінші кезең
<variant> Бірінші кезең

<question1> Алгоритм құрылып, соған сәйкес программа жазылатын кезең?
<variantright> Төртінші кезең
<variant> Екінші кезең
<variant> Үшінші кезең
<variant> Бірінші кезең
<variant> Бесінші кезең

<question1> Компьютерлік модельдеу артықшылықтары:
<variantright> кіріс деректердің жүйеге сәйкес өзгеру заңдылықтары
<variant> заманауи математиканың барлық аппаратын қолдану 
<variant> қажетті эксперименттерді қолдану
<variant> жүйенің элементтер саны мен қатынастарын анықтау
<variant> аталған шамаларды өзгерту, сұраныстарды кешіктіру

<question1> Компьютерлік модельдеу кезінде қолданылатын құрал
<variantright> Заманауи математиканың практикалық аппараттары
<variant> Басқа материалдан немесе масштабта орындалған объектің көшірмесі
<variant> Басқа табиғи модельдердің жиыны
<variant> Нақты объектті абстракты түрде көрсету - ауызша суреттеу
<variant> Математикалық қатынастармен формализацияланған суреттеу

<question1> Имитациялық және аналитикалық модельдердің айырмашылығы 
<variantright> Оқиға ықтималдығының үлестірім заңын көрсету 
<variant> Математикалық формуламен үлестірім заңын көрсету 
<variant> Имитациялық модельдерді құру ерекшелігінде
<variant> Рекурренттік қатынастар арқылы үлестірім заңын алу
<variant> Кездейсоқ сандарды қолдану ерекшелігінде

<question1> Модельдеу кезінде объект қозғалысына тигізілетін әсерлерді есепке алу:
<variantright> болжау
<variant> ранжирлеу
<variant> түсінік 
<variant> басқару
<variant> оператор

<question1> Компьютерлік модельдеу дегеніміз
<variantright> Есептеуіш (имитациялық) модельдеу
<variant> «Құбылыстарды және процестерді визуалдау»(графикалық модельдеу)
<variant> Мамандандырылған қолданбалы технологиялар
<variant> Компьютерді нақты уақытты тәртіпте қолдану
<variant> Компьютер және өлшеу аспабы, көрсеткіштер, сенсорлар жиыны

<question1> Математикалық модельдер
<variantright> формула түріндегі таңбалық модельдердің ауқымды класы
<variant> шынайы салаларды сипаттауға арналған табиғи тілді қолданады
<variant> ақпараттық процесстерді сипаттайтын таңбалық модельдер класы
<variant> физикалық процесстерді сипаттайтын теңдеулер жүйесі
<variant> жұмыстың оңтайлы жоспарын есептеуге арналған қатынастар

<question1> Ақпараттық модельдер
<variantright> ақпараттық процесстерді сипаттайтын таңбалық модельдер класы 
<variant> формула түріндегі таңбалық модельдердің ауқымды класы 
<variant> шынайы салаларды сипаттауға арналған табиғи тілді қолданады
<variant> физикалық процесстерді сипаттайтын теңдеулер жүйесі
<variant> жұмыстың оңтайлы жоспарын есептеуге арналған қатынастар

<question1> Математикалық модель объект немесе процесстің маңызды белгілерін қалай бейнелейді?
<variantright> теңдеулер, формулалар түріндегі математикалық құралдармен 
<variant> шынайы салаларды сипаттауға арналған табиғи тілді қолданады
<variant> ақпараттық процесстерді сипаттайтын таңбалық модельдер класы
<variant> физикалық процесстерді сипаттайтын теңдеулер жүйесі
<variant> жұмыстың оңтайлы жоспарын есептеуге арналған қатынастар

<question1> Модельдеу процесінің кезеңдері?
<variantright> сапалық талдау, математикалық жүзеге асыру, верификация, модельді тану
<variant> адамның денсаулығын бағалау, қоршаған ортаны ластайтын заттардың адамға әсері
<variant> кіріспе, айғақтайтын, қорытынды
<variant> модельдеу, жобалау, құрылымын құру
<variant> бастапқы, соңғы

<question1> Абстрактілі модельдердің жіктелуі:
<variantright> вербальды, схемалық, математикалық
<variant> материалдық, абстрактілі
<variant> ақпараттық, бейнелеуші
<variant> жобаланатын, айғақтайтын
<variant> модельдеу, жобалау, құрылымын құру

<question1> Уақыт бойынша өз жағдайын өзгертпейтін модельдер
<variantright> статистикалық модельдер
<variant> динамикалық модельдер
<variant> вербальды модельдер
<variant> тербеліс процесстері
<variant> тәжірибелік модель

<question1> Үздіксіз кездейсоқ шамаларды модельдеу әдістерінің жіктелуі 
<variantright> аналитикалық, таңдамалы, ықтимал, аралас
<variant> Нейманның шектеу әдісі
<variant> ξ кездейсоқ шамасын түрлендіру қажет
<variant> Нейман әдісі
<variant> шектік теоремалар әдісі

<question1> Көрсеткіштер мәнінің үлкен санының заңдылыққа сәйкестігі
<variantright> жүзеге асыру санының жеткіліктілігі
<variant> алғашқы болжамдарды тексеру
<variant> эксперименттер саны мен бағалау дәлдігі
<variant> мерзімнің басынан соңына дейінгі уақыт 
<variant> сенімді деректерді алу керек

<question1> Агрегаттау принципі 
<variantright> Жүйені стандартты математикалық схемалар арқылы сипаттау
<variant> Нақты жүйе қасиеттері, тиімділік көрсеткішіне әсер ететін
<variant> Қойылған зерттеу мақсатына шектелген уақытта жету
<variant> Жүйе туралы априорлық мәліметтердің критикалық деңгейі
<variant> Мақсатқа жету ықтималдығы нольден айырмашылығы бар

<question1> Практикалық барлық ғылымда модельдерді құру және қолдану 
<variantright> Танып білудің қуатты құралы
<variant> Оларды зерттеудің жақсы тәсілі
<variant> Тек нақты бір шекарасын суреттейді 
<variant> Нақты объекттен көп қарапайым 
<variant> Сондай тәсілдің жемістілігін көрсетеді

<question1> Теориялық физика, механика, химия, биология саласындағы модельдеу
<variantright> Техникалық құралдарсыз математикалық модельдеу
<variant> Ақпараттық модельдер және модельдеу
<variant> Ауызша (яғни мәтіндік) тілде жасалатын модельдер
<variant> Ақпараттық технологиялар
<variant> Компьютерлік модельдеу

<question1> Өрескел қателерді жою құралы:
<variantright> қарапайым тестілеу
<variant> заманауи әдіс
<variant> алгоритмді құру
<variant> құрылымдық программалау
<variant> идентификация

<question1> Белгілі бір бүтіндіктің бірлігін құрайтын өзара байланысқан элементтер кешені 
<variantright> жүйе
<variant> бүтіндік
<variant> құрылымдық
<variant> модель
<variant> бірлік

<question1> Математикалық модельде объекттің немесе процестің маңызды белгілерінің көрсетілуі 
<variantright> теңдеулер тілімен және басқа математикалық құралдармен
<variant> информатикамен технологиялық байналысын
<variant> ақпаратты өңдеу лайықты технологияларды қолдануды
<variant> өзінң ерекше тілінде процестің заңдылықтарын
<variant> формулалармен, зерттеу нәтижелерін айтушы деректерді

<question1> Математикалық модельдеу жағдайында компьютерлердің қолданылуы
<variantright> Абстракцияларды визуальдау үшін
<variant> Тек қана сандық есептеу үшін 
<variant> Тек қана сандық есептеу үшін емес
<variant> Аналитикалық өзгертулерге 
<variant> Күрделі формула бойынша есептеуге

<question1> Түсіну үшін модельдеу мақсатының бірінші кезеңі
<variantright> Құрылымын, негізгі қасиеттерін, даму заңдарын және ортамен әрекеттестікті анықтау
<variant> Модель объекті (немесе процесті) басқаруды үйрену үшін керек
<variant> Берілген мақсаттар, критерийлер жағдайында басқару ең жақсы тәсілдерін анықтау
<variant> Модель түзу және жанама зардаптарды болжамдау үшін керек
<variant> Объектіге берілген тәсілдерді орындалуы және әсер түрлерін анықтау

<question1> Басқару үшін модельдеу мақсатының бірінші кезеңі
<variantright> Берілген мақсаттар, критерийлер жағдайында басқарудың жақсы тәсілдерін анықтау
<variant> Құрылымын, негізгі қасиеттерін, даму заңдарын, ортамен әрекеттестікті анықтау
<variant> Модель объекті (немесе процесті) басқаруды үйрену үшін керек
<variant> Модель түзу және жанама зардаптарды болжамдау үшін керек
<variant> Объектіге берілген тәсілдерді орындалуы және әсер түрлерін анықтау

<question1> Болжау үшін модельдеу мақсатының бірінші кезеңі
<variantright> Объектіге берілген тәсілдердің орындалуын және әсер түрлерін анықтау
<variant> Берілген мақсаттар және критерийлер жағдайында басқарудың жақсы тәсілдерін анықтау
<variant> Модель объектті (немесе процесті) басқаруды үйрену үшін керек
<variant> Құрылымын, негізгі қасиеттерін, даму заңдарын, ортамен әрекеттестікті анықтау
<variant> Модель түзу және жанама зардаптарды болжамдау үшін керек

<question1> Материалдық модельдер қандай мақсатта қолданылады?
<variantright> техникалық мақсатта
<variant> химиялық мақсатта
<variant> теориялық мақсатта
<variant> шаруашылық мақсатта
<variant> жаңа технологияларды жасау

<question1> Формула құруға арналған күрделі, әр шығармашылық процесс
<variantright> алгоритмді құру 
<variant> құрылымдау 
<variant> заманауи әдіс 
<variant> идентификациялау
<variant> қарапайым тестілеу 

<question1> Математикалық модельдеудiң сапалық талдаудағы айнымас бөлiгi
<variantright> вербальды және схемалық модельдер
<variant> абстрактлы және материалдық модельдер
<variant> абстрактлы және схемалық модельдер
<variant> материалдық және вербальды
<variant> жылжымалы және сандық

<question1> Модельдеуші алгоритмді ұсынудың кең таралған түрі: 
<variantright> блок-схема
<variant> Δt принципі
<variant> δz принципі
<variant> «жүргізу» принципі
<variant> бірнеше принциптер

<question1> Z -тің жуық мәндерінің уақыт кезеңдерінде рекурентті түрде алынуы 
<variantright> Δt принципі
<variant> бірнеше принциптер 
<variant> δz принципі
<variant> «жүргізу» принципі 
<variant> формула арқылы

<question1> Алгоритм тізімінің әрбір блогы қандай қарапайым операцияларды құрайды?
<variantright> арифметикалық, логикалық әдістер
<variant> сұраныс кірісі, орындалу, шығыс
<variant> үлестіруді құру алгоритмі
<variant> құрылымдық схемалар (блок-схемалар)
<variant> ездейсоқ процесстер ағынын көрсету

<question1> Агрегативтік принципі
<variantright> Күрделі жүйені агрегаттардан құрылушы ретінде ұсыну
<variant> Нақты жүйе қасиеттері, тиімділік көрсеткішіне әсер ететін
<variant> Қойылған зерттеу мақсатына шектелген уақытта жету
<variant> Жүйе туралы априорлық мәліметтердің критикалық деңгейі
<variant> Мақсатқа жету ықтималдығы нольден айырмашылығы бар

<question1> Аналитикалық модель 
<variantright> Математикалық аппаратты қатаң түрде қолдана отырып, теориялық тұжырымдама құру
<variant> Математикалық аппаратты ескере отырып, теориялық тұжырымдама құру
<variant> Математикалық аппаратты пайдалану арқылы теориялық тұжырымдаманы жоққа шығару
<variant> Математикалық аппаратты қолдана отырып есептеу
<variant> объектiнiң немесе жүйенiң жылдық мерзiмiн көрсетедi

<question1> Кездейоқ шамалардың сандық сипатталуы
<variantright> математикалық күтім, дисперсия 
<variant> Фон Нейман көрсеткіштері
<variant> рекурренттік қатынастар
<variant> үлестіру функциясы және дисперсия 
<variant> математикалық күтім, үлестіру функциясы 

<question1> Кездейсоқ сандар тізбегі арқылы әртүрлі есептерді шешу 
<variantright> Монте-Карло әдісі
<variant> Ньютон әдісі
<variant> Кеплер заңы
<variant> Гравитациялық тұрақтылық 
<variant> шексіздік

<question1> Random стандартты функциясы 
<variantright> Аралықтағы кездейсоқ сандарды өңдейді
<variant> Белгісіз мәндерді анықтайды
<variant> Белгісіз мәнді есептеу функциясы 
<variant> Айнымалыларды жариялау үшін қолданылады
<variant> Рекурренттік қатынастар құру функциясы

<question1> “Стохастикалық таңдау” әдісінің қолданылуы
<variantright> “Кездейсоқ қозғалыс” есебін шешуге
<variant> Оқиға ықтималдығының үлестірім заңын көрсетуге
<variant> Рекурренттік қатынастар құруға
<variant> Имитациялық модельдерді құру жағдайында
<variant> Кездейсоқ сандарды қолдануға

<question1> Монте-Карло әдісі 
<variantright> “Стохастикалық таңдау” әдісі
<variant> Рекурренттік қатынастар
<variant> Оқиға ықтималдығы үлестірім заңын көрсету
<variant> Имитациялық модельдерді құру
<variant> Кездейсоқ сандарды қолдану

<question1> Бірқалыпты үлестірім заңы бар кездейсоқ сандар қалай алынады?
<variantright> Рекурренттік қатынастар арқылы
<variant> Математикалық формуламен
<variant> Модельдеуші алгоритм құру арқылы
<variant> Оқиға ықтималдығы үлестірім заңынан
<variant> Имитациялық модельдерді құру арқылы

<question1> Модельдің негізгі объектіге сәйкестігінің анықталуы
<variantright> Тек қана оған тәжірибе жасау, нәтижелерді талдау барысында
<variant> Мәні төмен факторларды лақтырып тастап, модельдеу объектін нобайлап
<variant> Тек қана оның негізгі қасиеттерін және заңдылықтарын түсіну жолымен
<variant> Модельдеу мақсаттарына жету барысында
<variant> Тек қана көбірек дәл математикалық суреттеу іздеу жолымен

<question1> Математикалық модельдеудiң сапалық талдаудағы айнымас бөлiгi
<variantright> вербальды және схемалық модельдер
<variant> абстрактлы және материалдық модельдер
<variant> абстрактлы және схемалық модельдер
<variant> материалдық және вербальдық
<variant> аналитикалық және талдау

<question1> Монте-Карло әдісінің кең қолданылу кезеңі
<variantright> Имитациялық модельдерді құру жағдайында 
<variant> Оқиға ықтималдығы үлестірім заңын табу кезінде
<variant> Кездейсоқ сандарды генерациялағанда
<variant> Рекурренттік қатынастарды құру жағдайында
<variant> Математикалық формуламен үлестірім заңын шығаруға

<question1> Монте-Карло әдісі неге негізделеді?
<variantright> Кездейсоқ сандарды қолдануға
<variant> Кездейсоқ сандарды генерациялауға
<variant> Математикалық формулаға
<variant> Оқиға ықтималдығы үлестірім заңына
<variant> Математикалық статистика әдістеріне

<question1> Жүйедегі процесстер туралы статистикалық деректердің өңделуі
<variantright> Математикалық статистика әдістерін қолдану арқылы
<variant> ЭЕМ-де статистикалық деректерді имитациялау арқылы
<variant> Бірқалыпты үлестрімді базалық тізбегін қалыптастыру
<variant> Кездейсоқ сандарды генерациялау әдістері арқылы
<variant> ЭЕМ бағдарламалық-техникалық құралдары арқылы

<question1> Кездейсоқ сандар генераторы дегеніміз 
<variantright> Бірқалыпты үлестрімді сандар тізбегін қалыптастыру
<variant> ЭЕМ-де статистикалық деректерді имитациялау
<variant> Математикалық статистика әдістерін қолдану
<variant> ЭЕМ бағдарламалық - техникалық құралдарын өңдеу
<variant> Кездейсоқ сандарды генерациялау әдістері

<question1> Модельдеуші алгоритмді құру және орындау үшін қажетті құралдар
<variantright> ЭЕМ бағдарламалық-техникалық құралдары
<variant> Математикалық статистика әдістері
<variant> Бірқалыпты үлестрімді сандардың базалық тізбегі
<variant> Оқиға ықтималдығы үлестірім заңын білу
<variant> Кездейсоқ сандар генераторын құру қажет

<question1> S жүйесін статистикалық модельдеу нәтижесінде алынады
<variantright> Параметрдің жеке нақтыламаларының сериясы
<variant> Басқару жүйесінің моделі және сигналдары
<variant> Нақты X(t) кездейсоқ сигналдың Xk(t) нақтыламасы
<variant> Тиісті Yk(t) нақтыламасы нәтижелері
<variant> Аталған процедура n рет қайталанған нәтижелері

<question1> Басқару жүйесі моделінің кірісінде берілетін шама
<variantright> Нақты X(t) кездейсоқ сигналдың Xk(t) нақтыламасы
<variant> Басқару жүйесінің моделі және сигналдары
<variant> Параметр жеке нақтынамаларының сериясы
<variant> Тиісті Yk(t) нақтыламасы нәтижелері
<variant> Аталған процедура n рет қайталанған нәтижелері

<question1> Басқару жүйесі моделінің шығысында алынатын шама
<variantright> Тиісті Yk(t) нақтыламасының нәтижелері
<variant> Нақты X(t) кездейсоқ сигналдың Xk(t) нақтыламасы
<variant> Басқару жүйесінің моделі және сигналдары
<variant> Аталған процедура n рет қайталанған нәтижелері
<variant> Параметр жеке нақтынамаларының сериясы

<question1> Жүйенің модельдеу нәтижелері статистикалық тұрақтылыққа ие болатын жағдай
<variantright> орындау саны N жеткілікті үлкен болса
<variant> дәлдікті 10 арттыру тәжірибелер санын 100 есе көбейтсе
<variant> бірқалыпты үлестрімді кездейсоқ сандардың базалық тізбегі болса
<variant> аралығында тұрақты оң мөлшерге, ал одан тысқары жерде нөлге тең болса
<variant> математикалық өрнектердің көмегімен алынған z нақтыламалары болса

<question1> Монте-Карло әдісі арқылы жасалған эксперименттер дәлдігі мен санының байланысы 
<variantright> ε шамасын 10 есе кеміту үшін тәжірибелер санын 100 есе арттыру қажет 
<variant> дәлдікті кеміту кезінде орындау саны N жеткілікті үлкен болады
<variant> бірқалыпты үлестрімді кездейсоқ сандардың базалық тізбегі арқылы
<variant> аралығында тұрақты оң мөлшерге, ал одан тысқары жерде нөлге тең
<variant> математикалық өрнектердің көмегімен алынған z санымен

<question1> Табиғаты әр алуан элементтерді ЭЕМ-де қалыптастыру үшін қажет
<variantright> бірқалыпты үлестірімді кездейсоқ сандардың базалық тізбегі 
<variant> дәлдікті 10 арттыру тәжірибелер санын 100 есе көбейту керек
<variant> дәлдікті кемітіп, орындау саны N жеткілікті үлкейту қажет
<variant> аралығында тұрақты оң мөлшерге, ал одан тысқары жерде нөлге тең
<variant> математикалық өрнектердің көмегімен алынған z нақтыламалары

<question1> Абстрактылы модельдердің үш типі
<variantright> вербальды, схемалық, математикалық
<variant> вербальды, схемалық, геометриалық
<variant> вербальды, схемалық, имитациялық
<variant> вербальды, схемалық, верификациялық
<variant> жаңа технологияларды жасау, өңдеу және пайдалану

<question1> Құрылу тәсілі бойынша модельдердің екі класқа жіктелуі:
<variantright> материалдық және абстрактілі
<variant> материалдық және биологиялық
<variant> абстрактілі және биологиялық
<variant> шынайы және биологиялық
<variant> химиялық және биологиялық

<question1> Қандай модельдер физикалық табиғаты бойынша түпнұсқаға ұқсас және түпнұсқаның геометриялық ұқсастықтарын сақтай қалады? 
<variantright> материалдық
<variant> стандартты
<variant> абстрактілі
<variant> шынайы
<variant> стандартты емес

<question1> Қандай модельдер түпнұсқаны сөз түрінде немесе символдар мен операциялар арқылы сипаттай алады?
<variantright> абстрактілі
<variant> стандартты
<variant> материалдық
<variant> шынайы
<variant> белсенді

<question1> Модель неше талапқа сәйкес келу керек?
<variantright> екі
<variant> төрт
<variant> үш
<variant> бес
<variant> алты

<question1> Кездейсоқ сандардың толықтай сипатталуы
<variantright> функцияның үлестіру тығыздығымен 
<variant> математикалық күтім, дисперсия 
<variant> рекуренттік қатынастар көмегімен 
<variant> алдыңғы сандарды сызықтық емес түрлендірумен 
<variant> үлестіру функциясы және дисперсия 

<question1> Абстрактілі модельдерді қандай үш типке жіктеуге болады?
<variantright> вербальды, схемалық, математикалық
<variant> вербальды, схемалық, геометриалық
<variant> вербальды, схемалық, имитациялық
<variant> вербальды, схемалық, верификациялық
<variant> жаңа технологияларды жасау, өңдеу және пайдалану

<question1> Модельдеуші алгоритмді қру және компьютерде орындау үшін не қажет?
<variantright> ЭЕМ -нің бағдарламалық-техникалық құралдары 
<variant> математикалық статистика әдістері 
<variant> тең таратылған базалық тізбек 
<variant> оқиғаның таралу ықтималдығының заңдылығы 
<variant> кездейсоқ сандар генераторын құру қажет 

<question1> S жүйесін статистикалық модельдеу нәтижесінде не алынады?
<variantright> ізделінді шамалар немесе функциялардың дербес мәндерінің тобы 
<variant> кейбір стандартты процесстерді генерациялау
<variant> объектілер мен контейнерлер арасындағы байланыс
<variant> кемінде біреуінде бірден артық болу
<variant> А жиынынң қуаты В жиынының қуатынан артық, яғни |A| > n |B| |

<question1> Теориялық верификация қандай жағдайда жүргізіледі?
<variantright> эмпирикалық материалдар болмағанда 
<variant> эмпирикалық материалдар болғанда
<variant> эмпирикалық материалдар жиыны 
<variant> инновациялық жұмыстар жүргізгенде
<variant> аналитикалық жұмыстар жүргізгенде

<question1> Уақыт бойынша өз күйін өзгертпейтін объект немесе жүйені бейнелейтін модельдер:
<variantright> статистикалық
<variant> динамикалық
<variant> вербальды
<variant> тербелістік
<variant> магниттік

<question1> Уақыт бойынша өз күйін өзгертетін объект немесе жүйені бейнелейтін модельдер:
<variantright> динамикалық
<variant> статистикалық
<variant> шынайы
<variant> вербальды
<variant> монотонды

<question1> Аналитикалық түрлендіру әдісі:
<variantright> кері функция әдісі
<variant> ξ базалық кездейсоқ шаманы түрлендіру қажет
<variant> Нейманның шектеу әдісі
<variant> шектік теоремалар әдісі
<variant> аналитикалық, ықтималдық әдістер

<question1> Сайлап түрлендіру әдісі
<variantright> Нейманның шектеу әдісі 
<variant> ξ базалық кездейсоқ шаманы түрлендіру қажет
<variant> кері функция әдісі
<variant> шектік теоремалар әдісі
<variant> аналитикалық, ықтималдық әдістер

<question1> Ықтималдық түрлендіру әдісі
<variantright> шектік теоремалар әдісі 
<variant> ξ базалық кездейсоқ шаманы түрлендіру қажет
<variant> кері функция әдісі
<variant> Нейманның шектеу әдісі
<variant> аналитикалық, ықтималдық әдістер

<question1> Іргелі компьютерлік программалар үшін есептің қойылуы кезінде келесі жұмыстарды жүргізу қажет:
<variantright> верификациялық
<variant> имитациялық
<variant> модульдік
<variant> миграциялық
<variant> аналитикалық

<question1> Танымдық түпнұсқамен объективті түрде сәйкес келетін объект қалай аталады? 
<variantright> модель
<variant> құрылым
<variant> жүйе
<variant> экожүйе
<variant> звено

<question1> Компьютерные модельдердің бөлінуі:
<variantright> имитациялық және ұйымдасатын
<variant> динамикалық және статистикалық
<variant> математикалық және аналитикалық
<variant> схемалық және вербальды
<variant> статистикалық және математикалық

<question1> «Орташа квадраттар» алгоритмін ұсынған кім?
<variantright> Фон Нейман и Метрополис 1946 ж.
<variant> Д.Леймер 1948 ж.
<variant> Ван Вейнгарден 1948 ж.
<variant> Фон Нейман және Д.Леймер 1946 ж.
<variant> Ван Вейнгарден және Метрополис1946 ж.

<question1> Қосындылау әдісін кім және қашан ұсынған?
<variantright> Ван Вейнгарден 1948 ж.
<variant> Фон Нейман және Метрополис 1946 ж.
<variant> Д.Леймер 1948 ж.
<variant> Фон Нейман және Д.Леймер1946 ж.
<variant> Ван Вейнгарден және Метрополис1946 ж.

<question1> Модельдеу (түсіну) мақсатын анықтаудың бірінші кезеңі:
<variantright> құрылымы, негізгі қасиеттері, дамыту заңдылықтары және әрекеттесу 
<variant> модель объектіні (немесе процессті) басқару үшін қажет
<variant> берілген критерий бойынша басқарудың тиімді тәсілдерін анықтау 
<variant> модель тікелей және жанама әсерлерді болжамдау үшін қажет 
<variant> берілген тәсілдер мен формаларың әсерін жүзеге асыру

<question1> Жалпы жағдайдағы оқиғалар арасындағы уақыт интервалдары
<variantright> векторлық кездейсоқ шама құрауыштарын жүзеге асыру 
<variant> моменттер тізбегі t1, t2,... tn
<variant> бір-бірінен тәуелсіз, әрқайсысы өзі шақырылған
<variant> Si бір жағдайдан Sj екінші жағдайға кездейсоқ өту
<variant> бірнеше біртекті ағындар ретінде

<question1> Компьютерлік модельдің артықшылықтары;
<variantright> қажетті эксперименттерді қолдану
<variant> орташа кезек; күту уақыты
<variant> қатынастарды, элменеттер санын анықтау
<variant> аталған шамаларды өзгерту, сұраныстарды кешіктіру
<variant> кіріс деректердің өзгеру заңдылықтары

<question1> Модельдеуші алгоритмнің қызметтері
<variantright> бақылау, әрбір қадамды имитациялау 
<variant> контролирование логической структуры, положения
<variant> создание структурных схем (блок-схем)
<variant> выполнение арифметических, логических операций
<variant> формирование распределения, запросов

<question1> Зерттеу мақсатының сипатына қарай модельдердің жіктелуі 
<variantright> оңтайландыру және дескриптивті 
<variant> физикалық және символдық 
<variant> динамикалық және и статикалық
<variant> детерминделген және стохастикалық
<variant> геометриялық ұқсастық моделі 

<question1> Уақыт факторы бойынша математикалық модельдердің жіктелуі 
<variantright> динамикалық және статикалық 
<variant> физикалық және символдық
<variant> оңтайландыру және дескриптивті 
<variant> детерминделген және стохастикалық
<variant> семантикалық және математикалық

<question1> Кездейсоқ шамалардың қатысуы бойынша математикалық модельдердің жіктелуі 
<variantright> детерминделген және стохастикалық 
<variant> физикалық және символдық
<variant> оңтайландыру және дескриптивті 
<variant> динамикалық және статикалық 
<variant> семантикалық және математикалық

<question1> Сыңарлық ағындарға келтіруге болатын ағынның мысалы
<variantright> әуежайға келген ұшақтардың ағыны
<variant> троллейбустан түскен жолаушылар ағыны
<variant> қарқындылығының уақытқа тәуелді емес ағын
<variant> анықтама бюросына келе жатқан адамдар
<variant> анықтама алған адамдар ағыны

<question1> Сыңар емес оқиғалар ағыны ретінде келтіруге болатын ағын
<variantright> троллейбустан түскен жолаушылар ағыны
<variant> әуежайға келген ұшақтардың ағыны
<variant> нысанаға бағытталған оқтардың ағыны
<variant> анықтама бюросына келе жатқан адамдар
<variant> анықтама алған адамдар ағыны

<question1> Стационарлық ағынның стационарлық емес ағыннан айырмашылығы
<variantright> қарқындылығының уақытқа тәуелді еместігі
<variant> анықтама алған адамдар ағыны 
<variant> анықтама бюросына келе жатқан адамдар
<variant> әуежайға келген ұшақтардың ағыны
<variant> троллейбустан түскен жолаушылар ағыны

<question1> Іс жүзінде соңғы әрекеті жоқ ағыннның мысалы
<variantright> анықтама бюросына келе жатқан адамдар
<variant> нысанаға бағытталған оқтардың ағыны
<variant> анықтама алған адамдар ағыны
<variant> әуежайға келген ұшақтардың ағыны
<variant> троллейбустан түскен жолаушылар ағыны 

<question1> Әртүрлі схемалар, суреттер, графиктер, фотосуреттер түрінде жасалатын модельдер 
<variantright> схемалық
<variant> шынайы
<variant> математикалық
<variant> вербальды
<variant> химиялық

<question1> Сипатына қарай модельдердің жіктелуі 
<variantright> статистикалық және динамикалық
<variant> шынайы және табиғи
<variant> табиғи және материалдық
<variant> шынайы және жасанды
<variant> материалдық және материалдық емес

<question1> Абстрактілі модельдердің түрлері
<variantright> вербальды, схемалық, математикалық
<variant> вербальды, схемалық, геометриалық
<variant> вербальды, схемалық, имитациялық
<variant> вербальды, схемалық, верификациялық
<variant> жаңа технологияларды жасау, өңдеу және пайдалану

<question1> Құрылу тәсіліне байланысты модельдердің жіктелуі
<variantright> материалдық және абстрактілі
<variant> шынайы және табиғи
<variant> табиғи және материалдық
<variant> шынайы және жасанды
<variant> материалдық және материалдық емес

<question1> Физикалық табиғатына сай түпнұсқамен сәйкес модельдер 
<variantright> материалдық
<variant> стандартты
<variant> абстрактілі
<variant> шынайы
<variant> стандартты емес

<question1> Түпнұсқаны сөз түрінде сипаттауға арналған модельер 
<variantright> абстрактілі
<variant> стандартты
<variant> материалдық
<variant> шынайы
<variant> белсенді

<question1> Модельге қойылатын талаптар саны
<variantright> 2
<variant> 4
<variant> 3
<variant> 5
<variant> 6

<question1> Кездейсоқ сандар сипаты
<variantright> функцияның үлестіру тығыздығымен 
<variant> математикалық күтім, дисперсия 
<variant> рекуренттік қатынастар көмегімен 
<variant> алдыңғы сандарды сызықтық емес түрлендірумен 
<variant> үлестіру функциясы және дисперсия

<question1> Абстрактілі модельдердің жіктелуі
<variantright> вербальды, схемалық, математикалық
<variant> вербальды, схемалық, геометриалық
<variant> вербальды, схемалық, имитациялық
<variant> вербальды, схемалық, верификациялық
<variant> жаңа технологияларды жасау, өңдеу және пайдалану

<question1> Модельдеуші алгоритмді құру және компьютерде орындауға қажетті құралдар
<variantright> ЭЕМ -нің бағдарламалық-техникалық құралдары 
<variant> математикалық статистика әдістері 
<variant> тең таратылған базалық тізбек 
<variant> оқиғаның таралу ықтималдығының заңдылығы 
<variant> кездейсоқ сандар генераторын құру қажет 

<question1> S жүйесін статистикалық модельдеу нәтижесі
<variantright> ізделінді шамалар немесе функциялардың дербес мәндерінің тобы 
<variant> кейбір стандартты процесстерді генерациялау
<variant> объектілер мен контейнерлер арасындағы байланыс
<variant> кемінде біреуінде бірден артық болу
<variant> А жиынынң қуаты В жиынының қуатынан артық, яғни |A| > n |B| |

<question1> Теориялық верификацияны жүргізу жағдайы
<variantright> эмпирикалық материалдар болмағанда 
<variant> эмпирикалық материалдар болғанда
<variant> эмпирикалық материалдар жиыны 
<variant> инновациялық жұмыстар жүргізгенде
<variant> аналитикалық жұмыстар жүргізгенде

<question1> Уақыт бойынша өз күйін өзгертпейтін объект немесе жүйенің моделі
<variantright> статистикалық
<variant> динамикалық
<variant> вербальды
<variant> тербелістік
<variant> магниттік

<question1> Уақыт бойынша өз күйін өзгертетін объект немесе жүйенің моделі
<variantright> динамикалық
<variant> статистикалық
<variant> шынайы
<variant> вербальды
<variant> монотонды

<question1> Аналитикалық түрлендіруге жататын әдіс
<variantright> кері функция әдісі
<variant> ξ базалық кездейсоқ шаманы түрлендіру қажет
<variant> Нейманның шектеу әдісі
<variant> шектік теоремалар әдісі
<variant> аналитикалық, ықтималдық әдістер

<question2> Сайлап түрлендіруге жататын әдіс
<variantright> Нейманның шектеу әдісі 
<variant> ξ базалық кездейсоқ шаманы түрлендіру қажет
<variant> кері функция әдісі
<variant> шектік теоремалар әдісі
<variant> аналитикалық, ықтималдық әдістер

<question2> Ықтималдық түрлендіруге жататын әдіс
<variantright> шектік теоремалар әдісі 
<variant> ξ базалық кездейсоқ шаманы түрлендіру қажет
<variant> кері функция әдісі
<variant> Нейманның шектеу әдісі
<variant> аналитикалық, ықтималдық әдістер

<question2> Іргелі компьютерлік программалар үшін есептің қойылуы кезінде жүргізілетін жұмыстар:
<variantright> верификациялық
<variant> имитациялық
<variant> модульдік
<variant> миграциялық
<variant> аналитикалық

<question2> Танымдық түпнұсқаға сәйкес объект
<variantright> модель
<variant> құрылым
<variant> жүйе
<variant> экожүйе
<variant> бөлім

<question2> Компьютерлік модельдердің жіктелуі:
<variantright> имитациялық және өзі туындайтын
<variant> динамичкалық және статистикалық
<variant> математикалық және аналитикалық
<variant> схемалық және вербальді
<variant> статикалық және математикалық

<question2> Қосындылау әдісін қашан жасалған және кім ұсынған?
<variantright> Ван Вейнгарден 1948 ж.
<variant> Фон Нейман және Метрополис 1946 ж.
<variant> Д.Леймер 1948 ж.
<variant> Фон Нейман және Д.Леймер1946 ж.
<variant> Ван Вейнгарден және Метрополис1946 ж.

<question2> Бірінші кезең - модельдеу (түсіну) мақсатын анықтау
<variantright> құрылымы, негізгі қасиеттері, дамыту заңдылықтары және әрекеттесу 
<variant> модель объектіні (немесе процессті) басқару үшін қажет
<variant> берілген критерий бойынша басқарудың тиімді тәсілдерін анықтау 
<variant> модель тікелей және жанама әсерлерді болжамдау үшін қажет 
<variant> берілген тәсілдер мен формаларың әсерін жүзеге асыру

<question2> Оқиғалар арасындағы уақыт интервалдары
<variantright> векторлық кездейсоқ шама құрауыштарын жүзеге асыру 
<variant> моменттер тізбегі t1, t2,... tn
<variant> бір-бірінен тәуелсіз, әрқайсысы өзі шақырылған
<variant> Si бір жағдайдан Sj екінші жағдайға кездейсоқ өту
<variant> бірнеше біртекті ағындар ретінде

<question2> Компьютерлік модельдің басымдылықтары:
<variantright> қажетті эксперименттерді қолдану
<variant> орташа кезек; күту уақыты
<variant> қатынастарды, элменеттер санын анықтау
<variant> аталған шамаларды өзгерту, сұраныстарды кешіктіру
<variant> кіріс деректердің өзгеру заңдылықтары

<question2> Модельдеуші алгоритмнің негізгі функциялары
<variantright> бақылау, әрбір қадамды имитациялау 
<variant> контролирование логической структуры, положения
<variant> создание структурных схем (блок-схем)
<variant> выполнение арифметических, логических операций
<variant> формирование распределения, запросов

<question2> Модельдерді зерттеу мақсатының сипатына қарай жіктеу
<variantright> оңтайландыру және дескриптивті 
<variant> физикалық және символдық 
<variant> динамикалық және и статикалық
<variant> детерминделген және стохастикалық
<variant> геометриялық ұқсастық моделі 

<question2> Математикалық модельдерді уақыт факторы бойынша жіктеу
<variantright> динамикалық және статикалық 
<variant> физикалық және символдық
<variant> оңтайландыру және дескриптивті 
<variant> детерминделген және стохастикалық
<variant> семантикалық және математикалық

<question2> Математикалық модельдердің кездейсоқ шамалардың қатысуы бойынша жіктелуі 
<variantright> детерминделген және стохастикалық 
<variant> физикалық және символдық
<variant> оңтайландыру және дескриптивті 
<variant> динамикалық және статикалық 
<variant> семантикалық және математикалық

<question2> Ординарлы емес оқиғалар ағынының мысалдары 
<variantright> троллейбус аялдамасына келген жолаушылар ағыны
<variant> аэропоортқа келген ұшақтар ағыны
<variant> нысанаға бағытталған оқтар ағыны 
<variant> мекен-жай бюросына хабарласқан адамдар ағыны 
<variant> анықтама алған адамдар ағыны 

<question2> Ординарлы оқиғалар ағынының мысалдары
<variantright> аэропортқа келген ұшақтар ағыны 
<variant> троллейбус аялдамасына келген жолаушылар ағыны
<variant> нысанаға бағытталған оқтар ағыны 
<variant> мекен-жай бюросына хабарласқан адамдар ағыны 
<variant> анықтама алған адамдар ағыны 

<question2> Стационар және стационар емес ағындардың айырмашылығы
<variantright> ағын қарқындылығы уақытқа тәуелді емес
<variant> троллейбус аялдамасына келген жолаушылар ағыны
<variant> нысанаға бағытталған оқтар ағыны 
<variant> мекен-жай бюросына хабарласқан адамдар ағыны 
<variant> анықтама алған адамдар ағыны 

<question2> Компьютердің көмегімен физикалық процесстерді модельдеу саласы
<variantright> Компьютерлік физика
<variant> Теориялық физика
<variant> Кванттық физика
<variant> Механикалық физика
<variant> Термодинамика

<question2> Координаттар осінде бейнеленген дене үшін лақтыру процесінің аяқталу шарты 
<variantright> y=0 
<variant> y=1
<variant> y=0,5 
<variant> y=10 
<variant> y=0,1

<question2> 5,5 км биіктікте ауа тығыздығы жер бетіне қарағанда 
<variantright> 2 есе аз
<variant> 3 есе аз
<variant> 4 есе аз
<variant> 2 есе көп
<variant> 10 есе аз

<question2> 11 км биіктікте ауа тығыздығы жер бетіне қарағанда 
<variantright> 4 есе аз
<variant> 3 есе аз
<variant> 2 есе аз
<variant> 2 есе көп
<variant> 10 есе аз

<question2> Космостық денелердің қозғалысы
<variantright> Тұрақты жылдамдықпен шеңбер бойынша қозғалады
<variant> Тұрақты жылдамдықпен қозғалады
<variant> Түзу сызық бойынша қозғалады
<variant> Жоғары жылдамдықпен қозғалады
<variant> Тұрақсыз жылдамдықпен шеңбер бойынша қозғалады

<question2> Еркін түсу кезінде дененің еркін болуына әсер ететін шама 
<variantright> Ауа кедергісі
<variant> Масса
<variant> Ауырлық күші
<variant> Еркін түсу үдеуі
<variant> Тартылыс күші

<question2> Дененің еркін түсуіне әсер ететін күш
<variantright> кедергі күші 
<variant> масса
<variant> ауырлық күші
<variant> еркін түсу үдеуі
<variant> тартылыс күші

<question2> Ауа кедергісі болмаған жағдайда еркін түсіп келе жатқан дененің жылдамдығы 5-ші секундта қаншаға артады?
<variantright> 10 м/с
<variant> 15 м/с
<variant> 20 м/с
<variant> 25 м/с
<variant> 45 м/с

<question2> Ракетаның жоғары көтерілуі кезіндегі кедергі күші
<variantright> Fкедергі = k2v2
<variant> Fкедергі = k2v
<variant> Fкедергі = k2v3
<variant> Fкедергі = k2
<variant> Fкедергі = ma

<question2> Жоғары биіктікте ракета массасының өзгеруі
<variantright> ауа кедергісі әсерінен кемиді
<variant> ауа кедергісі әсерінен артады
<variant> өзгермейді
<variant> жылдамдық әсерінен кемиді
<variant> үдеу әсерінен кемиді

<question2> Снарядтың ұшуын модельдеуге қажетті параметрлер
<variantright> бастапқы жылдамдық, траектория бұрышы, нүктелер саны 
<variant> бастапқы жылдамдық
<variant> еркін түсу үдеуі, ауа кедергісі, басапқы және соңғы жылдамдық
<variant> траектория бұрышы, нүктелер саны
<variant> нүктелер саны

<question2> Снарядтың қозғалыс кезіндегі x координатасының t уақыттан тәуелділігін сипаттайтын теңдеу
<variantright> x(t) = x0 + vx0 * t
<variant> y(t) = x0 + vy0*t - g*t2 / 2
<variant> vx0= v0*cos(α)
<variant> vy0= v0*sin(α)
<variant> x(t) = vx0 * t

<question2> Снарядтың қозғалыс кезіндегі y координатасының t уақыттан тәуелділігін сипаттайтын теңдеу
<variantright> y(t) = x0 + vy0*t - g*t2 / 2 
<variant> x(t) = x0 + vx0 * t
<variant> vx0= v0*cos(α)
<variant> vy0= v0*sin(α)
<variant> x(t) = vx0 * t

<question2> Теннисшінің дайындығы барысында допты лақтыруға арналған автоматтың жұмысына қатысты модель
<variantright> бұрыштан көкжиекке лақтырылған дененің қозғалысы 
<variant> дененің еркін түсу үдеуі
<variant> зарядталған бөлшектер мен аспан денелерінің қозғалысы 
<variant> маятниктің қозғалысы 
<variant> толқындық тербелістер

<question2> Жоғары лақтыру кезінде х координатасын өзгертпейтін бұрыш мәні
<variantright> α=900
<variant> α=450
<variant> α=1800
<variant> α=00
<variant> α=400

<question2> Көкжиекке бұрыш жасай лақтырылған денеге әсер ететін күш
<variantright> ауырлық күші
<variant> кедергі күші
<variant> тартылыс күші,
<variant> еркін түсу үдеуі
<variant> жылдамдық

<question2> Жер бетінен 11 км қашықтықтағы ауа тығыздығының айырмашылығы
<variantright> 4 есе кем
<variant> 3 есе кем
<variant> 2 есе кем
<variant> 2 есе артық
<variant> 10 есе артық

<question2> Аспан денелерінің қозғалысы 
<variantright> орбита бойымен тұрақты жылдамдықпен қозғалады 
<variant> тұрақты жылдамдықпен қозғалады 
<variant> түзу сызық бойымен қозғалады 
<variant> жоғарғы жылдамдықпен қозғалады 
<variant> тербеліс сызықтары бойымен тұрақты қозғалады

<question2> Дененің еркін түсуіне әсер ететін күш 
<variantright> кедергі күші 
<variant> масса
<variant> ауырлық күші
<variant> ерткін түсуі
<variant> тартылыс күші

<question2> Модельдеу программасының құрамында бірінші орында не болу керек?
<variantright> кездейсоқ сандар генераторы 
<variant> біртегіс таратылған xi
<variant> логикалық құрылым
<variant> құрылымдық схема
<variant> бастапқы болжамдар

<question2> Дененің еркін түсу жылдамдығы 5-ші секундта кедергі күшінің қатысуынсыз қаншаға артады?
<variantright> 10 м/с
<variant> 15 м/с
<variant> 20 м/с
<variant> 25 м/с
<variant> 45 м/с

<question2> Объектінің үлкейтілген және кішірейтілген моделі 
<variantright> практикалық модель
<variant> имитациялық модель 
<variant> статистикалық модель 
<variant> ойындар теориясы
<variant> математикалық модель

<question2> Еркін түсу үдеуінің мәні
<variantright> g=9.8 м/с2
<variant> g=9.8 м/с
<variant> g=9.8 м
<variant> g=9.8 м2/с2
<variant> g=0

<question2> Аспанға көтерілген кезде ракета қандай күшпен соқтығысады? 
<variantright> Fс = k2v2
<variant> Fс = k2v
<variant> Fс = k2v3
<variant> Fс = k2
<variant> Fс = ma

<question2> Жоғарғы биіктікте ракета массасының өзгеруі
<variantright> кедергі күшінің әсерінен кемиді 
<variant> кедергі күшінің әсерінен артады
<variant> өзгермейді
<variant> жылдамдық есебінен кемиді
<variant> жылдамдық есебінен артады 

<question2> Снарядтың ұшуын модельдеу параметрлері
<variantright> жылдамдық, траектория бұрышы
<variant> жылдамдық
<variant> еркін түсу үдеуі 
<variant> траектория бұрышы, кедергі күші
<variant> кедергі коэффициенті

<question2> Қарапайым дифференциальдық теңдеуді шешу әдісі
<variantright> Эйлер-Коши әдісі
<variant> Ньютон әдісі
<variant> Геронф ормуласы
<variant> Кеплер заңы
<variant> Симпсон әдісі

<question2> Физикалық құбылыстардың математикалық модельдерінің теориясы
<variantright> Математикалық физика
<variant> Компьютерлік физика
<variant> Кванттық физика
<variant> Теориялық физика
<variant> Математикалық талдау

<question2> Астрономиялық бірлік
<variantright> Жерден Күнге дейінгі қашықтық 
<variant> кедергі күші
<variant> тартылыс күші
<variant> дененің еркін түсу үдеуі
<variant> жылдамдық

<question2> Объектіні модельдеудің шектік мақсатына жету 
<variantright> басқару
<variant> түсінік
<variant> болжау
<variant> ранжирлеу 
<variant> оператор

<question2> Математикалық әдістерді қолдану технологиясы келесі модельдерге жіктеледі:
<variantright> аналитикалық және сандық
<variant> шынайы және материалдық
<variant> вербальді және шынайы
<variant> шынайы және табиғи
<variant> вербальді және табиғи

<question2> Классикалық математикалық физика есептерін зерттеудегі негізгі құралдар
<variantright> Дифференциалдық және интегралдық теңдеулер
<variant> Алгоритмді өңдеу тәсілі 
<variant> Сәйкестігін табу
<variant> Қарапайым тесттілеу
<variant> Заманауи объектіге-бағытталған программалау тәсілдері

<question2> Процедуралық – бағытталған бағдарламалау тәсілі 
<variantright> Құрылымдық бағдарламалау
<variant> Алгоритм өңдеу
<variant> Сәйкестігін табу
<variant> Қарапайым тесттілеу
<variant> Заманауи тәсіл

<question2> Объектіге - бағытталған бағдарламалау тәсілі
<variantright> Заманауи тәсіл
<variant> Қарапайым тесттілеу
<variant> Алгоритм өңдеу
<variant> Сәйкестігін табу
<variant> Құрылымдық бағдарламалау

<question2> Модельдің негізгі объектіге сәйкес екендігін анықтау
<variantright> Тек қана оған тәжірибе жасау, нәтижелерді талдау барысында
<variant> Мәні төмен факторларды лақтырып тастап, модельдеу объектін нобайлап
<variant> Тек қана оның негізгі қасиеттерін және заңдылықтарын түсіну жолымен
<variant> Модельдеу мақсаттарына жету барысында
<variant> Тек қана көбірек дәл математикалық суреттеу іздеу жолымен

<question2> П.М.Брусиловский, Г.С.Розенбург компьютерлiк моделдердi қандай топтарга бөлдi ?
<variantright> имитациялық және өздiгiнен қалыптасушы
<variant> миграциялық және демографиялық
<variant> модулдiк және миграциялық
<variant> имитациялық және модулдiк
<variant> аналитикалық және жобалық

<question2> Теориялық верификацияны қандай жағдайда өткiзедi?
<variantright> Эмпирикалық материалдар жоқ болганда
<variant> Эмпирикалық материалдар болганда
<variant> Эмпирикалық материалдар көп болганда
<variant> Эмпирикалық материалдар бiрде болып бiрде болмаган жагдайда
<variant> объектiнiң немесе жүйенiң жылдық мерзiмiн көрсетедi

<question2> Табиғи құбылыстардың келешекте қалай болып дамитынын ғылыми негiзде ұйымдастыру 
<variantright> болжау жасау
<variant> құбылыстарды реттеу
<variant> ғылыми жұмыс жасау
<variant> даму барысын қадағалау
<variant> жаңа инновациялық жұмыстарды қарастыру

<question2> Верификациялық моделдердi iске асыру үшiн қандай тексеруден өткiзу қажет
<variantright> эмпирикалық
<variant> имитациялық
<variant> модулдiк
<variant> миграциялық
<variant> аналитикалық

<question2> Теориялық верификацияны қандай жағдайда өткiзедi?
<variantright> Эмпирикалық материалдар жоқ болганда
<variant> Эмпирикалық материалдар болганда
<variant> Эмпирикалық материалдар көп болганда
<variant> Эмпирикалық материалдар бiрде болып бiрде болмаган жағдайда
<variant> жаңа инновациялық жұмыстарды қарастыру

<question2> Модельдеу дегеніміз
<variantright> объектілерді, процесстерді немесе құбылыстарды зерттеу мақсатында олардың моделін құру
<variant> модель құрылымдарын механикалық жолмен iске асыру
<variant> модель құрылымдарын физика-механикалық жолмен iске асыру
<variant> модель құрылымдарын теориялық әдiспен iске асыру
<variant> белгiлi бiр объективтi сәйкестiкте тұпнұсқамен және таным этаптарының бөлiктерiнде орын алмастыруга қабiлетсiз субъект

<question2> Шын мәніндегі нақты объектіні өте жоғары дәлдікпен бейнелейтін модель
<variantright> имитациялық модель
<variant> материалдық модель
<variant> вербальды модель
<variant> математикалық модель
<variant> абстрактылы модель

<question2> Қойылған мақсатқа жетуде әсер ету мүмкіндігіне ие процесстерді сипаттау мақсатында қолданылатын модель
<variantright> оңтайландыру моделі
<variant> материалдық модель
<variant> вербальды модель
<variant> математикалық модель
<variant> абстрактылы модель

<question2> Математикалық формулалар көмегімен объекттің аса маңызды қасиеттерін сипаттау кезеңі 
<variantright> математикалық модельді құру кезеңі
<variant> есептің қойылуы
<variant> компьютерлік модельді құру кезеңі
<variant> компьютерлік эксперимент жүргізу кезеңі
<variant> нәтижені талдау кезеңі

<question2> Математикалық модельді компьютерге түсінікті тілде өрнектеу кезеңі
<variantright> компьютерлік модельді құру кезеңі 
<variant> есептің қойылуы
<variant> математикалық модельді құру кезеңі
<variant> компьютерлік эксперимент жүргізу кезеңі
<variant> нәтижені талдау кезеңі

<question2> Ақпараттық таңбалық модель
<variantright> химиялық формула
<variant> материалдық модель
<variant> блок-схема
<variant> сурет
<variant> жер картасы

<question2> Бір немесе бірнеше болмыс нақтылығын (шындығын) түсіндіретін кеңейтілген білім жүйесі
<variantright> теория
<variant> тұжырым
<variant> идея
<variant> түсінік
<variant> әдіс

<question2> Қандай технологиялық схемалар, егер реакцияның шығымы аз болса, реагенттердің айналу дәрежесіне жетеді? 
<variantright> циклды схемалар
<variant> ашық тізбекті технологиялық схемалар
<variant> реагенттер айналу дәрежесі технологиялық поцестерге тәуелді емес
<variant> алынған өнім массасы
<variant> тармақталған

<question2> Компьютерде жүзеге асырылған математикалық модель
<variantright> компьютерлік математикалық модель
<variant> есептеу эксперименті
<variant> ашық тізбекті технологиялық схемалар
<variant> түсінік
<variant> әдіс

<question2> Компьютерлік модель көмегімен есептеулер жүргізу 
<variantright> есептеу эксперименті 
<variant> компьютерлік математикалық модель
<variant> ашық тізбекті технологиялық схемалар
<variant> түсінік
<variant> әдіс

<question2> Сараптаманың соңғы қорытындысы
<variantright> объекттің моделі
<variant> объекттің құрылымы
<variant> объекттің схемасы
<variant> объекттің формасы
<variant> объекттің жоспары

<question2> Есептеуіш математика және имитациялық модельдеу есептерін шешу жүйесі 
<variantright> MatLab 
<variant> Corel Draw
<variant> AutoCad
<variant> Paint
<variant> Turbo Pascal

<question2> Статистикалық модель 
<variantright> объект жөнінде алынған ақпараттың белгілі бір уақыт бөлігіндегі үзіндісі 
<variant> уақыт барысындағы объекттің қасиеттерінің өзгерісін көрсету мүмкіндігі
<variant> объекті схемасы
<variant> объекті формасы
<variant> объекті жоспары

<question2> Динамикалық модель 
<variantright> уақыт барысындағы объекттің қасиеттерінің өзгерісін көрсету мүмкіндігі 
<variant> объект жөнінде алынған ақпараттың белгілі бір уақыт бөлігіндегі үзіндісі
<variant> объекті схемасы
<variant> объекті формасы
<variant> объекті жоспары

<question2> Графикалық пішіндер мен көлемді конструкциялар
<variantright> геометриялық модель
<variant> материалдық модель
<variant> Құрылымдық модельдер 
<variant> Арнайы модельдер 
<variant> Логикалық модель

<question2> Иллюстрацияны пайдаланып, ауызша және жазбаша сипаттаулар
<variantright> Ауызша модель
<variant> Материалдық модель
<variant> Құрылымдық модельдер 
<variant> Арнайы модельдер 
<variant> Логикалық модель

<question2> Арнайы модельдер
<variantright> ноталар, химиялық формулалалар
<variant> объект жөнінде алынған ақпараттың белгілі бір уақыт бөлігіндегі үзіндісі
<variant> уақыт барысындағы объекттің қасиеттерінің өзгерісін көрсету мүмкіндігі 
<variant> Иллюстрацияны пайдаланып, ауызша және жазбаша сипаттаулар 
<variant> Графикалық пішіндер мен көлемді конструкциялар

<question2> Модельдеудің негізгі кезеңдерін атаңыз
<variantright> Есептің қойылымы, Модель құру, Компьютерлік эксперимент, Шешім қабылдау 
<variant> Есептің қойылымы, Модель құру, Компьютерлік модель, Шешім қабылдау
<variant> Есептің берілуі, Модель құру, Компьютерлік модель, Шешім қабылдау, Нәтижені талдау;
<variant> Есептің қойылымы, Модель құру
<variant> Компьютерлік модель, Шешім қабылдау, Нәтижені талдау;

<question2> Уақыт факторына байланысты модельдердің бөлінуі
<variantright> Динамикалық және статистикалық модельдер 
<variant> Материалдық және ақпараттық модельдер
<variant> Вербальдік және таңбалық модельдер
<variant> Арнайы модельдер 
<variant> Логикалық модель

<question2> Программалық орта көмегімен жүзеге асатын модель
<variantright> Компьютерлік модель
<variant> Материалдық модель
<variant> Құрылымдық модельдер 
<variant> Арнайы модельдер 
<variant> Логикалық модель

<question2> Тестілеу деп нені айтады?
<variantright> Модельдің дұрыстығын тексеруді 
<variant> Есептің қойылымы мен модель құруды
<variant> Шешім қабылдау мен нәтижені талдауды
<variant> Модельдеу жоспарын құруды
<variant> Модельдеу технологиясын анықтауды

<question2> Құрылымдық модельдерге не жатады?
<variantright> Схемалар, графиктер, кестелер, т.б 
<variant> Ноталар, химиялық формулалар
<variant> Иллюстрациялар, ауызша және жазбаша сипаттаулар
<variant> Иллюстрацияны пайдаланып, ауызша және жазбаша сипаттаулар 
<variant> Графикалық пішіндер мен көлемді конструкциялар

<question2> Компьютерлік математикалық модельдеудің бірінші кезеңі
<variantright> Модельдеудің мәселені қою, яғни модельдеу мақсаттарын анықтау кезеңі
<variant> Объектінің математикалық моделін құру кезеңі
<variant> Объектінің компьютерлік моделін құру кезеңі
<variant> Есептеу эксперименттерін жүргізу кезеңі
<variant> Нәтижені талдау, яғни дұрыс болса модельді қабылдау, болмаса қайта құру кезеңі

<question2> Компьютерлік математикалық модельдеудің екінші кезеңі
<variantright> Объектінің математикалық моделін құру кезеңі 
<variant> Модельдеудің мәселені қою, яғни модельдеу мақсаттарын анықтау кезеңі
<variant> Объектінің компьютерлік моделін құру кезеңі
<variant> Есептеу эксперименттерін жүргізу кезеңі
<variant> Нәтижені талдау кезеңі

<question2> Компьютерлік математикалық модельдеудің үшінші кезеңі
<variantright> Объектінің компьютерлік моделін құру кезеңі 
<variant> Модельдеудің мәселені қою, яғни модельдеу мақсаттарын анықтау кезеңі
<variant> Объектінің математикалық моделін құру кезеңі
<variant> Есептеу эксперименттерін жүргізу кезеңі
<variant> Нәтижені талдау кезеңі

<question2> Компьютерлік математикалық модельдеудің төртінші кезеңі
<variantright> Есептеу эксперименттерін жүргізу кезеңі 
<variant> Модельдеудің мәселені қою, яғни модельдеу мақсаттарын анықтау кезеңі
<variant> Объектінің математикалық моделін құру кезеңі
<variant> Объектінің компьютерлік моделін құру кезеңі
<variant> Нәтижені талдау кезеңі

<question2> Компьютерлік математикалық модельдеудің бесінші кезеңі
<variantright> Нәтижені талдау кезеңі 
<variant> Модельдеудің мәселені қою, яғни модельдеу мақсаттарын анықтау кезеңі
<variant> Объектінің математикалық моделін құру кезеңі
<variant> Есептеу эксперименттерін жүргізу кезеңі
<variant> Объектінің компьютерлік моделін құру кезеңі

<question2> Жүйедегі процестер туралы статистикалық деректер қалай өңделеді?
<variantright> Математикалық статистика әдістерін қолдану арқылы
<variant> ЭЕМ-де статистикалық деректерді имитациялау арқылы
<variant> Бірқалыпты үлестрімді базалық тізбегін қалыптастыру
<variant> Кездейсоқ сандарды генерациялау әдістері арқылы
<variant> ЭЕМ бағдарламалық-техникалық құралдары арқылы

<question2> Модельдеу алгоритмін құруға және оны орындауға қажетті құралдар
<variantright> ЭЕМ-нің бағдарламалық-техникалық құралдары
<variant> Математикалық статистика әдістері
<variant> Бірқалыпты үлестрімді базалық тізбегі
<variant> Оқиға ықтималдығының үлестірім заңы
<variant> Кездейсоқ сандар генераторын құруға қажет құрал

<question2> Кездейсоқ ξ шамасы [a,b] аралығында қашан бірқалыпты үлестірім заңына бағынады?
<variantright> [a,b]аралығында тұрақты оң мөлшерге, одан тысқары жерде нөлге тең болса
<variant> бірқалыпты үлестрімді кездейсоқ сандардың базалық тізбегі болса
<variant> математикалық өрнектердің көмегімен алынған z нақтыламалары бар болса
<variant> дәлдікті 10 арттыру тәжірибелер санын 100 есе көбейтсе
<variant> дәлдікті кемітіп, орындау саны N жеткілікті үлкейткенде

<question2> Моделдеудiң бiрiншi кезеңін қалай атауға болады
<variantright> сапалы талдау
<variant> сапасыз талдау
<variant> сандық талдау
<variant> сұрыптау талдау
<variant> табиғи талдау

<question2> Вербальды модельдеу дегенiмiз 
<variantright> Иллюстрация, кесте және мәтін түрiнде сипатталган жаратылыстану саласының формальды үлгiсi
<variant> Иллюстрация, кесте және макет түрiнде сипатталган жаратылыстану ғылымдарының арнайы үлгiсi
<variant> Иллюстрация, кесте және сызба түрiнде сипатталған үлгiсi
<variant> Макет немесе схема түрiнде сипатталган жаратылыстану ғылымдарының формальды үлгiсi
<variant> әртүрлі сипатталған формальды үлгі

<question2> Динамикалық модель ненi көрсетедi?
<variantright> Өз қалпының уақыт бойынша өзгеруiн көрсетедi
<variant> өз қалпын маусым бойынша өзгермейтiнiң көрсетедi
<variant> өз қалпын маусым және жыл бойынша өзгермеуiн көрсетедi
<variant> өз қалпын тұрақты қалыпта болуын көрсетедi
<variant> объектiнiң немесе жүйенiң жылдық мерзiмiн көрсетедi

<question2> Теориялық верификацияны қандай жағдайда өткізеді?
<variantright> Эмпирикалық материалдар жоқ болғанда
<variant> Эмпирикалық материалдар болғанда
<variant> Эмпирикалық материалдар көп болғанда
<variant> Эмпирикалық материалдар бiрде болып бiрде болмаған жагдайда
<variant> объектiнiң немесе жүйенiң жылдық мерзiмiн көрсетедi

<question2> Кез келген модель құрау үшiн қойылатын мақсат
<variantright> жеткiлiктi толық модель жасау
<variant> модель құрастыру
<variant> модель ұйымдастыру
<variant> модель жинау және есептеу
<variant> жаңа үлгі жасау 

<question2> Аналитикалық модель дегенiмiз 
<variantright> Математикалық аппаратты қатаң түрде қолдана отырып, теориялық тұжырымдама құру
<variant> Математикалық аппаратты ескере отырып, теориялық тұжырымдама құру
<variant> Математикалық аппаратты пайдалану арқылы теориялық тұжырымдаманы жоққа шығару
<variant> Математикалық аппаратты қолдана отырып есептеу
<variant> жаңа инновациялық жұмыстарды қарастыру

<question2> Модельдеудiң бірінші кезеңі
<variantright> есептің және модельдеу мақсатының қойылуы 
<variant> модель құрылымдарын механикалық жолмен iске асыру
<variant> модель құрылымдарын физика-механикалық жолмен iске асыру
<variant> модель құрылымдарын теориялық әдiспен iске асыру
<variant> жаңа үлгі жасау

<question2> Модельдеудiң екiншi кезеңі
<variantright> модель құрылымдарын математикалық жолмен iске асыру
<variant> модель құрылымдарын механикалық жолмен iске асыру
<variant> модель құрылымдарын физика-механикалық жолмен iске асыру
<variant> модель құрылымдарын теориялық әдiспен iске асыру
<variant> жаңа үлгі жасау

<question2> Қандай модельдерде болжау-статистикалық есептер қолданылады?
<variantright> өздігінен ұйымдастырылатын
<variant> нақты есептерде
<variant> шынайы есептерде
<variant> аналитикалық есептерде
<variant> динамикалық шынайы есептерде

<question2> Құрылу әдiсiне қарай модельдер қанша класқа бөлiнедi?
<variantright> 2
<variant> 3
<variant> 5
<variant> 7
<variant> 12

<question2> Құрылу әдiсiне қарай модельдердің класстарға бөлінуі
<variantright> материялдық және абстрактылы
<variant> материалдық және аналитикалық
<variant> материалдық және имитациялық
<variant> материалдық және теориялық
<variant> жаңа және ескі

<question2> Модельдеу процесінің негізгі кезеңдері
<variantright> сапалық талдау, математикалық орындау, верификация, модельді зерттеу
<variant> Басқа материалдан немесе масштабта орындалған объектің көшірмесі
<variant> Басқа табиғи модельдердің жиыны
<variant> Нақты объектті абстракты түрде көрсету - ауызша суреттеу
<variant> Қайсыбір ережемен, математикалық қатынастармен формализацияланған суреттеу

<question2> Нақты объекттің немесе оның бөлшектерінің өзгеру заңдары 
<variantright> Модель түсінігі
<variant> Объектті оның нақты түрінен басқа түріне ұсқас түрде ұсыну
<variant> Бүтін сандардың жүйесі, нақты сандардың жүйесі
<variant> Евклидтік геометрия, алгебралық топ
<variant> Топологиялық кеңістік

<question2> Математикалық әдістерді қолдану технологиясына сай модельдердің жіктелуі
<variantright> аналитикалық және сандық
<variant> шынайы және материалдық
<variant> вербальді және шынайы
<variant> шынайы және табиғи
<variant> вербальді және табиғи

<question3> Заманауи математиканың практикалық барлық аппаратын қолдану 
<variantright> Компьютерлік модельдеу кезінде 
<variant> Басқа материалдан немесе масштабта орындалған объектің көшірмесі
<variant> Басқа табиғи модельдердің жиыны
<variant> Нақты объектті абстракты түрде көрсету - ауызша суреттеу
<variant> Қайсыбір ережемен, математикалық қатынастармен формализацияланған суреттеу

<question3> Теориялық физика саласындағы модель
<variantright> Техникалық құралдарсыз математикалық модельдеу
<variant> Ақпараттық модельдер және модельдеу
<variant> Ауызша (яғни мәтіндік) тілде жасалатын модельдер
<variant> Ақпараттық (компьютерлік) технологиялар
<variant> Компьютерлік модельдеу

<question3> Есептеуіш (имитациялық) модельдеу 
<variantright> Компьютерлік модельдеу 
<variant> «Құбылыстарды және процестерді визуалдау»(графикалық модельдеу)
<variant> «Биік» технологиялар, мамандандырылған қолданбалы технологиялар
<variant> Компьютерді нақты уақытты тәртіпте қолдану
<variant> Компьютер және өлшеу аспабы, көрсеткіштер, сенсорлар жиыны

<question3> Математикалық модельде теңдеулер тілімен және басқа математикалық құралдармен көрсетіледі
<variantright> объекттің немесе процестің маңызды белгілері
<variant> информатикамен технологиялық байналысы
<variant> ақпаратты өңдеу лайықты технологияларды қолдануды
<variant> өзінң ерекше тілінде процестің заңдылықтары
<variant> формулалармен, зерттеу нәтижелерін айтушы деректерді

<question3> Абстракцияларды визуальдау дегеніміз 
<variantright> Математикалық модельдеу жағдайында компьютерлерді қолдану
<variant> Тек қана сандық есептеулер жүргізу үшін компьютерлерді қолдану
<variant> Аналитикалық өзгертулерге
<variant> Тек қана сандық есептеу үшін емес
<variant> Күрделі формула бойынша есептеуге

<question3> Модельдеу түсінігі дегеніміз
<variantright> модельді зерттеу, құру және қолдану процесі
<variant> модельді қолдану процесі
<variant> модельді зерттеу процесі
<variant> модельді құру және қолданысқа енгізу процесі
<variant> модельді тиімді қолдану процесі

<question3> Күрделі жүйені агрегаттардан құрылушы ретінде ұсыну 
<variantright> Агрегативтік принципі
<variant> Нақты жүйе қасиеттері, тиімділік көрсеткішіне әсер ететін
<variant> Қойылған зерттеу мақсатына шектелген уақытта жету
<variant> Жүйе туралы априорлық мәліметтердің критикалық деңгейі
<variant> Мақсатқа жету ықтималдығы нольден айырмашылығы бар

<question3> Модельдердің көптік принципі
<variantright> Жүйені әр түрлі жағынан және әр түрлі дәрежемен көрсететін модельдер қатары 
<variant> Нақты жүйе қасиеттері, тиімділік көрсеткішіне әсер ететін
<variant> Қойылған зерттеу мақсатына шектелген уақытта жету
<variant> Жүйе туралы априорлық мәліметтердің критикалық деңгейі
<variant> Мақсатқа жету ықтималдығы нольден айырмашылығы бар

<question3> Барлық парамерлері ықтималдықтарды сәйкес үлестірумен сипатталатын модельдер
<variantright> ықтималдық
<variant> детерминирленген
<variant> статистикалық
<variant> динамикалық
<variant> оңтайландыру

<question3> Параметрлеу принципі 
<variantright> Модельде ішкі жүйелерді лайықты сандық мөлшерлермен ауыстыру
<variant> Нақты жүйе қасиеттері, тиімділік көрсеткішіне әсер ететін
<variant> Қойылған зерттеу мақсатына шектелген уақытта жету
<variant> Жүйе туралы априорлық мәліметтердің критикалық деңгейі
<variant> Мақсатқа жету ықтималдығы нольден айырмашылығы бар

<question3> Бірнеше принциптер қай уақытта қатар қолданылады? 
<variantright> Күрделі жүйелердің модельдеуші алгоритмін құру кезінде
<variant> модельдің блок-схемасын сызу кезінде қолданылады
<variant> Δt принципі қолданылады
<variant> δz принципі қолданылады
<variant> «Жетектеп өткізу» принципі қолданылады

<question3> Тәжірибеде алгоритмді бейнелеудің кең тараған түрі 
<variantright> блок-схема
<variant> Δt принципі
<variant> δz принципі
<variant> «Жетектеп өткізу» принципі
<variant> бірнеше принциптер 

<question3> Δt принципі 
<variantright> z функциясының әр мезгілдегі мәндерін рекурренттік қатынастар арқылы табу
<variant> модельдің блок-схемасын сызу кезінде қолданылады
<variant> Δt принципі қолданылады
<variant> δz принципі қолданылады
<variant> «Жетектеп өткізу» принципі қолданылады

<question3> δz принципі 
<variantright> аз уақыт аралығында жүйенің әртүрлі қасиеттерін қолдану
<variant> Δt принципі бойынша жұмыс істеу
<variant> бірнеше принциптер
<variant> «Жетектеп өткізу» принципі бойынша жүйеде жұмыс істеу
<variant> формула жазылады

<question3> «Жетектеп өткізу» принципі 
<variantright> Жүйеге келіп түскен әрбір өтінішті басынан бастап бақылау
<variant> Нақты жүйе қасиеттері, тиімділік көрсеткішіне әсер ету
<variant> Қойылған зерттеу мақсатына шектелген уақытта жету
<variant> Жүйе туралы априорлық мәліметтердің критикалық деңгейі
<variant> Мақсатқа жету ықтималдығы нольден айырмашылығы бар

<question3> Тәжірибе нәтижесінде дискретті не үздіксіз мән қабылдайтын шама
<variantright> Кездейсоқ шама
<variant> Тұрақты шама
<variant> Айнымалы шама
<variant> Белгісіз шама
<variant> Шексіз мән

<question3> Берілген оқиғаның пайда болу санының барлық жүргізілген тәжірибелер санына қатынасы 
<variantright> Кездейсоқ оқиғалардың жиілігі (оқиғаның статистикалық ықтималдығы)
<variant> таным этаптарының бөлiктерiнде орын алмастыруга қабiлетсiз субъект
<variant> белгiлi бiр заттың немесе құрылымның түпнұсқасын кiшiрейтiлген түрде жасау
<variant> белгiлi бiр заттың немесе құрылымның түпнұсқасын үлкейтiлген түрде жасау
<variant> жаңа үлгі жасау әдісі

<question3> Монте-Карло әдісі 
<variantright> Есепті жуықтап шешудің әдісі
<variant> Ньютон әдісі
<variant> Кеплер заңында қолданылатын әдістің бірі
<variant> Гравитациялық тұрақты есебі
<variant> Шексіз мән

<question3> [0,1) аралығындағы кездейсоқ сандарды өңдейді 
<variantright> Random стандартты функциясы
<variant> Белгісіз мәндерді анықтайды
<variant> Айнымалыларды жариялау үшін қолданылады
<variant> Белгісіз мәнді есептеу функциясы
<variant> Рекурренттік қатынастар құру функциясы

<question3> Физикалық процесстерді модельдеу нәтижелерін ұсыну формалары
<variantright> Диаграмма, график, қозғалыс траекториясы 
<variant> Рекурренттік қатынастар
<variant> Оқиға ықтималдығы, үлестірім заңын көрсету
<variant> Имитациялық модельдерді құру
<variant> Кездейсоқ сандарды қолдану

<question3> Жылу өткізгіштік процесі
<variantright> Диффузия
<variant> Анимация
<variant> Имитация
<variant> Импликация
<variant> Генерация

<question3> Рекурренттік қатынастар арқылы алынады 
<variantright> Бірқалыпты үлестірім заңы бар кездейсоқ сандар 
<variant> Математикалық формуламен берілген өрнектер
<variant> Модельдеуші алгоритм құру арқылы
<variant> Оқиға ықтималдығы үлестірім заңынан
<variant> Имитациялық модельдерді құру арқылы

<question3> Аналитикалық және имитациялық модельдердің айырмашылығы 
<variantright> Оқиға ықтималдығының үлестірім заңын көрсету түрінде
<variant> Имитациялық модельдерді құру ерекшелігінде
<variant> Математикалық формуламен үлестірім заңын көрсету
<variant> Рекурренттік қатынастар арқылы үлестірім заңын алу
<variant> Кездейсоқ сандарды қолдану ерекшелігінде

<question3> Сапалық талдауда қолданылатын модельдер
<variantright> вербальды және схемалық модельдер
<variant> абстрактлы және материалдық модельдер
<variant> абстрактлы және схемалық модельдер
<variant> материалдық және вербальдық
<variant> аналитикалық және талдау

<question3> Физика ғылымында компьютерді қолданудың негізгі бағыты
<variantright> Физикалық құбылыстарды комьютерлік модельдеу 
<variant> Оқиға ықтималдығы кезінде үлестірім заңын табу 
<variant> Кездейсоқ сандарды генерациялау
<variant> Рекурренттік қатынастарды құру жағдайыу
<variant> Математикалық формуламен үлестірім заңын шығару

<question3> Физикадағы сандық модельдеу
<variantright> Есептеуіш эксперимент 
<variant> Кездейсоқ сандарды генерациялау
<variant> Математикалық формула
<variant> Оқиға ықтималдығы үлестірім заңы
<variant> Математикалық статистика әдістері

<question3> Vx = Vo cos α 
<variantright> Бастапқы жылдамдық векторының горизонталь проекциясы
<variant> Бастапқы жылдамдық векторының вертикаль проекциясы 
<variant> Жылдамдық векторының бастапқы мәні
<variant> Жылдамдық векторының соңғы мәні 
<variant> Еркін түсу үдеуін есептеу формуласы 

<question3> Vу=Vo sin α 
<variantright> Бастапқы жылдамдық векторының вертикаль проекциясы 
<variant> Бастапқы жылдамдық векторының горизонталь проекциясы
<variant> Жылдамдық векторының бастапқы мәні
<variant> Жылдамдық векторының соңғы мәні 
<variant> Еркін түсу үдеуін есептеу формуласы 

<question3> y(t) = x0 + vy0*t - g*t2 / 2 
<variantright> дененің y координатасының t уақыттан тәуелділігін сипаттайтын теңдеу
<variant> Бастапқы жылдамдық векторының горизонталь проекциясы
<variant> Жылдамдық векторының бастапқы мәні
<variant> Жылдамдық векторының соңғы мәні 
<variant> Еркін түсу үдеуін есептеу формуласы 

<question3> Динамикалық және статистикалық модельдер 
<variantright> Уақыт факторына байланысты модельдер
<variant> Материалдық және ақпараттық модельдер
<variant> Вербальдік және таңбалық модельдер
<variant> Арнайы модельдер 
<variant> Логикалық модель

<question3> Компьютерлік модель 
<variantright> Программалық орта көмегімен жүзеге асатын модель
<variant> Уақыт факторына байланысты өзгеретін модельдер 
<variant> Құрылымдық модельдер 
<variant> Арнайы модельдер 
<variant> Логикалық модель

<question3> Модельдің дұрыстығын тексеру
<variantright> Тестілеу 
<variant> Есептің қойылымы 
<variant> Шешім қабылдау 
<variant> Модельдеу жоспарын құру
<variant> Модельдеу технологиясын анықтау

<question3> Схемалар, графиктер, кестелер және т.б 
<variantright> Құрылымдық модельдерге жатады
<variant> Ноталар, химиялық формулалар
<variant> Иллюстрациялар, ауызша және жазбаша сипаттаулар
<variant> Иллюстрацияны пайдаланып, ауызша және жазбаша сипаттаулар 
<variant> Графикалық пішіндер мен көлемді конструкциялар

<question3> Дифференциалдық және интегралдық теңдеулер 
<variantright> математикалық физика есептерін шешуде қолданылады
<variant> Алгоритмді өңдеу тәсілі кезінде қолданылады 
<variant> Сәйкестігін табу
<variant> Қарапайым тесттілеу
<variant> Заманауи объектіге-бағытталған программалау тәсілдері

<question3> Факторлардың бөлінуі
<variantright> параметрлер мен сипаттамалар 
<variant> кіріс және шығыс айнымалылар
<variant> бастапқы және шектік шарттар
<variant> басқару параметрлері
<variant> коэффициент параметрлері

<question3> Процесстің немeсе объектінің үшөлшемді моделін жасау программалары 
<variantright> 3D Max, Open GL
<variant> Delphi, TurboPascl
<variant> Corel Draw
<variant> MS Power Point
<variant> Visual Studio

<question3> Детерминирленген модельдің мысалы:
<variantright> Аррениус теңдеуі
<variant> Ньютон заңы
<variant> Горнеа схемасы
<variant> жылуөткізгіштік теңдеуі
<variant> Гук заңы

<question3> Жоғарғы деңгей контроллерлері ретінде қолданылады 
<variantright> концентраторлар, контроллерлер
<variant> коммутаторлар, концентраторлар
<variant> жоғарғы деңгейлі датчиктер
<variant> төменгі деңгейлі датчиктер
<variant> термотүрлендіргіштер

<question3> Процесстің статикалық бейнесі
<variantright> уақытқа байланысты өзгермейді 
<variant> технологиялық процессті бейнелейді
<variant> процессің толық сипаттамасын береді
<variant> технологиялық процесс параметрі
<variant> балқытқыштардағы күкірт температурасы

<question3> Процесстің динамикалық бейнесі
<variantright> технологиялық процессті бейнелей отырып өзгереді 
<variant> уақытқа байланысты өзгермейді
<variant> процессің толық сипаттамасын береді
<variant> технологиялық процесс параметрі
<variant> балқытқыштардағы балқытылған күкірт температурасы

<question3> Сұйық күкіртті тасымалдау құралы
<variantright> сорғылар
<variant> балқытқыштар
<variant> фильтрлер
<variant> трубопровод
<variant> пеш бөлімі

<question3> Күкрт қышқылын өндіруді бақылау және басқару үшін қолданылады 
<variantright> ТПАБЖ
<variant> ОББ
<variant> ФЛБ
<variant> Визуальды бағдарламалау
<variant> Жоғары деңгейлі бағдарламалау тілдері

<question3> ТПАБЖ-нің бірінші деңгейінде қамтылады:
<variantright> датчиктер, орындаушы механизмдер, күштік жетектер
<variant> программаланатын логикалық контроллерлер
<variant> резервтелген серверлер, орталық архивтелетін сервер
<variant> SCADAклиенттерінің станциялары
<variant> пеш бөлімі

<question3> ТПАБЖ-нің екінші деңгейінде қамтылады:
<variantright> программаланатын логикалық контроллерлер 
<variant> датчиктер, орындаушы механизмдер, күштік жетектер
<variant> резервтелген серверлер, орталық архивтік сервер
<variant> SCADAклиенттерінің станциялары
<variant> пеш бөлімі

<question3> ТПАБЖ-нің үшінші деңгейінде қамтылады:
<variantright> серверлік құрылғылар
<variant> датчиктер, орындаушы механизмдер, күштік жетектер
<variant> резервтелген серверлер, орталық архивтік сервер
<variant> SCADAклиенттерінің станциялары
<variant> пеш бөлімі

<question3> ТПАБЖ-нің төртінші деңгейінде қамтылады:
<variantright> SCADAклиенттерінің станциялары 
<variant> датчиктер, орындаушы механизмдер, күштік жетектер
<variant> резервтелген серверлер, орталық архивтік сервер
<variant> серверлік құрылғылар 
<variant> пеш бөлімі

<question3> СENTUM VP пакетінің программалық-техникалық кешені 
<variantright> таратылған басқару жүйелері
<variant> автоматтандырылған басқару жүйелері
<variant> объектіге - бағытталған жүйелер 
<variant> визуальды бағдарламалау жүйелері
<variant> процессті тестілеу бағдарламасы 

<question3> Басқару станциясының (контроллер) программасы 4 типті элементтерден тұратын басқарудың графикалық схемалары (Control Drawings) түрінде жасалады:
<variantright> функционалдық блоктар, деректермне байланыс блоктары, блоктар арасындағы байланыс, мәтіндік 	элементтер
<variant> шина интерфейсінің модулі, қоректендіру блогы, орындаушы механизмдер, коммуникациялық шинала
<variant> деректермен байланыс блоктары, блоктар арасындағы байланыс, мәтіндік элементтер, коммутаторлар
<variant> блоктар арасындағы байланыс, мәтіндік элементтер, орындаушы механизмдер, коммуникациялық шиналар
<variant> мәтіндік элементтер, қоректендіру блогы, орындаушы механизмдер, коммуникациялық шиналар

<question3> Бір басқару станциясында программаланатын схемалар саны:
<variantright> 200 басқару схемасы 
<variant> 100 басқару схемасы
<variant> басқару схемасының шексіз саны
<variant> процесске тәуелді
<variant> 10 басқару схемасы

<question3> Функционалдық блоктардың типтері:
<variantright> базалық, опциональдық, жүйелік
<variant> бүтін, нақты, символдық
<variant> коммуникациондық
<variant> басқару және реттеу схемалары
<variant> оператордың станциясы және басқару

<question3> Кіріс (шарттар) пен шығыс (амалдар) арасындағы қатынастарды ИЯ/ЖОҚ кестесі түрінде сипаттайтын функционалдық блок:
<variantright> шешімдер матрицасы
<variant> басқару схемасы
<variant> процесстің мнемосхемасы
<variant> реттеу схемасы 
<variant> оператордың станциясы

<question3> Химиялық-технологиялық процесстерді сипаттау мен талдаудың маңызды әдістерінің бірі:
<variantright> материалдық баланс
<variant> компоненттік баланс
<variant> жылулық баланс
<variant> процесс кинетикасының теңдеуі
<variant> ағындар құрылымы

<question3> Математикалық модельдің құрама бөліктері:
<variantright> мағыналық аспект, есептегіш аспект және аналитикалық аспект
<variant> компоненттік баланс, материалдық баланс, жылулық баланс
<variant> жылулық баланс, ағындар гидродинамикасының теңдеуі, процесс кинетикасы 
<variant> ағындар құрылымы 
<variant> бастапқы және шектік шарттар теңдеуі 

<question3> Балқыту және күкіртті фильтрациялау бөлімінің кірісіндегі буды бақылау параметрлері:
<variantright> қысым, температура, шығын
<variant> деңгей, шығын
<variant> қышқылдығы, сілтілігі
<variant> температура, компоненттік құрам
<variant> шығын, компоненттік құрам

<question3> Сынау әдістері мен қысымды бақылау құралдары:
<variantright> қысымды түрлендіргіш 
<variant> термотүрлендіргіш 
<variant> құйынды өлшегіш
<variant> радиотолқынды деңгей өлшегіш
<variant> қысым көрсеткішін өлшеу счетчигі

<question3> Сынау әдістері мен температураны бақылау құралдары:
<variantright> термотүрлендіргіш 
<variant> қысымды түрлендіргіш
<variant> құйынды өлшегіш
<variant> радиотолқынды деңгей өлшегіш
<variant> қысым көрсеткішін өлшеу счетчигі

<question3> Сынау әдістері мен күкірт шығынын бақылау құралдары:
<variantright> құйынды өлшегіш 
<variant> қысымды түрлендіргіш
<variant> термотүрлендіргіш 
<variant> радиотолқынды деңгей өлшегіш
<variant> қысым көрсеткішін өлшеу счетчигі

<question3> Сұйық күкірт деңгейін бақылау құралдары:
<variantright> радиотолқынды деңгей өлшегіш 
<variant> қысымды түрлендіргіш
<variant> термотүрлендіргіш 
<variant> құйынды өлшегіш
<variant> қысым көрсеткішін өлшеу счетчигі

<question3> Күкіртті балқытудың технологиялық процесі 
<variantright> күкіртті қышқылды алу процесінің бір бөлігі 
<variant> сұйық күкіртті фильтрациялау процесі
<variant> пеш бөлімінде күкірт қышқылын өндіру 
<variant> байланыс тәсілімен күкіртті қышқылды алу 
<variant> кептіру-абсорбциондық процесс

<question3> Күкіртті қышқылды алу процесстерінің тізбегіндегі бірінші технологиялық процесс 
<variantright> күкіртті балқыту процесі 
<variant> сұйық күкіртті фильтрациялау процесі
<variant> пеш бөлімінде күкіртті қышқылды өндіру
<variant> байланыс тәсілімен күкіртті қышқылды алу 
<variant> кептіру-абсорбциондық процесс

<question3> Күкіртті қышқылды алу процесстерінің тізбегіндегі екінші технологиялық процесс 
<variantright> сұйық күкіртті фильтрациялау процесі 
<variant> күкіртті балқыту процесі
<variant> пеш бөлімінде күкіртті қышқылды өндіру
<variant> байланыс тәсілімен күкіртті қышқылды алу 
<variant> кептіру-абсорбциондық процесс

<question3> Күкіртті қышқылды алу процесстерінің тізбегіндегі үшінші технологиялық процесс 
<variantright> пеш бөлімінде күкіртті қышқылды өндіру 
<variant> күкіртті балқыту процесі
<variant> сұйық күкіртті фильтрациялау процесі
<variant> байланыс тәсілімен күкіртті қышқылды алу 
<variant> кептіру-абсорбциондық процесс

<question3> Күкіртті қышқылды алу процесстерінің тізбегіндегі төртінші технологиялық процесс 
<variantright> байланыс тәсілімен күкіртті қышқылды алу 
<variant> күкіртті балқыту процесі
<variant> пеш бөлімінде күкіртті қышқылды өндіру
<variant> сұйық күкіртті фильтрациялау процесі
<variant> кептіру-абсорбциондық процесс

<question3> Күкіртті қышқылды алу процесстерінің тізбегіндегі бесінші технологиялық процесс 
<variantright> кептіру-абсорбциондық процесс 
<variant> күкіртті балқыту процесі
<variant> пеш бөлімінде күкіртті қышқылды өндіру
<variant> байланыс тәсілімен күкіртті қышқылды алу 
<variant> сұйық күкіртті фильтрациялау процесі

<question3> Балқытқыштардағы балқытылған күкірттің температурасы 
<variantright> 1500 C-ден аспау керек
<variant> 1500 C-ден жоғары
<variant> 1650C-тен жоғары
<variant> 2650C-тен жоғары емес
<variant> 550C-тен жоғары емес

<question3> Балқытқыштарға түскен бу параметрлері 
<variantright> температура 160–1650C, қысым — 0,7 МПа
<variant> температура 260–2650C, қысым — 0,7 МПа
<variant> температура 60–650C, қысым — 0,7 МПа
<variant> температура 160–1650C, қысым — 1,7 МПа
<variant> температура 160–1650C, қысым — 2,7 МПа

<question3> Күкіртті балқытуға арналған будың кіріс ағынының парамтерлері 
<variantright> температура 160–1650C, қысым — 0,7 МПа
<variant> температура 260–2650C, қысым — 0,7 МПа
<variant> температура 60–650C, қысым — 0,7 МПа
<variant> температура 160–1650C, давление — 1,7 МПа
<variant> температура 160–1650C, қысым — 2,7 МПа

<question3> Детерминирленген модель:
<variantright> Аррениус теңдеуі
<variant> Ньютон заңы
<variant> Горнер схемасы
<variant> жылуөткізгіштік теңдеуі 
<variant> Гук заңы

<question3> Жоғарғы деңгей контроллерлері
<variantright> концентраторлар, контроллерлер
<variant> коммутаторлар, концентраторлар
<variant> жоғарғы деңгей датчиктері
<variant> төменгі деңгей датчиктері
<variant> термотүрлендіргіштер

<question3> Статикалық бейне сипаты
<variantright> уақыт өту барысында өзгермейді 
<variant> технологиялық процесс барысын бейнелей отырып өзгереді 
<variant> процесстің толық сипаттамасын береді
<variant> технологиялық процесс параметрі
<variant> балқытқыштағы балқытылған күкірт температурасы 

<question3> Динамикалық бейне сипаты
<variantright> технологиялық процесс барысын бейнелей отырып өзгереді 
<variant> уақыт өту барысында өзгермейді 
<variant> процесстің толық сипаттамасын береді
<variant> технологиялық процесс параметрі
<variant> балқытқыштағы балқытылған күкірт температурасы 

<question3> Сұйық күкіртті тасымалдауға арналған құрал
<variantright> сорғылар
<variant> балқытқыштар
<variant> фильтрлер
<variant> трубопровод
<variant> пеш бөлімі

<question3> Күкірт қышқылын өндіруді бақылау және басқару құралы 
<variantright> ТПАБЖ
<variant> ОББ
<variant> ФЛБ
<variant> Визуальды бағдарламалау
<variant> Жоғары деңгейлі бағдарламалау тілдері

<question3> ТПАБЖ бірінші деңгейде қамтылатын құралдар:
<variantright> датчиктер, орындаушы механизмдер, күштік жетектер
<variant> программаланатын логикалық контроллерлер
<variant> резервтелген серверлер, орталық архивтелетін сервер
<variant> SCADAклиенттерінің станциялары
<variant> пеш бөлімі

<question3> ТПАБЖ екінші деңгейде қамтылатын құралдар:
<variantright> программаланатын логикалық контроллерлер 
<variant> датчиктер, орындаушы механизмдер, күштік жетектер
<variant> резервтелген серверлер, орталық архивтік сервер
<variant> SCADAклиенттерінің станциялары
<variant> пеш бөлімі

<question3> ТПАБЖ үшінші деңгейде қамтылатын құралдар:
<variantright> серверлік құрылғылар
<variant> датчиктер, орындаушы механизмдер, күштік жетектер
<variant> резервтелген серверлер, орталық архивтік сервер
<variant> SCADA клиенттерінің станциялары
<variant> пеш бөлімі

<question3> ТПАБЖ төртінші деңгейде қамтылатын құралдар:
<variantright> SCADA клиенттерінің станциялары 
<variant> датчиктер, орындаушы механизмдер, күштік жетектер
<variant> резервтелген серверлер, орталық архивтік сервер
<variant> серверлік құрылғылар 
<variant> пеш бөлімі

<question3> СENTUM VP ортасының бағдарламалық-техникалық кешені:
<variantright> таратылған басқару жүйелері
<variant> автоматтандырылған басқару жүйелері
<variant> объектіге - бағытталған жүйелер 
<variant> визуальды бағдарламалау жүйелері
<variant> процессті тестілеу бағдарламасы

<question3> Басқару станциясында программаланатын схемалар саны:
<variantright> 200 басқару схемасы 
<variant> 100 басқару схемасы
<variant> басқару схемасының шексіз саны
<variant> процесске тәуелді
<variant> 10 басқару схемасы

<question3> Функционалдық блок типтері:
<variantright> базалық, опциональдық, жүйелік
<variant> бүтін, нақты, символдық
<variant> коммуникациондық
<variant> басқару және реттеу схемалары
<variant> оператордың станциясы және басқару

<question3> Кіріс пен шығыс арасындағы қатынастарды кесте түрінде сипаттайтын функционалдық блок:
<variantright> шешімдер матрицасы
<variant> басқару схемасы
<variant> процесстің мнемосхемасы
<variant> реттеу схемасы 
<variant> оператордың станциясы

<question3> Математикалық модельдің негізгі аспектілері:
<variantright> мағыналық аспект, есептегіш аспект және аналитикалық аспект
<variant> компоненттік баланс, материалдық баланс, жылулық баланс
<variant> жылулық баланс, ағындар гидродинамикасының теңдеуі, процесс кинетикасы 
<variant> ағындар құрылымы 
<variant> бастапқы және шектік шарттар теңдеуі 

<question3> Балқыту және күкіртті фильтрациялау бөліміндегі буды бақылау параметрлері:
<variantright> қысым, температура, шығын
<variant> деңгей, шығын
<variant> қышқылдығы, сілтілігі
<variant> температура, компоненттік құрам
<variant> шығын, компоненттік құрам

<question3> Қысымды бақылау құралдары:
<variantright> қысымды түрлендіргіш 
<variant> термотүрлендіргіш 
<variant> құйынды өлшегіш
<variant> радиотолқынды деңгей өлшегіш
<variant> қысым көрсеткішін өлшеу счетчигі

<question3> Температураны бақылау құралдары:
<variantright> термотүрлендіргіш 
<variant> қысымды түрлендіргіш
<variant> құйынды өлшегіш
<variant> радиотолқынды деңгей өлшегіш
<variant> қысым көрсеткішін өлшеу счетчигі

<question3> Күкірт шығынын бақылау құралдары:
<variantright> құйынды өлшегіш 
<variant> қысымды түрлендіргіш
<variant> термотүрлендіргіш 
<variant> радиотолқынды деңгей өлшегіш
<variant> қысым көрсеткішін өлшеу счетчигі

<question3> Сынау әдістері мен сұйық күкірт деңгейін бақылау құралдары:
<variantright> радиотолқынды деңгей өлшегіш 
<variant> қысымды түрлендіргіш
<variant> термотүрлендіргіш 
<variant> құйынды өлшегіш
<variant> қысым көрсеткішін өлшеу счетчигі

<question3> Күкіртті балқыту процесі
<variantright> күкіртті қышқылды алу процесінің бір бөлігі 
<variant> сұйық күкіртті фильтрациялау процесі
<variant> пеш бөлімінде күкірт қышқылын өндіру 
<variant> байланыс тәсілімен күкіртті қышқылды алу 
<variant> кептіру-абсорбциондық процесс

<question3> Күкіртті қышқылды алудағы бірінші технологиялық процесс 
<variantright> күкіртті балқыту процесі 
<variant> сұйық күкіртті фильтрациялау процесі
<variant> пеш бөлімінде күкіртті қышқылды өндіру
<variant> байланыс тәсілімен күкіртті қышқылды алу 
<variant> кептіру-абсорбциондық процесс

<question3> Күкіртті қышқылды алудағы екінші технологиялық процесс 
<variantright> сұйық күкіртті фильтрациялау процесі 
<variant> күкіртті балқыту процесі
<variant> пеш бөлімінде күкіртті қышқылды өндіру
<variant> байланыс тәсілімен күкіртті қышқылды алу 
<variant> кептіру-абсорбциондық процесс

<question3> Күкіртті қышқылды алудағы үшінші технологиялық процесс 
<variantright> пеш бөлімінде күкіртті қышқылды өндіру 
<variant> күкіртті балқыту процесі
<variant> сұйық күкіртті фильтрациялау процесі
<variant> байланыс тәсілімен күкіртті қышқылды алу 
<variant> кептіру-абсорбциондық процесс

<question3> Балқытылған күкірт температурасы 
<variantright> 1500 C-ден аспау керек
<variant> 1500 C-ден жоғары
<variant> 1650C-тен жоғары
<variant> 2650C-тен жоғары емес
<variant> 550C-тен жоғары емес

<question3> Балқытқыштағы бу параметрлері 
<variantright> температура 160–1650C, қысым — 0,7 МПа
<variant> температура 260–2650C, қысым — 0,7 МПа
<variant> температура 60–650C, қысым — 0,7 МПа
<variant> температура 160–1650C, қысым — 1,7 МПа
<variant> температура 160–1650C, қысым — 2,7 МПа

<question3> Күкіртті балқытуға арналған бу параметрлері 
<variantright> температура 160–1650C, қысым — 0,7 МПа
<variant> температура 260–2650C, қысым — 0,7 МПа
<variant> температура 60–650C, қысым — 0,7 МПа
<variant> температура 160–1650C, давление — 1,7 МПа
<variant> температура 160–1650C, қысым — 2,7 МПа

<question3> Процессті басқаруға арналған программалау тілі 
<variantright> SEBOL (SEquence & Batch Oriented Language)
<variant> SFC (Sequential Function Chart)
<variant> FCS (Field Control Station)
<variant> ENG (Engineering Station)
<variant> SCS (Safety Control Station)

<question3> Басқарушы тізбекті графикалық түрде бағдарламалау тілі:
<variantright> SFC (Sequential Function Chart)
<variant> HIS (Human Interface Station)
<variant> FCS (Field Control Station)
<variant> ENG (Engineering Station)
<variant> SCS (Safety Control Station)

<question3> Символдық қатарлар түрінде ұсынылатын деректер 
<variantright> char*n 
<variant> integer, long
<variant> float, double
<variant> date, time
<variant> word, longint

<question3> std.h жүйе арқылы бекітілген енгізу файлы, ол 
<variantright> үнсіз келісім бойынша таңбаларды береді
<variant> блоктардың жеке режимдерін есептейді 
<variant> блоктың жеке күйін есептеу үшін қолданылады 
<variant> сигнализация жағдайын өзгерту немесе есептеу үшін қолданылады 
<variant> бастапқы мәнді өрнектейді

<question3> smode.h жүйе арқылы бекітілген енгізу файлы, ол
<variantright> блоктардың жеке режимдерін есептейді 
<variant> үнсіз келісім бойынша таңбаларды береді
<variant> блоктың жеке күйін есептеу үшін қолданылады 
<variant> сигнализация жағдайын өзгерту немесе есептеу үшін қолданылады 
<variant> бастапқы мәнді өрнектейді

<question3> sbsts.h жүйе арқылы бекітілген енгізу файлы, ол
<variantright> блоктың жеке күйін есептеу үшін қолданылады 
<variant> үнсіз келісім бойынша таңбаларды береді
<variant> блоктардың жеке режимдерін есептейді
<variant> сигнализация жағдайын өзгерту немесе есептеу үшін қолданылады 
<variant> бастапқы мәнді өрнектейді

<question3> salsrm.h жүйе арқылы бекітілген енгізу файлы, ол
<variantright> сигнализация жағдайын өзгерту үшін қолданылады 
<variant> үнсіз келісім бойынша таңбаларды береді
<variant> блоктың жеке күйін есептеу үшін қолданылады 
<variant> блоктардың жеке режимдерін есептейді
<variant> бастапқы мәнді өрнектейді
`