export const testingName = `Еңбекті қорғау`;
export const testingStr = ` 
<question1> Жұмыс уақытының түрлерін атаңыз?
<variantright> қысқартылған және толық емес
<variant> толық және шектелген
<variant> шектелмеген және толық
<variant> күндізгі және түнгі
<variant> күнделікті және апталық

<question1> Қысыммен жұмыс iстейтiн ыдысты не үшiн сынайды?
<variantright> ыдыстың берiктiгi мен тығыздылығын анықтау
<variant> ыдыстың саңлаусыздығын анықтау үшiн
<variant> ыдыстың сенiмдiлiгiн анықтау үшiн
<variant> запастық берiктiлiгi коэффициентiн анықтау
<variant> ыдыстың қалыңдылығын анықтау үшiн

<question1> Қысыммен жұмыс iстелiнетiн ыдысты саңлаусыздандыруға сынақ жылына неше рет жүргiзiледi?
<variantright> 1 рет
<variant> 2 рет
<variant> 3 рет
<variant> 4 рет
<variant> 5 рет

<question1> Қысыммен жұмыс iстейтiн ыдыс гидравликалық сынақтан неше жылда бiр рет өтiледi?
<variantright> 8 жылда 1 рет
<variant> 7 жылда 1 рет
<variant> 6 жылда 1 рет
<variant> 5 жылда 1 рет
<variant> 4 жылда 1 рет

<question1> Қол тележкаларының ең жоғарғы жүк көтергiштiгiн неше килограмға есептейдi?
<variantright> 500 кг
<variant> 400 кг
<variant> 300 кг
<variant> 200 кг
<variant> 550 кг

<question1> Қол тележканың жүктi тасымалдау жылдамдығы секундына қанша болу керек?
<variantright> 0,5 м/с
<variant> 0,9 м/с
<variant> 0,8 м/с
<variant> 0,7 м/с
<variant> 0,6 м/с

<question1> Цехтың iшiне көпiрлiк кранды орнату кезiнде ферманың төменгi белдеуiнен кранның тележкасына дейiнгi ең төменгi арақашықтық қанша болуы керек?
<variantright> 100 мм
<variant> 80 мм
<variant> 85 мм
<variant> 70 мм
<variant> 65 мм

<question1> Жеңiл және тоқыма өнеркәсiптерiнде орта есеппен неше пайыз жарақаттар жүктi салу-түсiру және тасымалдау жұмыстарымен байланысты?
<variantright> 10 % 
<variant> 15 % 
<variant> 20 % 
<variant> 25 % 
<variant> 30 % 

<question1> Көлбеу беттермен жүктi тасымалдау кезiнде беттiң жүктi тiк көтеру биiктiгi қаншадан асып кетпеуi керек?
<variantright> 3 м
<variant> 2 м
<variant> 1 м
<variant> 0,5 м
<variant> 2,5 м

<question1> ТЖ кезінде жұмысшыларды ғимараттан эвакуациялау іс-шаралары қалай жүргңзңледі?
<variantright> эвакуациялау жоспары бойынша
<variant> цех басшысының бұйрығы бойынша
<variant> еңбек кодексіне сәйкес
<variant> азаматтық қорғау заңдарына сәйкес
<variant> жұмыс берушінің қызметтік нұсқауына байланысты 

<question1> 2021 жылында Еңбек кодексі қанша баптан тұрады ?
<variantright> 204
<variant> 341
<variant> 256
<variant> 108
<variant> 320

<question1> Жұмысшылардың еңбек қауіпсіздік ережелерін бұзғаны үшін жауапкершіліктің қааі түрі қате көрсетілген?
<variantright> өнеркісіптік
<variant> қылмыстық
<variant> әкімшілік
<variant> тәртіптік
<variant> материалдық

<question1> Еңбек қорғау заңдарын бұзғаны жөнінде лауазымды адамдарға ақшалай айып пұл салу жауапкершіліктің қай түрінде қарастырылған?
<variantright> әкімшілік
<variant> құқықтық
<variant> тұрмыстық
<variant> қылмыстық
<variant> тәртіптік

<question1> Алғашқы өрт сөндiргiш құралдардағы, әсiресе оның iшiндегi ОХП-10 өртсөндiргiшiнiң агрегаттық күйi қандай?
<variantright> сұйық
<variant> қатты
<variant> газ
<variant> бу
<variant> ауа

<question1> АТИМ типтi өрттi хабарлағыш датчиктер неге сезiнiп жұмыс iстейдi?
<variantright> жылуға
<variant> жарыққа
<variant> түтiнге
<variant> радиоактивтi
<variant> сәулеге

<question1> ДПС-038 типтi өрт хабарлағыш датчиктер неге сезiнiп жұмыс iстейдi?
<variantright> хром-капельді термопаралар
<variant> биметалды спиралдар
<variant> фотоэлементтер
<variant> терморезисторлар
<variant> термоэлементтерге

<question1> АТИМ типтi өрттi хабарлағышта сезiнгiш элемент ретiнде не қолданылады?
<variantright> биметалдан жасалынған пластина
<variant> жылу кедергiсi және температура
<variant> ионизациялық камера, пластина
<variant> металдан жасалынған стержень
<variant> графиктен жасалынған стержень

<question1> ДТЛ типтi өрттi хабарлағыштың қорғау аймағының өлшемi шамамен қанша ?
<variantright> 15, м2
<variant> 25, м2
<variant> 27, м2
<variant> 28, м2
<variant> 29, м2

<question1> Зейнетке шығу жас мөлшері?
<variantright> 63 жаста
<variant> 58 жаста
<variant> 60 жаста
<variant> 55 жаста
<variant> 68 жаста

<question1> Жеке адамның, мүліктің, қоғам мен мемлекеттің өртке қарсы қорғалуының жай-күйі?
<variantright> өрт қауіпсіздігі
<variant> өрт профилактикасы
<variant> өрт санитариясы
<variant> өрт гигиенасы
<variant> өрт қағидалары

<question1> Өрт сөндiретiн гидранттарды су құбыры желiсiнен қандай арақашықтықта орналастыруға болады?
<variantright> 100 м
<variant> 90 м
<variant> 80 м
<variant> 70 м
<variant> 60 м

<question1> Өртке қарсы қойылатын арнайы қабырғалардың санын қандай факторға байланысты анықтайды?
<variantright> ғимараттың ауданына
<variant> өндiрiстiң өрт қауiптiлiгiне
<variant> өндiрiстiң жарылыс қауiптiлiгiне
<variant> өндiрiстiң жарылыс-өрт қауiптiлiгiне
<variant> ғимараттың көлеміне байланысты

<question1> Ауа-механикалық көбiктiң құрамы неден тұрады?
<variantright> 90% ауадан; 9,6 9,8%судан; 0,2 0,4% кт
<variant> 85% ауадан; 9,6 9,8% судан; 0,2 0,4% кт
<variant> 80% ауадан; 9,6 9,8% судан; 0,2 0,4% кт
<variant> 75% ауадан; 9,6 9,8% судан; 0,2 0,4% кт
<variant> 70% ауадан; 9,6 9,8% судан; 0,2 0,4% кт

<question1> Құрылыс материалдары өзiнiң жану дәрежесiне байланысты жанбайтын заттарға бөлiнедi, оған қандай зат жатады?
<variantright> бетон
<variant> картон
<variant> битум
<variant> қағаз
<variant> киіз

<question1> Құрылыс материалдары өзiнiң жану дәрежесiне байланысты жанатын заттарға бөлiнедi, оған қандай зат жатады?
<variantright> қағаз
<variant> шыны
<variant> шөген
<variant> батпақ
<variant> темірбетон

<question1> Құрылыс материалдары өзiнiң жану дәрежесiне байланысты қиын жанатын заттарға бөлiнедi, оған қандай зат жатады?
<variantright> ксилобетон
<variant> қамыс
<variant> асфальт
<variant> толь
<variant> қағаз

<question1> Метан газының ауамен қосылып жанған кездегi төменгi жарылу шегi қаншаға % тең?
<variantright> 6%
<variant> 9%
<variant> 10%
<variant> 8%
<variant> 8,5%

<question1> Өрт сөндiргiш спринклерлiк қондырғыны жұмысқа қосу үшiн, қандай тәсiлдi қолдануға болады?
<variantright> автоматикалық жолмен қосу
<variant> блокировкалық жолмен қосу
<variant> пневматикалық жолмен қосу
<variant> гидравликалық жолмен қосу
<variant> механикалық жолмен қосу

<question1> Өртке қарсы қойылатын қабырғалардың өртке қарсы тұру дәрежесiнiң шегi қанша сағаттан кем болмауы керек?
<variantright> 2,5, сағ
<variant> 2,0, сағ
<variant> 2,1, сағ
<variant> 2,2, сағ
<variant> 2,3, сағ

<question1> Дренчерлiк қондырғылар қандай тәсiлмен өрттi сөндiрудi iске асырады?
<variantright> көлемдiк сөндiру әдісімен
<variant> үстiртiн сөндiру әдісімен
<variant> аудандық сөндiру әдісімен
<variant> бiр жердiң шеңберiнен аспайтын
<variant> жан- жақты сөндіру әдісімен

<question1> Атмосфералық ауада оттегiнiң мөлшерi қанша болғанда жанғыш заттардың жануы тоқталады?
<variantright> 15%
<variant> 14%
<variant> 13%
<variant> 12%
<variant> 10%

<question1> Өндiрiс кәсiпорындарының ауласында пайда болған өрттердi өшiру үшiн, есептелiнетiн судың шығыны қандай факторларға байланысты?
<variantright> ғимараттың көлемiне өртке қарсы тұру дәрежесiне
<variant> ғимараттың ауданына өртке қарсы тұру шегіне
<variant> ғимараттың периметрiне, ауданына
<variant> ғимараттың арнайы қондырғымен жабдықталуына
<variant> ғимараттың ауданына және периметріне

<question1> Заттар мен материалдардың жанғыш зат болуы қандай жәйттерге байланысты?
<variantright> химиялық құрылымына
<variant> заттын мөлшерiне
<variant> физикалық қасиетiне
<variant> оттегiнiң көп болуына
<variant> оттегiнiң аз болуына

<question1> Жанғыш газдардың жарылыс-өрт қауiптiлiгiнiң қандай қасиеттерi жарылыс уақытын анықтайды?
<variantright> сұйық заттардың тұтану шегi
<variant> жану температурасы, жарылу шегі
<variant> жалынның таралу жылдамдығы
<variant> жалынның төменгi жарылу шегi
<variant> жалынның жоғарғы жарылу шегі

<question1> Көрсетiлген жолдардың қайсысы өрт кезiнде адамдарды эвакуациялау үшiн жарамсыз деп ойлайсыз?
<variantright> лифтiлер мен эскалаторлар
<variant> коридорлар мен эскалаторлар
<variant> фойелер мен басқыштар
<variant> өтулер мен басқыштар
<variant> есіктер мен коридорлар

<question1> Электрқондырғылар мен электр сымдар жанғанда өрттi сөндiру үшiн қандай өртсөндiргiштердi қолдануға болады?
<variantright> көмiрқышқылды өртсөндiргiштердi
<variant> ауа-көбiктi өртсөндiргiштердi
<variant> көбiктi химиялық өртсөндiргiштер
<variant> сулы өртсөндiргiштердi
<variant> автоматты өрт сөндіргіштер

<question1> Жану процессінің пайда болуы үшін қандай заттардың өзара әрекеттесуі қажет? 
<variantright> жанатын зат, оталу көзі, оттегі
<variant> қатты зат, көмір қышқыл газу, жанатын элемент
<variant> газ, сұйықтық, қатты зат
<variant> азот тотығы, жанатын зат, оттегі
<variant> экзогенді орта, гетерогенді заттар

<question1> Өнеркәсiп кәсiпорындарында өрттi сөндiрудiң есептелiнген ұзақтығы қанша сағат болуы керек?
<variantright> 3 сағ
<variant> 2,5 сағ
<variant> 2,6 сағ
<variant> 2,7 сағ
<variant> 2,9 сағ

<question1> Өндiрiстiң iшiне қойылған алғашқы өртсөндiргiштер еденнен қандай биiктiкте орнатылады?
<variantright> 1,35 м
<variant> 1,29 м 
<variant> 1,28 м 
<variant> 1,27 м 
<variant> 1,26 м 

<question1> Қатты заттардың бетiмен таралатын жалынның жылдамдығы қанша болуы мүмкiн?
<variantright> 4 м/минут
<variant> 3,9 м/минут
<variant> 3,8 м/минут
<variant> 3,7 м/минут
<variant> 3,6 м/минут

<question1> Сұйық заттардың бетiмен таралатын жалынның жылдамдығы қанша болуы мүмкiн?
<variantright> 30 м/минут
<variant> 25 м/минут
<variant> 23 м/минут
<variant> 28 м/минут
<variant> 29 м/минут 

<question1> Түтiн шығаратын люктердiң ауданының қимасықандай жәйтке (факторғ<variant> байланысты мөлшерленедi?
<variantright> өндiрiс жайының ауданын
<variant> ғимараттың периметрiне
<variant> ғимараттың өрт қауiптiлiгi
<variant> ғимараттың жарылыс қауiптiлiгi
<variant> өндіріс жайының көлеміне

<question1> Эвакуациялық шығыстың саны құжат бойынша кем дегенде қанша болуы керек? 
<variantright> 2
<variant> 4
<variant> 5
<variant> 6
<variant> 3

<question1> Өрттi сөндiруге қолданылатын көмiрқышқыл газы қандай түрде қолданылады?
<variantright> қысылған
<variant> газданған
<variant> ерiтiлген
<variant> қаттылау
<variant> сұйытылған

<question1> Цехтың неше метр ауданына бiр өртсөндiргiш қойылады?
<variantright> 100 м2 
<variant> 90 м2
<variant> 80 м2
<variant> 70 м2
<variant> 65 м2

<question1> Бiр iшкi өрт сөндiргiш шөлмектен шығатын судың өтімі қанша болуы мүмкiн?
<variantright> 2,5 л/с  
<variant> 2,9 л/с 
<variant> 2,8 л/с 
<variant> 2,7 л/с 
<variant> 2,65 л/с 

<question1> Өрт сөндiргiш гидранттар ғимараттың қабырғасынан кем дегенде неше метрден кейiн орнатылуы мүмкiн?
<variantright> 5 м
<variant> 4,9 м
<variant> 4,8 м
<variant> 4,7 м
<variant> 4,65 м

<question1> Өрт сөндiргiш гидранттар жолдан кем дегенде неше метрден кейiн орнатылуы мүмкiн?
<variantright> 2 м
<variant> 1,9 м
<variant> 1,8 м
<variant> 1,7 м
<variant> 1,5 м

<question1> Қысымы жоғары су құбырлары үшiн өрт сөндiргiш гидранттан өрттi өшiретiн жерге дейiнгi аралық қанша метрден асып кетпеуi керек?
<variantright> 100 м 
<variant> 95 м
<variant> 85 м
<variant> 75 м
<variant> 76 м

<question1> Кернеуде тұрған электро қондырғылар жанған кезде қандай өрт сөндiргiштi қолдануға болады?
<variantright> ОУ-2
<variant> ОВП-100 
<variant> ОХП-100
<variant> ОПС-10
<variant> ОВП-3

<question1> Үстеме жұмыстарға жіберілмейтін жас мөлшері?
<variantright> 17
<variant> 19
<variant> 21
<variant> 25
<variant> 55

<question1> Қайталама нұсқаулықты өткізіп тіркейтін жауапы қызметкер:
<variantright> еңбек қорғау инженері
<variant> мекеме басшысы
<variant> кәсіподақ төрағасы
<variant> медбике
<variant> кадрлар бөлімінің басшысы

<question1> Қауіпсіздік нұсқаулықтың қай түрін еңбек қорғау инженері жүргізеді?
<variantright> бастапқы жұмыс орнындағы нұсқаулық
<variant> жоспарланған нұсқаулық
<variant> қайталанбайтын нұсқаулық
<variant> мамандандырылған нұсқаулық
<variant> жекеленген нұсқаулық

<question1> 1 литр суды 1 градусқа қыздыру үшiн қанша Кило-Джоуль жылу жұмсалынады?
<variantright> 4,2
<variant> 5,0
<variant> 5,1
<variant> 5,2
<variant> 5,3

<question1> Өндірістік бөлмелердің метеорологиялық жағдайлары қандай параметрлермен сипатталады?
<variantright> температура, ылғалдылық, ауа қозғалысының жылдамдығы
<variant> температура, ортаның газдану деңгейі, сәулелену деңгейі
<variant> ылғалдылық, жарықтылық, шу деңгейі
<variant> ылғалдылық, ортаның газдану деңгейі, сәулелену деңгейі
<variant> ауа қозғалысы, ауаның барометрлік қысымы, дірілдің деңгейі

<question1> Жану процесiн тоқтатудың қандай тәсiлi бар?
<variantright> мұздату
<variant> оттегiн көбейту
<variant> көбiк беру арқылы
<variant> көбiктiң еселiгiн арттыру 
<variant> көбіктің еселігін азайту 

<question1> Шаң-тозаңның төменгi концентрациялық тұтану шегi қанша болғанда, өндiрiс жайын жарылыс қауiптiлiгi тобына жатқызуға болады. 
<variantright> 65, г/м3 шейiн 
<variant> 60, г/м3 шейiн
<variant> 50, г/м3 шейiн
<variant> 40, г/м3 шейiн
<variant> 30,г/м3 шейін

<question1> Шаң-тозаңның төменгi концентрациялық тұтану шегi қанша болғанда, өндiрiс жайын өрт қауiптiлiгi тобына жатқызуға болады. 
<variantright> 65, г/м3 жоғары
<variant> 55, г/м3
<variant> 45, г/м3 жоғары
<variant> 35, г/м3
<variant> 25, г/м3

<question1> Өндiрiс ғимараттары жанған кезде жану температурасы қаншаға дейiн көтерiлуi мүмкiн?
<variantright> 13000С 
<variant> 12000С 
<variant> 11000С 
<variant> 10000С 
<variant> 10500С 

<question1> Қандай тәсiлдермен металдан жасалынған конструкцияның отқа төзiмдiлiк шегiн көтеруге болады. 
<variantright> плиталармен қаптау арқылы
<variant> антипирендермен өңдеу арқылы
<variant> әк-цемент қосылысымен сылау арқылы
<variant> қышпен қаптау арқылы
<variant> әктеу арқылы

<question1> Салыстырмалы ылғалдылық қандай өлшем бірлікпен сипатталады?
<variantright> пайыз
<variant> градус
<variant> температура
<variant> жылдамдық
<variant> қысым

<question1> Ауа желдету жүйесінің негізгі мақсаты
<variantright> ауаны тазарту
<variant> шуды азайту
<variant> дірілді азайту
<variant> температураны реттеу
<variant> өртті болдырмау

<question1> Жұмыс беруші мен жұмысшы арасындағы заңдық күші бар құжат?
<variantright> еңбек шарты
<variant> арнайы құжат
<variant> жеке еңбек кітапшасы
<variant> жеке куәлік
<variant> сертификат

<question1> Шұғыл өрт сөндіру қызметінің байланыс номері?
<variantright> 101
<variant> 01
<variant> 104
<variant> 103
<variant> 102

<question1> Ауа-механикалық көбiктiң өзiне тән емес қасиетiн бiлесiз?
<variantright> жоғарғы жылдамдыққа ие болу 
<variant> өте үнемдi
<variant> адамдарға зиянсыз
<variant> материалдардың бұзылуына әкелмейдi. 
<variant> өте үнемсіз

<question1> Шаң тозаңдардың төменгi концентрациялық тұтану шегi қандай жәйттерге байланысты? 
<variantright> ылғалдылығы, майдалылығы 
<variant> күлдiлiгi
<variant> температураға
<variant> энергияның күшiне
<variant> қысымға

<question1> Әрбiр iшкi өрттi өшiруге қолданылатын өрт сөндіру крандары ұзындығы қанша метрлiк өртке су себетiн шлангамен қамтамасыз етіледi?
<variantright> 20 м 
<variant> 19 м
<variant> 18 м
<variant> 17 м
<variant> 16 м

<question1> Әрбiр iшкi өрттi өшiруге қолданылатын өрт сөндіру крандары диаметрi қанша метрлiк өртке су себетiн шлангамен қамтамасыз етіледi?
<variantright> 65 мм
<variant> 60 мм
<variant> 68 мм
<variant> 70 мм
<variant> 72 мм

<question1> ОХП-10 өртсөндiргiштерiнiң зарядтары қандай бөлiмдерден тұрады?
<variantright> қышқылдардан және сiлтiлерден 
<variant> негiздерден және сілтілерден
<variant> негiздерден және қышқылдардан
<variant> негiздерден және металдардан
<variant> қышқылдардан

<question1> Барлық ғимараттар өртке қарсы тұруына байланысты қанша дәрежеге бөлiнедi?
<variantright> 8
<variant> 7
<variant> 6
<variant> 5
<variant> 4

<question1> Қысымы төмен су құбырлары үшiн өрт сөндiргiш гидранттан өрттi өшiретiн жерге дейiнгi аралық қанша метрден асып кетпеуi керек?
<variantright> 150 м
<variant> 140 м
<variant> 130 м
<variant> 125 м
<variant> 110 м

<question1> Адамдарды эвакуациялау жолдарында есiктiң енi кем дегенде неше метрден кем болмауы керек?
<variantright> 0,8 м
<variant> 1,1 м
<variant> 1,2 м
<variant> 1,3 м
<variant> 1,11 м

<question1> Адамдарды эвакуациялау жолдарында дәлiздiң енi кем дегенде неше метрден кем болмауы керек?
<variantright> 1,4 м
<variant> 2,0 м 
<variant> 2,1 м 
<variant> 2,2 м 
<variant> 2,3 м. 

<question1> Адамдарды эвакуациялау жолдарында баспалдақ алаңдарының енi кем дегенде неше метрден кем болмауы керек?
<variantright> 1,15 м
<variant> 2,0 м
<variant> 2,5 м
<variant> 2,6 м
<variant> 2,65 м

<question1> Баспалдақ маршының көлденең жазықтықтағы көлбеу бұрышы қанша болуы керек?
<variantright> 24030
<variant> 30030
<variant> 40030
<variant> 50030
<variant> 32030

<question1> Баспалдақ маршындағы текпешектiң биiктiгi қаншадан асып кетпеуi керек?
<variantright> 15 см  
<variant> 20 см 
<variant> 25 см 
<variant> 27 см 
<variant> 26 см. 

<question1> Баспалдақ маршындағы текпешектiң енi қаншадан асып кетпеуi керек?
<variantright> 30 см 
<variant> 25 см 
<variant> 26 см 
<variant> 27 см 
<variant> 28 см 

<question1> Сұйықтар, тұтану температурасына байланысты қандай кластарға бөлiнедi?
<variantright> тез тұтанатын сұйықтар, жанғыш сұйықтар
<variant> өзiнен-өзi жанатын сұйықтар мен газдар
<variant> қатты жанғыш заттар мен газдар
<variant> газ тәрiздес жанғыш заттар мен газдар
<variant> инертті заттар және жанғыш сұйықтар

<question1> Кәсiпорынның ауласында неше шаршы метрге бiр өртке қарсы қойылатын қалқан болуы керек?
<variantright> 5000 м2
<variant> 4000 м2
<variant> 3000 м2
<variant> 2000 м2
<variant> 4500 м2

<question1> Жазатайым оқиғасы орын алған кезде тіркеу жіне тергеу комиссиясы қанша уақытта құрылады?
<variantright> 24 сағатта
<variant> 3 тәулікте
<variant> 12 сағатта
<variant> 10 тәулікте
<variant> 1 жұмыс күнінде

<question1> Жүк көтеретiн және тасымалдайтын механизмдер қандай сынақтардан өтiлуi керек?
<variantright> статикалық, динамикалық
<variant> динамикалық, кинематикалық
<variant> динамикалық, пневматикалық
<variant> пневматикалық, статикалық
<variant> пневматикалық, кинематикалық

<question1> Динамикалық сынақ қалай жүргiзiледi?
<variantright> 10% артық жүктi екi рет түсiру арқылы
<variant> 20% артық жүктi екi рет түсiру арқылы
<variant> 30% артық жүктi екi рет түсiру арқылы
<variant> 40% артық жүктi екi рет түсiру арқылы
<variant> 15% артық жүкті екі рет түсіру арқылы

<question1> Статикалық сынақтың сынау ұзақтығы қаншама?
<variantright> 10 мин
<variant> 15 мин
<variant> 20 мин
<variant> 25 мин
<variant> 30 мин

<question1> Жүк көтеретiн және тасымалдайтын механизмдерге жұмыс iстеуге қандай адамдар жiберiледi?
<variantright> жасы 18-ден бастап
<variant> жасы 16-дан бастап
<variant> жасы 20- дан бастап
<variant> жасы 22-дан бастап
<variant> жасы 25-тен бастап

<question1> Жүк көтеретiн және тасымалдайтын механизмдердiң қауiпсiз жұмыс iстеуiне және оның техникалық жағдайына кiм жауап бередi?
<variantright> инженер-техникалық қызметкерлер
<variant> мекеме директорының орынбасары 
<variant> мекеменің цехтарының бастығы 
<variant> мекеменің бас инженері мен шебері
<variant> мекеменің бас механикгі мен шебері

<question1> Жарықтылық қандай өлшеммен өлшенедi?
<variantright> люкс (лк)
<variant> люмен (лм)
<variant> нит (нт)
<variant> кандела (кД)
<variant> свега (сВ)

<question1> Жұмысшы себепсіз еңбек қорғау бойынша оқытуды өтпеді. Оған төменде келтірілген шаралардың, біреуінен басқасын, қолдануға болады. Ол кайсы?
<variantright> Жұмыс беруші жұмысшыны жұмысқа кірісуге рұқсат етпеді, одан кейін жұмыстан босатты
<variant> Жұмыс беруші жұмысшыны жұмысқа кірісуге рұқсат етпеді, өзінің бұйрығымен оқытуға қайтадан жіберді
<variant> Мемлекеттік еңбек инспекторының алдын ала жазылуы бойынша жұмыс беруші жұмысшыны жұмысқа кірісуге рұқсат етпеді. Бұл уақытта жұмысшыға ақы төленбейді
<variant> Жұмысшыға сөгіс берді
<variant> Жұмысшығы қатаң сөгіс берді

<question1> Жарықтың ашықтығы қандай өлшеммен өлшенедi?
<variantright> кандела/м2
<variant> люкс (лк)
<variant> свега (св)
<variant> люмен (лм)
<variant> кандела (кD)

<question1> Газоразрядты лампалардың жарық беруi қаншаға шейiн?
<variantright> 100 лм/Вт
<variant> 90 лм/Вт
<variant> 95 лм/Вт
<variant> 80 лм/Вт
<variant> 85 лм/Вт

<question1> Газоразрядты лампалардың қызмет ету мерзiмi қанша?
<variantright> 10000 cағ. дейiн
<variant> 9000 cағ. дейiн
<variant> 8000 cағ. дейiн
<variant> 7000 cағ. дейiн
<variant> 6000 сағ. дейін

<question1> Шу дегенiме дейнгі не?
<variantright> әр түрлі жиіліктегі дыбыстардың жиынтығы
<variant> 80 Дб асатын дыбыстар
<variant> 100 Дб-ге дейнгі дыбыстар
<variant> 50 Дб аспайтын бақылаусыз дыбыстардың жиынтығы
<variant> жұмыс қабілетіне қолайлы әсер ететін дыбыстар

<question1> Қандай жиiлiк аралығында адамның есiту мүшесi естiлетiн дыбысты созылмалы ортада қабылдайды?
<variantright> 20-20000 Гц
<variant> 10-15000 Гц
<variant> 15-15000 Гц
<variant> 16-15000 Гц
<variant> 17-15000 Гц

<question1> Еңбек қорғауда қандай функциялар мемлекетке жүктелмеген?
<variantright> еңбек қорғауда жұмысшылардың құқықтары мен заңдық қызығушылықтарын сақтауды қадағалайтын ұйым
<variant>  еңбек қорғау талаптарын сақтауды қадағалайтын мемлекеттік ұйымдар
<variant>  еңбек қорғаудың жағдайын жақсартатын мақсаттық бағдарламаларды қабылдау және жүзеге асыру
<variant> мемлекеттік еңбек қорғау басқармасы
<variant>  еңбек қорғау бойынша қоғамдық қадағалауды ұйымдастыру

<question1> Жүктілікке және бала (балаларды) тууға, жаңа туған баланы (балаларды) асырап алуға байланысты 1-ші, 2-ші және 3-ші балаға берілетін бір жолғы жәрдемақының мөлшері?
<variantright> 38 АЕК
<variant> 40 АЕК
<variant> 36АЕК
<variant> 5 АЕК
<variant> 15 АЕК

<question1> Жүктілікке және бала (балаларды) тууға, жаңа туған баланы (балаларды) асырап алуға байланысты 4-ші балаға берілетін бір жолғы жәрдемақының мөлшері?
<variantright> 63 АЕК
<variant> 40 АЕК
<variant> 50АЕК
<variant> 75 АЕК
<variant> 15 АЕК

<question1> Бала тууға, жаңа туған баланы асырап алуға байланысты, бала 1 жасқа толғанға дейн оның күтіміне берілетін 1-ші және 2-ші балаға берілетін жәрдемақының мөлшері?
<variantright> 5,76 және 6,81 АЕК
<variant> 5 және 7 АЕК
<variant> 3,66 және 6,54 АЕК
<variant> 7,5 және 10,2 АЕК
<variant> 15 АЕК

<question1> Бала тууға, жаңа туған баланы асырап алуға байланысты, бала 1 жасқа толғанға дейн оның күтіміне берілетін 3-ші және 4-ші балаға берілетін жәрдемақының мөлшері?
<variantright> 7,85 және 8,9 АЕК
<variant> 5 және 7 АЕК
<variant> 3,66 және 6,54 АЕК
<variant> 7,5 және 10,2 АЕК
<variant> 15 АЕК

<question1> Жаңа туған баланы (балаларды) асырап алған жұмыскерлерге (ата-ананың біреуіне) баланы асырап алған күннен бастап және бала туған күннен бастап қанша күн өткенге дейінгі кезеңге демалыс беріледі?
<variantright> 56
<variant> 70
<variant> 72
<variant> 36
<variant> 24

<question1> Жұмыс беруші жұмыскерге жаңа туған баланы (балаларды) асырап алған жұмыскерге бала қанша жасқа толғанға дейін оның күтіміне байланысты жалақы сақталмайтын демалыс беруге міндетті?
<variantright> 3 жыл
<variant> 5 жыл
<variant> 2 жыл
<variant> 1 жыл
<variant> 9 ай

<question1> Бала үш жасқа толғанға дейін оның күтіміне байланысты жалақы сақталмайтын демалыс аяқталғанға дейін жұмысқа шыққан жағдайда, жұмыскер жұмыс берушіні өзінің ниеті туралы жұмыс басталғанға дейін қанша ай бұрын хабардар етуге міндетті? 
<variantright> 1 ай бұрын
<variant> 3 ай бұрын
<variant> 6 ай бұрын
<variant> 1 апта бұрын
<variant> 9 ай бұрын

<question2> Өндірістік ортадағы шудың өлшем бірлігі?
<variantright> дБ
<variant> Лм
<variant> Лб
<variant> Па
<variant> м/с

<question2> Өндірістік ортадағы шуды өлшейтін аспап?
<variantright> Шумомер
<variant> Люксметр
<variant> Анеройд
<variant> Катотермометр
<variant> Сейсмограф

<question2> Өндірістік ортадағы дірілдің өлшем бірлігі?
<variantright> Гц
<variant> Лм
<variant> Лб
<variant> Па
<variant> м/с

<question2> Өндірістік ортадағы температураның өлшем бірлігі?
<variantright> 0C
<variant> Лм
<variant> Лб
<variant> Па
<variant> м/с

<question2> Бір жұмысшы үшін өндіріс аймағының көлемі қанша болады?
<variantright> 15 м3
<variant> 20 м3
<variant> 10 м3
<variant> 25 м3
<variant> 30 м3

<question2> Бір жұмысшы үшін өндіріс ауданының көлемі қанша?
<variantright> 4,5 м2
<variant> 5,5 м2
<variant> 5 м2
<variant> 1,5 м2
<variant> 3 м2

<question2> Ионизациялық сәулеге қандай сәулелер жатады?
<variantright> корпускулярлы, фотонды
<variant> корпускулярлы, нейтронды
<variant> корпускулярлы, протонды 
<variant> ренгендiк, фотонды
<variant> фотонды, тежегіштік

<question2>  -бөлшектiң энергиясы қандай шек аралығында жатады?
<variantright> 2-8 МэВ
<variant> 10-20 МэВ
<variant> 15-25 МэВ
<variant> 20-30 МэВ
<variant> 15-30 МэВ

<question2> Радиоактивтi заттардан бөлiнетiн *-бөлшектiң ауадағы жүгiруi қаншаға жетуi мүмкiн?
<variantright> 8-9 см
<variant> 10-11 см
<variant> 11-12 см
<variant> 12-13 см
<variant> 13-14 см

<question2>  -бөлшектiң энергиясы қандай шек аралығында жатады?
<variantright> 0,05-3,5 МэВ
<variant> 5-7 МэВ
<variant> 7-9 МэВ
<variant> 9-11 МэВ
<variant> 11,5-13,5 МэВ

<question2>  -бөлшектiң ауадағы ең жоғарғы жүгiруi қанша?
<variantright> 1800 см
<variant> 1700 см
<variant> 1600 см
<variant> 1400 см
<variant> 1000 см

<question2>  -сәуленiң энергиясы қандай шек аралығында жатады?
<variantright> 0,01-3 МэВ
<variant> 3-5 МэВ
<variant> 5-6 МэВ
<variant> 6-7 МэВ
<variant> 8-9 МэВ

<question2> Белсендiлiгi 10 мкКи-ден жоғары ашық радиоактивтiк заттармен жұмыс iстегенде, адамның қолын қорғау үшiн қандай арнайы киiмдер қолданылады.
<variantright> қорғасындалынған резиналы икемдi жеңқапты қолғаптар
<variant> халаттар, комбинезондар, икемдi жеңқапты қолғаптар
<variant> шалбарлар, фартуктер, икемдi жеңқапты қолғаптар
<variant> костюмдер, жеңқаптар, икемдi жеңқапты қолғаптар
<variant> шалбарлар, пневмокостюм, икемдi жеңқапты қолғаптар

<question2> Сәулеленудiң шектi рұқсат етiлген деңгейi қандай құжатпен анықталынады?
<variantright> НРБ
<variant> ОНТП 
<variant> СНиП
<variant> СН
<variant> ПТУ

<question2> Ауру тудыратын шудың деңгейi қанша децибелл (дБ)?
<variantright> 130 дБ
<variant> 100 дБ
<variant> 110 дБ
<variant> 90 дБ
<variant> 80 дБ

<question2> Еңбекті қорғау жөніндегі кіріспе нұсқама жұмысқа алынған барлық жұмыскерлермен, тәжірибе бойынша келген студенттер мен қатысушыларға жүргізіледі. Солай ма?
<variantright> иә, кіріспе нұсқама барлығымен жүргізіледі
<variant> жоғары білімді жұмыскерлерге кіріспе нұсқма жүргізілмейді
<variant> жоғары лауазымға ие мамандарға кіріспе нұсқаулық жүргізілмейді
<variant> Кіріспе нұсқама жұмысберушінің айтуымен жргзіледі
<variant> техника қауіпсіздігі инженерінің айтуымен кіріспе нұсқама жүргізіледі

<question2> Екi шу көзiнiң қарқындылық деңгейiнiң қосындысы қанша болуы керек, егер олардың әрқайсысы 90 дБ деңгейлi шуды туғызса?
<variantright> 93 дБ
<variant> 70 дБ
<variant> 80 дБ
<variant> 75 дБ
<variant> 72 дБ

<question2> Дыбыс қысымы қандай өлшеммен өлшенедi?
<variantright> Па
<variant> ВТ/м2
<variant> дБ
<variant> Н/м2
<variant> дБА

<question2> Үстеме жұмыстар айына қанша сағаттан аспауы тиіс?
<variantright> 12
<variant> 14
<variant> 16
<variant> 19
<variant> 24

<question2> Адам организмiне дiрiлдiң қай жиiлiгi қауiптi?
<variantright> 1 ... 9 Гц
<variant> 200-250 Гц
<variant> 350-400 Гц
<variant> 450-500 Гц
<variant> 10 ... 20 Гц

<question2> Жұмыс орнына ораналасуына және мерзіміне, стажына байланысты келесі нұсқаулықтар жүргізіледі: кіріспе, жұмыс орнындағы, жоспардан тыс. Нұсқаулықтардың барлық түрлері көрсетілген бе?
<variantright> қайталанба және мақсатты нұсқаулықтар көрсетілмеген
<variant> қайталанба, кіріспе нұсқаулық көрсетілмеген
<variant> иә, барлығы көрсетілген.
<variant> мақсатты, жоспарланған нұсқаулық көрсетілмеген
<variant> кіріспе, жұмыс орындағы нұсқаулық көрсетілмеген

<question2> ҚР Еңбек кодексінде тәртіптік сөгістің қандай түрлері қарастырылған
<variantright> ескерту, сөгіс, қатаң сөгіс
<variant> ескерту, сөгіс, қатаң сөгіс, төлемақысы аздау жұмысқа ауыстыру, жұмыстан қуылу
<variant> сөгіс, лауазымын төмендету, жұмыстан қуылу
<variant> сөгіс, ескерту, айып пұл
<variant> жұмыстан қуылу, ескерту

<question2> Еңбекті қорғау бойынша жұмыскелердің біліміне мерзімді бақылау мекемемен талқыланған бағдарлама бойынша жылына бір рет өткізіледі. Мерзімдік бақылау дұрыс көрсетілген бе?
<variantright> ия дұрыс көрсетілген
<variant> дұрыс емес жарты жылда бір рет өткізілуі қажет
<variant> еңбекті қорғау талаптарына сай келетін жаңа нормативтік құжаттар қабылданған кезде ғана біліктілікті тексеру жүргізіледі
<variant> жұмысберушінің көзқарасы бойынша өткізіледі
<variant> дұрыс емес жарты жылда бір рет

<question2> Жұмысшы жұмысқа кіргенде міндетті түрде өтуі тиіс: 1. Кіріспе нұсқау. 2. Жұмыс орындайтын қауіпсіз әдістермен оқыту. 3. Жұмыс орнындағы бастапқы нұсқау. 4. Сынақ мерзімі. 5. Білімін және үйренген тәсілдерін тексеру. Осы аталғандардың қайсысы заңда қаралмаған?
<variantright> Барлық міндеттер заңда қарастырылған.
<variant> Жұмыс орындайтын қауіпсіз әдістермен оқыту.
<variant> Білімін тексеру.
<variant> Сынақ мерзімі.
<variant> Сынақ мерзімі және білімін тексеру.

<question2> Мекеме басшысы еңбек қорғау және өндірістік қауіпсіздік бойынша өзінің міндеттерін қандай басқару құжаттарымен делегат жібереді?
<variantright> Мекеме басшысының бұйрығымен, құрылымдық бөлімшелер және қызметтік инструкциялар туралы жаймен.
<variant> Тек қана мекеме басшысы бұйрығымен, құрылымдық бөлімшелер және қызметтік инструкциялар туралы жаймен.
<variant> Құрылымдық бөлімшелер туралы жаймен, құрылымдық бөлімшелер және қызметтік инструкциялар туралы жаймен.
<variant> Жоғарғы мекеме бұйрықтарымен, құрылымдық бөлімшелер және қызметтік инструкциялар туралы жаймен.
<variant> Қызметтік инструкциялармен, құрылымдық бөлімшелер және қызметтік инструкциялар туралы жаймен.

<question2> Қандай дiрiлдер төменгi жиiлiктi деп есептелiнедi?
<variantright> 30 Гц-ке дейiн
<variant> 50 Гц-ке дейiн
<variant> 70 Гц-ке дейiн
<variant> 80 Гц-ке дейін
<variant> 90 Гц-ке дейін

<question2> Резинадан жасалынған дiрiлдi оқшаулайтын төсеменiң қалыңдығын ұлғайтқан сайын не өзгередi?
<variantright> дірілдің жеке тербелу жиiлiгi жоғарлайды
<variant> дірілдің амалсыз тербелiсiнің жиiлiгi азаяды
<variant> таразылық салмақтың мөлшерi көбейедi
<variant> серiппенiң тұрақты шөгуiнiң ШРЕМ-і көбейедi
<variant> таразылық салмақтың мөлшері азаяды

<question2> Iшкi органдар үшiн жеке тербелiс жиiлiгiнiң мәнi қандай диапазонның аралығында жатады?
<variantright> 6...9 Гц
<variant> 0,9...0,3 Гц
<variant> 0,9...0,2 Гц
<variant> 0,9...0,1 Гц
<variant> 0,3…0,6 Гц

<question2> Адам ести алатын дыбыстың жиілік шектері?
<variantright> 16 Гц-тен 20 кГц дейн
<variant> 1 Гц-тен 25 кГц дейн
<variant> 16 Гц-тен 20 Гц дейн 
<variant> 16 кГц-тен 20 кГц дейн 
<variant> 1 Гц-тен 16Гц дейн

<question2> Ультра дыбыс деп қандай жиіліктегі дыбыстарды айтамыз?
<variantright> 20 кГц-тен жоғары
<variant> 30 кГц-тен жоғары
<variant> 16 Гц-тен жоғары
<variant> 1 Гц-тен жоғары
<variant> 12 кГц-тен жоғары

<question2> Инфра дыбыс деп қандай жиіліктегі дыбыстарды айтамыз?
<variantright> 16 Гц-ке дейн
<variant> 1 Гц-ке дейн
<variant> 20 кГц-ке дейн
<variant> 12 Гц-ке дейн
<variant> 16 кГц-ке дейн

<question2> Жұмыс беруші еңбек қорғау бойынша іс-шараларды қаржыландыруға амалдадарды алдын-ала қарастыруға міндетті ме?
<variantright> Өндірістің өніміне кететін соммадан 0,2 пайыздан төмен болмауы тиіс.
<variant> Үкімет орнатқан нормативтен аспау қажет, 0,5 пайыздан төмен болмауы тиіс.
<variant> Алдынғы жылдағы кіріске байланысты, 0,3 пайыздан төмен болмауы тиіс.
<variant> Коллектив келісімімен анықталынады, 0,4 пайыздан төмен болмауы тиіс.
<variant> Өндіріс шығынынан көп болмау керек, 0,6 пайыздан төмен болмауы тиіс.

<question2> Мекемеде еңбек қорғау және өндірістік қауіпсіздік бойынша нормативті-басқару құжаттары номенклатурасын кім орнатады?
<variantright> Жұмыс беруші орнатады
<variant> Мемлекеттік еңбек инспекциясы дайындайды
<variant> Нормативті-басқару құжаттар номенклатурасы мекеменің әрекеті бойынша анықталынады
<variant> Ұжымдық келісімімен орнатылады
<variant> Жеке келісіммен орнатылады

<question2> Еңбек қорғау және өндірістік қауіпсіздік сұрақтары бойынша функционалды қызмет жайы тапсырмалар, функциялар және құқықтардан тұруы тиіс па?
<variantright> Ия, тиіс
<variant> Міндетті емес,егер мекемеде еңбек қорғау бөлім қызметі болса
<variant> Міндетті емес, егер зиянды заттар болмаса
<variant> Мекеме басшысының қарауы бойынша
<variant> Мекеменің инженер-механигінің қарауы бойынша

<question2> Қауiптiлiгi аз уланғыш заттарды әкету кезiнде ауаны сору жылдамдығы қанша болуы керек?
<variantright> 0,5-0,7 м/с
<variant> 1 м/с
<variant> 2 м/с
<variant> 3 м/с
<variant> 4,5-5,5 м/с

<question2> Апатты желдеткiштер ауа алмасуының еселiгiн қаншаға қамтамасыз етедi?
<variantright> кем дегенде 8
<variant> кем дегенде 3,5
<variant> кем дегенде 4,5
<variant> кем дегенде 5,5
<variant> кем дегенде 6

<question2> Мекемедегі еңбек қорғау мен өндірістік қауіпсіздіктің мақсаты мен міндеттерінен шығатын келесі бағыттарда іс-шаралар атқарылуы тиіс: қауіпті және зиянды факторларды жою; апатты жайылпаушылық бойынша дайындық; санитарлық-гигиеналық іс-шаралар; әлеуметтік-экономикалық ... .толықтырыңыз:
<variantright> қызметшілерді оқыту және жағдайын жасау бойынша іс-шаралар.
<variant> өнімнің өзіндік құнын түсіру бойынша іс-шаралар.
<variant> өндірістік еңбекті жоғарылату бойынша іс-шаралар.
<variant> экологиялық қауіпсіздікті қамтамасыз ету бойынша іс-шаралар.
<variant> өндірістік қауіпсіздікті қамтамасыз ету бойынша іс-шаралар.

<question2> Жарық күшi қандай өлшеммен өлшенедi?
<variantright> кандела (кД)
<variant> люкс (лк)
<variant> люмен (лм)
<variant> стерадиан/лм
<variant> стерадиан (СР)

<question2> Қауіпті және зиянды еңбек жағдайында жұмыс істейтін жұмысшылар үшін апталық жұмыс уақыты қандай болуы керек?
<variantright> 36 сағаттан аспайтын
<variant> 40 сағаттан аспайтын
<variant> Мекеменің коллектив келісімімен анықталынады
<variant> 40 сағат,ал 18-ге толмағандарға-36 сағат
<variant> Мекеменің коллектив және жеке келісімімен анықталынады

<question2> Жарықтылық қандай өлшеммен өлшенедi?
<variantright> люкс (лк)
<variant> люмен (лм)
<variant> нит (нт)
<variant> кандела (кД)
<variant> свега (сВ)

<question2> Жұмысшы себепсіз еңбек қорғау бойынша оқытуды өтпеді. Оған  төменде келтірілген шаралардың, біреуінен басқасын, қолдануға болады. Ол кайсы?
<variantright> Жұмыс беруші жұмысшыны жұмысқа кірісуге рұқсат етпейді, одан кейін жұмыстан босатты
<variant> Жұмыс беруші жұмысшыны жұмысқа кірісуге рұқсат берді, өзінің бұйрығымен оқытуға қайтадан жіберді
<variant> Мемлекеттік еңбек инспекторының алдын ала жазылуы бойынша жұмыс беруші жұмысшыны жұмысқа кірісуге рұқсат етпеді. Бұл уақытта жұмысшыға ақы төленбейді
<variant> Жұмысшыға сөгіс берді
<variant> Жұмысшығы қатаң сөгіс берді

<question2> Жарықтың ашықтығы қандай өлшеммен өлшенедi?
<variantright> кандела/м2
<variant> люкс (лк)
<variant> свега (сВ)
<variant> люмен (лм)
<variant> кандела (кД)

<question2> Газоразрядты лампалардың жарық беруi қаншаға шейiн?
<variantright> 100 лм/Вт
<variant> 90 лм/Вт
<variant> 95 лм/Вт
<variant> 80 лм/Вт
<variant> 85 лм/Вт

<question2> Газоразрядты лампалардың қызмет ету мерзiмi қанша?
<variantright> 10000 cағ. дейiн
<variant> 9000 cағ. дейiн
<variant> 8000 cағ. дейiн
<variant> 7000 cағ. дейiн
<variant> 6000 сағ. дейін

<question2> Табиғи жарық қандай көрсеткiшпен сипатталынады?
<variantright> табиғи жарықтың коэффициенті
<variant> табиғи жарықтың пайдалыр коэффициенті
<variant> табиғи жарықтың күштілігiмен
<variant> табиғи жарықтың ашықтығымен
<variant> табиғи жарықтың спектрімен

<question2> «Табиғатты және жасанды жарықтандыру» құжатына сәйкес көз жұмыстары ажыратылатын деталдiң размерiне байланысты неше разрядқа бөлiнедi?
<variantright> 8
<variant> 7
<variant> 6
<variant> 5
<variant> 4

<question2> Шу дегенiме дейнгі не?
<variantright> әр түрлі жиіліктегі дыбыстардың жиынтығы
<variant> 80 Дб асатын дыбыстар
<variant> 100 Дб-ге дейнгі дыбыстар
<variant> 50 Дб аспайтын бақылаусыз дыбыстардың жиынтығы
<variant> жұмыс қабілетіне қолайлы әсер ететін дыбыстар

<question2> Қандай жиiлiк аралығында адамның есiту мүшесi естiлетiн дыбысты созылмалы ортада қабылдайды?
<variantright> 20-20000 Гц
<variant> 10-15000 Гц
<variant> 15-15000 Гц
<variant> 16-15000 Гц
<variant> 17-15000 Гц

<question2> Еңбек қорғауда қандай функциялар мемлекетке жүктелмеген?
<variantright> еңбек қорғауда жұмысшылардың құқықтары мен заңдық қызығушылықтарын сақтауды қадағалайтын ұйым
<variant> еңбек қорғау талаптарын сақтауды қадағалайтын мемлекеттік ұйымдар
<variant> еңбек қорғаудың жағдайын жақсартатын мақсаттық бағдарламаларды қабылдау және жүзеге асыру
<variant> мемлекеттік еңбек қорғау басқармасы
<variant> еңбек қорғау бойынша қоғамдық қадағалауды ұйымдастыру

<question2> Қауiптiлiгi жоғары өндiрiс жайларында қолданылатын тасымал шырақтарда кернеудiң ең жоғарғысы қаншадан асып кетпеуi керек?
<variantright> 42 В
<variant> 36 В
<variant> 12 В
<variant> 6 В
<variant> 10 В

<question2> Қандай жағдайларда адамды мәжбүрлi еңбекке тартуға жол беріледі?
<variantright> соттың үкiмi бойынша, соғыс және ТЖ кезінде 
<variant> тәтенше жағдайды ескермегенде
<variant> соғыс жағдайларын ескермегенде
<variant> табиғаттың СҚ ескермегенде
<variant> табиғаттың ЭЖ ескермегенде

<question2> Қауiптiлiгi жоғары өндiрiс жайларында қолданылатын сымдардың сыртындағы резиналық қапталдың кедергiсi жылына неше рет тексерiлiп тұруы керек. 
<variantright> жылына бiр рет
<variant> жылына екi рет
<variant> жылына үш рет
<variant> жылына төрт рет
<variant> жылына бес рет 

<question2> Мәжбүрлі еңбекке қандай жағдайда жол беріледі?
<variantright> төтенше жағдайда немесе соғыс жағдайында ғана
<variant> жұмыс берушінің бұйрығымен ғана
<variant> еңбек қорғау бөлім бастығының жазбаша бұйрығымен ғана
<variant> цех басшысының ауызша бұйрығымен
<variant> мемлекеттік еңбек инспекциясының анықтамасымен ғана

<question2> Айнымалы тоқтың қай шамасында клиникалық өлiм болуы мүмкiн ?
<variantright>10 МА 
<variant> 8 МА
<variant> 6 МА
<variant> 4 МА
<variant> 2 МА

<question2> Тұрақты тоқтың қай шамасында клиникалық өлiм болуы мүмкiн?
<variantright> 100 МА
<variant> 90 МА 
<variant> 80 МА
<variant> 60 МА
<variant> 75 МА

<question2> Ауаның салыстырмалы ылғалдығы 100%-ке жақын болғанда, электр тоғымен зақымдану дәрежесiне байланысты, өндiрiс жайын қай топқа жатқызуғаболады?
<variantright> қауiптiлiгi өте жоғары
<variant> қауiптiлiгi жоғары
<variant> қауiптiлiгi орташа
<variant> қауiптiлiгi аздау
<variant> қауіптілігі өте аз

<question2> Ауаның салыстырмалы ылғалдығы ұзақ уақыт бойы 75% жоғары болған жағдайда, өндiрiс жайын электртоғымен зақымдануына байланысты қай топқа жатады?
<variantright> қауiптiлiгi жоғары 
<variant> қауiптiлiгi өте жоғары 
<variant> қауiптiлiгi орташалау 
<variant> қауiптiлiгi өте аздау 
<variant> қауіптілігі шамалырақ

<question2> Ауаның температурасы құрғақ, едендерi тоқ өткiзбейтiн өндiрiс жайларын электртоғымен зақымдану дәрежесiне байланысты қай топқа жатқызуға болады?
<variantright> қауiптiлiгi жоқ 
<variant> қауiптiлiгi аздау 
<variant> қауiптiлiгi төмен 
<variant> қауiптiлiгi орташа
<variant> қауiптiлiгi өте төмен 

<question2> Қуаты 10 квт-тан жоғары, кернеуi 1000 В-қа дейiнгi электрқондырғыларда қолданылатын жерге қосқыштардың кедергiсi қаншадан асып кетпеуi керек?
<variantright> 4 Ом
<variant> 10 Ом
<variant> 20 Ом
<variant> 30 Ом
<variant> 0,5 Ом 

<question2> Адамға ең қауiптi электртоғының жиiлiгi қандай аралық шамасында болуы мүмкiн?
<variantright> 50-100 Гц
<variant> 10-20 Гц
<variant> 10-30 Гц
<variant> 10-40 Гц
<variant> 10-50 Гц 

<question2> Қандай мақсатпен жердің бетінде кез-келген фазалық өткізгіштің тұйықталуынан пайда болған потенциалдарды не үшін теңестiредi?
<variantright> адымдық кернеу мен жанасу кернеуiн азайту 
<variant> электрқонды жұмыс режимдерiн қамтамасыз ету 
<variant> пайда болған потенциалды азайту үшiн
<variant> тұтынушыларды шамадан артық тоқтан қорғау 
<variant> тұтынушыларды шамадан аз тоқтан қорғау үшін

<question2> Қандай жиiлiк аралығында адамның есiту мүшесi естiлетiн дыбысты созылмалы ортада қабылдайды?
<variantright> 16-20000 Гц
<variant> 10-15000 Гц
<variant> 15-15000 Гц
<variant> 14-15000 Гц
<variant> 17-25000 Гц

<question2> Жерге қосқыштан қандай арақашықтықта жердiң потенциалы нольге тең болады?
<variantright> 20м 
<variant> 13м
<variant> 10м
<variant> 5м
<variant> 12м

<question2> Табиғи жерге қосқыш ретiнде қандай заттарды қолдануға болмайды?
<variantright> жанғыш сұйықтарды тасымалдайтын құбырларды
<variant> ғимараттардағы темір бетонды арматуралар 
<variant> кабельдердiң алюминиймен қапталған жерлерi
<variant> тоқпен қамтамасыз ететiн нольдiк өткiзгiштердi
<variant> обсадты құбырлар мен нолдік өткізгіштер

<question2> Адам денесiнен өтетiн тоқтың ұзақтығы көбейген сайын адам денесiнiң кедергiсi қалай өзгередi?
<variantright> тоқтын ұзақтығына байланысты азаяды 
<variant> тоқтын ұзақтығына байланысты көбейедi
<variant> кедергi уақытқа байланысты өзгеррмейді 
<variant> басында өседi, одан кейiн тез төмендейдi
<variant> басында азаяды, одан кейін тез өседі

<question2> Адам денесiнiң iшкi кедергiсiнiң шамасы неге байланысты?
<variantright> адам денесiнен өтетiн тоқ жолдарына 
<variant> айнымалы тоқтың жиiлiгiне, күшіне
<variant> адам денесінің тазалығына,кедергісіне
<variant> тоқ өтетiн жерлердiң жанасу ауданына
<variant> тоқ өтетін жерлердің жанасу көлеміне 

<question2> Көрсетiлген зақымдаушы жәйттердiң қайсысы негiзгi деп есептелiнедi?
<variantright> адамның денесiнен өтетiн тоқтың күшi 
<variant> айнымалы тоқтың жиiлiгi, кернеуі
<variant> тоқтың түрі, тоқтын жиілігі,кернеуі
<variant> тоқтың адамға ұзақ әсер етуi, түрі
<variant> адам организмінің жекеше ерекшелігі

<question2> Кернеуі 500 В тоқты жұмысқа қосу үшiн қандай прибор қолданылады?
<variantright> майлы сөндiргiш
<variant> ажыратқыштар
<variant> қорғағыш тар
<variant> трансформатор 
<variant> автоматты контактор

<question2> Кернеуi 1000 В-қа дейiнгi электрқондырғылар үшiн жерге қосқыштың кедергiсi қаншадан асып кетпеуi керек?
<variantright> 4 Ом 
<variant> 3 Ом 
<variant> 2 Ом 
<variant> 0,5 Ом 
<variant> 0,7 Ом 

<question2> Қауiптiлiгi жоқ өндiрiс жайларында қандай электр қондырғылар жерге қосқыш арқылы қосылады ? 
<variantright> кернеуi 500 В-тан жоғары
<variant> кернеуi 1000 В-тан жоғары 
<variant> генератордың қуаты 100 КВА 
<variant> айнымалы тоқтың кернеуi 36 В
<variant> трансформатордың қуаты 100 КВА

<question2> Кернеудiң қандай шамасында терiнiң сыртқы қабатында ойылған жер пайда болады?
<variantright> 40 В
<variant> 100 В
<variant> 110 В
<variant> 127 В
<variant> 220 В

<question2> Еңбек шартының мазмұнында жоғын табыңыз?
<variantright> жұмысшының жанұясындағы адам саны
<variant> тараптардың деректемелері
<variant> белгілі бір мамандық, кәсіп, біліктілік немесе лауазым бойынша жұмысы (еңбек функциясы)
<variant> еңбек шартының мерзімі
<variant> жұмыс уақыты мен тынығу уақытының режимі

<question2> Еңбек шартының мазмұнында жоғын табыңыз?
<variantright> жұмыс берушінің жанұясы туралы мәліметтер  
<variant> еңбекке ақы төлеу мөлшері мен өзге де шарттары
<variant> жұмыскердің құқықтары мен міндеттері
<variant> жұмыс берушінің құқықтары мен міндеттері
<variant> еңбек шартын өзгерту мен тоқтату тәртібі

<question2> Статикалық сынақ кезiнде жүк көтеретiн және тасымалдайтын механизмдердiң қандай көрсеткiштерi тексерiледi?
<variantright> механизмнiң берiктiлiгi
<variant> басқару аппараттары
<variant> тежегiш органдары
<variant> канаттың диаметрi
<variant> барабанның диаметрі

<question2> Адам тасымалдауға арналған көтергiш механизмдердiң жалпы берiктiлiгi мен тежегiш органдары неше процент артық салмақпен тексерiледi? 
<variantright> 100%
<variant> 95%
<variant> 80%
<variant> 75%
<variant> 85%

<question2> Жаңадан қойылған және күрделi жөндеуден шыққан крандардың жалпы берiктiлiгi мен тежегiш органдары неше процент артық салмақпен тексерiледi?
<variantright> 25%
<variant> 20%
<variant> 24%
<variant> 10%
<variant> 12%

<question2> Өзi жүретiн тележкалардың цех iшiндегi мөлшерленген қозғалыс жылдамдығы қаншаға тең?
<variantright> 5 км/сағ
<variant> 10 км/сағ
<variant> 15 км/сағ
<variant> 25 км/сағ
<variant> 7 км/сағ

<question2> Сынақ мерзімі жұмыскердің жұмыс өтіліне қосылады және қанша айдан аспауға тиіс?
<variantright> 3 айдан
<variant> 4 айдан
<variant> 5 айдан
<variant> 6 айдан
<variant> 12 айдан

<question2> Ұйымдардың басшылары және олардың орынбасарлары, бас бухгалтерлер мен олардың орынбасарлары, филиалдар, ұйымдар өкілдіктерінің басшылары үшін сынақ мерзімі қанша айға дейін ұзартылуы мүмкін?
<variantright> 6 айға
<variant> 7 айға
<variant> 1 жылға
<variant> 10 айға
<variant> 9 айға

<question2> Сымнан жасалған арқандарды қандай берiктiлiк шегi бар арнаулы маркалы сымнан жасайды?
<variantright> 140 190 кг/мм2 
<variant> 140  180 кг/мм2 
<variant> 140  170 кг/мм2 
<variant> 140  60 кг/мм2 
<variant> 140  185 кг/мм2 

<question2> Қыз балалар үшiн ауыр жүктi көтеру мен тасымалдау мөлшерiнiң шегi қанша?
<variantright> 10,25 кг
<variant> 12 кг
<variant> 15 кг
<variant> 16кг
<variant> 20 кг

<question2> Ер балалар үшiн ауыр жүктi көтеру мен тасымалдау мөлшерiнiң шегi қанша?
<variantright> 16,4 кг
<variant> 15 кг
<variant> 20 кг
<variant> 25 кг
<variant> 18 кг

<question2> Жасы 18-ден жоғары әйелдер үшiн ауыр жүктi көтеру мен тасымалдау мөлшерiнiң шегi қанша?
<variantright> 20 кг
<variant> 30 кг
<variant> 40 кг
<variant> 50 кг
<variant> 25 кг

<question2> Жасы 18-ден жоғары ерлер үшiн ауыр жүктi көтеру мен тасымалдау мөлшерiнiң шегi қанша?
<variantright> 50 кг
<variant> 60 кг
<variant> 65 кг
<variant> 55 кг
<variant> 70 кг

<question2> 18 жасқа толмаған жасөспірімдерді түнгі жұмыстарға тартуға боладыма?
<variantright> жоқ, болмайды
<variant> ия, болады
<variant> аке-шешесінің немесе қамқоршысынң рұқсатымен болады
<variant> жұмысшының жазбаша рұқсатымен болады
<variant> медициналық анықтамаға сәйкес

<question2> Жұмыскермен еңбек шарты жұмыс берушінің бастамасы бойынша қандай жағдайда бұзылмайды?
<variantright> сынақ мерзімі толық аяқталғаннан кейн
<variant> жұмыскер жұмыста алкогольдік масаңдық жағдайында болған кезде
<variant> жұмыскер бір жұмыс күні ішінде дәлелді себепсіз үш және одан да көп сағат бойы жұмыста болмаған кезде
<variant> жұмыскер, еңбек қауіпсіздігі және еңбекті қорғау мәселелері бойынша білімін тексеруден қайтадан өтпеген кезде
<variant> алкогольдік заттарды пайдалану фактісін анықтау үшін медициналық куәландырудан өтуден бас тартқан кезде

<question2> Еңбек, ұжымдық шарттарда көзделген өзге де жағдайларда жұмыскердің хабарламасы негізінде күнтізбелік қанша күнге дейін жалақы сақталмайтын демалыс беруге міндетті?
<variantright> 5 күн
<variant> 3 күн
<variant> 7 күн
<variant> 10 күн 
<variant> 30 күн

<question2> Жүктілікке және босануға байланысты демалыс ұзақтығы, қалыпты босану кезінде?
<variantright> босануға дейін күнтізбелік 70 күнге және босанғаннан кейін күнтізбелік 56 күнге
<variant> босануға дейін күнтізбелік 56 күнге және босанғаннан кейін күнтізбелік 70 күнге
<variant> босануға дейін күнтізбелік 70 күнге және босанғаннан кейін күнтізбелік 50 күнге
<variant> босануға дейін күнтізбелік 50 күнге және босанғаннан кейін күнтізбелік 70 күнге
<variant> босануға дейін күнтізбелік 60 күнге және босанғаннан кейін күнтізбелік 60 күнге

<question2> Жүктілікке және босануға байланысты демалыс ұзақтығы, қиын босанған немесе екі және одан көп бала туған кезде? 
<variantright> босануға дейін күнтізбелік 70 күнге және босанғаннан кейін күнтізбелік 70 күнге
<variant> босануға дейін күнтізбелік 56 күнге және босанғаннан кейін күнтізбелік 70 күнге
<variant> босануға дейін күнтізбелік 70 күнге және босанғаннан кейін күнтізбелік 50 күнге
<variant> босануға дейін күнтізбелік 50 күнге және босанғаннан кейін күнтізбелік 70 күнге
<variant> босануға дейін күнтізбелік 60 күнге және босанғаннан кейін күнтізбелік 60 күнге

<question2> Құбырларды қондыру кезiнде оларды қандай ылдимен қондыру керек?
<variantright> 1:500
<variant> 1:400
<variant> 1:300
<variant> 1:350
<variant> 1:200

<question2> Бұларды тасымалдауға арналған құбырларды қандай түспен бояуға болады?
<variantright> қызыл
<variant> көк
<variant> сары
<variant> жасыл
<variant> қоңыр

<question2> Суды тасымалдауға арналған құбырларды қандай түспен бояуға болады?
<variantright> көкжасыл
<variant> сары
<variant> қоңыр
<variant> қызыл
<variant> көк

<question2> Ауаны тасымалдауға арналған құбырды қандай түспен бояуға болады?
<variantright> көк
<variant> жасыл
<variant> сары
<variant> ақ
<variant> қара

<question2> Неше градусқа шейiн қыздырылған металл құбырлардың сыртын ыстық жiбермейтiн материалдармен қаптауғаболады?
<variantright> 400С жоғары
<variant> 500С жоғары
<variant> 600С жоғары
<variant> 700С жоғары
<variant> 450С жоғары

<question2> ҚР 2023 жылға бекітілген ең төменгі жалақы мөлшері?
<variantright> 70000 тг
<variant> 36900 тг
<variant> 60500 тг
<variant> 100000 тг
<variant> 29170 тг

<question2> ҚР 2023 жлыға бекітілген айлық есептік көрсеткіштің (мрп) мөлшері?
<variantright> 3450 тг
<variant> 2778 тг
<variant> 4200 тг
<variant> 2000 тг
<variant> 4500 тг

<question2> Түнгі уақыттағы жұмыс деп сағат қаншада қаншаға дейнгі уақытты айтамыз? 
<variantright> 22:00 ден 06:00 ге дейн
<variant> 20:00 ден 06:00 ге дейн
<variant> 19:00 ден 07:00 ге дейн
<variant> 20:00 ден 08:00 ге дейн
<variant> 18:00 ден 06:00 ге дейн

<question2> Iшiне аммиак толтырылатын баллон қандай түспен боялуы керек?
<variantright> сары
<variant> қызыл
<variant> көк
<variant> қоңыр
<variant> қара

<question2> Iшiне көмiрқышқыл толтырылатын баллон қандай түспен боялуы керек?
<variantright> қара
<variant> қызыл
<variant> көк
<variant> қоңыр
<variant> сары

<question2> Iшiне ацетилен толтырылатын баллон қандай түспен боялуы керек?
<variantright> ақ
<variant> қызыл
<variant> көк
<variant> қоңыр
<variant> сары

<question2> Iшiне фреон толтырылатын баллон қандай түспен боялуы керек ?
<variantright> аллюминий түспен
<variant> қызыл тұспен
<variant> күмiс түспен
<variant> қоңыр тұспен
<variant> көк түспен

<question3> «Еңбек қорғау» түсінігіне дұрыс анықтама беріңіз:
<variantright> Еңбек қорғау – құқықтық, әлеуметтік-экономикалық, ұйымдастырушылық, техникалық, санитарлық-гигиеналық және басқа да іс-шараларды өзіне қосатын еңбек процесінде жұмысшылардың денсаулығын және өмірін сақтау жүйесі
<variant> Еңбек қорғау –жеке адмды және көпшілікті апаттардан қорғау жағдайы
<variant> Еңбек қорғау – құқықтық, әлеуметтік-экономикалық, ұйымдастырушылық, техникалық, санитарлық-гигиеналық және басқа да іс-шараларды өзіне қосатын еңбек процесінде жұмысшылардың жанұясының денсаулығын сақтау жүйесі
<variant> Еңбек қорғау- еңбек әрекетінің қауіпсіздігін қамтамасыз ететін басқару жүйесінің ұйымдастырушылық құрылымын шығаруға және қолдауға және де басқару жүйесін ресурстары мен қамтамасыз етуге бағытталған
<variant> Еңбек қорғау- басқару жүйесінің ұйымдастырушылық құрылымын шығаруға және қолдауға және де басқару жүйесін ресурстармен қамтамасыз етуге бағытталған

<question3> Жұмыскердің тікелей міндетіне кірмейтін бір реттік жұмыс кезінде авариялық жағдайдың орын алуына байланысты және табиғат апаты кезінде мақсатты нұсқау жүргізіледі. Тағы қандай жұмыс түрі кезінде мақсатты нұсқау жүргізу міндетті?
<variantright> рұқсатпен және наряд түрінде өтетін аса қауіпті жұмыс орындау кезінде
<variant> барлық өндірістік аса қауіпті факторлардың түрі көрсетілген
<variant> тездетілген жұмысты орындау кезінде наряд допуск берілмейді жұмысшыға
<variant> демалыстан соң жұмысқа шыққан кезде нұсқауларды өтіп шығу керек болады
<variant> авариялық жұмыстар кезінде болатын аса қауіпті жұмыс орындау кезінде

<question3> Басқа жұмыс берушінің жұмыс аумағында болған мекеме жұмысшысымен болған жазатайым оқиға кіммен тексеріледі?
<variantright> осы жұмыстар тапсырылған жұмыс берушімен құрылған комиссиямен ескеріп тексеріледі
<variant> аталған жұмыс аумағы бекітілген жұмысберушімен ескеріледі және тексеріледі комиссия мүшесімен
<variant> екі мекеме бойынша құрылған комиссиялармен ескеріледі және тексеріледі жұмысшыларды
<variant> мемлекеттік еңбек инспекторымен тексеріледі және комиссия мүшесімен қадағалайды ескертіп
<variant> техника қауіпсіздігі инженерімен тексеріледі, комиссиялармен мүшесімен ескеріледі және тексеріледі

<question3> Белгілі бір мерзім ішінде сақтандыру өтемақысына құқығы бар тұлғалар төменде келтірілген. Қатені табыңыз.
<variantright> 23 жастағы студент
<variant> қайтыс болған күйеуінің ағасына күтім жасап отқан және жұмыс істемейтін жесір әйел
<variant> еңбекке жарамсыздығына байланысты жұмыс істемейтін және қайтыс болған тұлғаның балаларына күтім жасап отқан анасы
<variant> кәмелетке толмағандар,18 жасқа толмаған жасөспірімдер 
<variant> зардап шеккен жұмыскердің туыстары

<question3> Қандай жағдайларда адамды мәжбүрлi еңбекке тартуға жол беріледі?
<variantright> соттың үкiмi бойынша, соғыс және ТЖ кезінде 
<variant> тәтенше жағдайды ескермегенде
<variant> соғыс жағдайларын ескермегенде
<variant> табиғаттың СҚ ескермегенде
<variant> табиғаттың ЭЖ ескермегенде

<question3> Қанша  жастан бастап еңбек шарты жасалады .
<variantright> 16 жастан
<variant> 17 жастан
<variant> 18 жастан
<variant> 19 жастан
<variant> 20 жастан

<question3> Үстеме жұмыстарды атқарылатын жұмыстардың мөлшерi қандай болуы керек?
<variantright> тәулік ішінде 2 сағаттан аспауы тиiс
<variant> тәулік ішінде 5 сағаттан аспауы тиiс
<variant> тәулік ішінде 4 сағаттан аспауы тиiс
<variant> тәулік ішінде 3 сағаттан аспауы тиiс
<variant> аптасына 6 сағаттан аспауы тиіс

<question3> Түнгi уақыттағы жұмыс, қай уақыттан, қай уақытқа дейiн түнгi уақыттағы жұмыс деп есептелiнедi?
<variantright> 22 сағ. бастап таңғы сағ. 6-ға дейiн
<variant> 21 сағ. бастап таңғы сағ. 5-ке дейiн
<variant> 23 сағ. бастап таңғы сағ. 7-ге дейiн
<variant> 24 сағ. бастап таңғы сағ. 8-ге дейiн
<variant> 20 сағ. бастап таңғы сағ. 8-ге дейiн

<question3> Жұмыс уақытының қалыпты ұзақтағы аптасына қанша сағаттан аспауға тиiс?
<variantright> 40
<variant> 52
<variant> 30
<variant> 48
<variant> 42

<question3> Он төрт жастан он алты жасқа дейiнгi қызметкерлер үшiн жұмыс уақытының ұзақтығы аптасына қанша сағаттан аспауға тиiс?
<variantright> 24 сағаттан аупау тиіс
<variant> 25 сағаттан аупау тиіс
<variant> 18 сағаттан аупау тиіс
<variant> 16 сағаттан аупау тиіс
<variant> 22 сағаттан аупау тиіс

<question3> Он алты жастан он сегiз жасқа дейiнгi қызметкерлер үшiн жұмыс уақытының  ұзақтығы аптасына қанша сағаттан аспауға тиiс?
<variantright> 36 сағаттан аспау тиіс
<variant> 24 сағаттан аспау тиіс
<variant> 20 сағаттан аспау тиіс
<variant> 18 сағаттан аспау тиіс
<variant> 30 сағаттан аспау тиіс

<question3> Зиянды немесе ауыр еңбек жағдайларында жұмыс iстейтiн қызметкерлер үшiн жұмыс уақыты аптасына қанша сағаттан аспауға тиiс?
<variantright> 36 сағаттан аспау тиіс
<variant> 41 сағаттан аспау тиіс
<variant> 24 сағаттан аспау тиіс
<variant> 18 сағаттан аспау тиіс
<variant> 16 сағаттан аспау тиіс

<question3> Алты күндiк жұмыс аптасы кезiнде күнделiктi жұмыстың ұзақтығы нормаға сәйкес 36 сағат болғанда қанша сағаттан аспауға тиiс?
<variantright> 6 сағаттан
<variant> 7 сағаттан
<variant> 8 сағаттан
<variant> 4 сағаттан
<variant> 3 сағаттан

<question3> Алты күндiк жұмыс аптасы кезiнде күнделiктi жұмыстың ұзақтығы нормаға сәйкес 24 сағат болғанда қанша сағаттан аспауы тиiс?
<variantright> 4
<variant> 5
<variant> 3
<variant> 6
<variant> 3,5

<question3> Мерзiмнен тыс жұмыстарға кiмдер жiберiлмейдi?
<variantright> жасы 18 толмаған қызметкерлер
<variant> 19 толмаған қызметкерлер 
<variant> жасы 21 толмаған қызметкерлер
<variant> басшылар
<variant> зейнеткерлер

<question3> Жұмыстың аяқталу  уақыты мен жұмыстың басталу уақыты арасындағы қызметкердiң күнделікті демалыс уақытының ұзақтығы қанша сағаттан кем болмауы тиiс?
<variantright> 12 сағаттан
<variant> 18 сағаттан
<variant> 15 сағаттан
<variant> 14 сағаттан
<variant> 16 сағаттан

<question3> Демалыс және мереке күндерiндегi жұмысқа төленетін ақы қандай мөлшерде жүргiзiледi?
<variantright> 1,5 еседен аз болмайтын 
<variant> 2 еседен төмен болмайтын
<variant> 2,5 төмен болмайтын
<variant> 3 еседен төмен болмайтын
<variant> 1 еседен аз болмайтын

<question3> Қызметкерге оның өтiнiшi бойынша күнтiзбелiк күннен аспайтын жалақысы сақталмайтын қанша күндік демалыс берiлуi мүмкін?
<variantright> 30
<variant> 25
<variant> 20
<variant> 24
<variant> 18

<question3> Әйелдердің жүктiлiгі және босануына берiлетiн ақылы демалыстардың күнтiзбелiк күнi қанша күнді құрайды?
<variantright> босанғанға дейiн 70, босанғаннан кейiн 56
<variant> босанғанға дейiн 56, босанғаннан кейiн 56
<variant> босанғанға дейiн 65, босанғаннан кейiн 60
<variant> босанғанға дейiн 60, босанғаннан кейiн 56 
<variant> босанғанға дейін 70, босанғаннан кейін 57

<question3> Жүкті және жаңадан босанған әйелдерге, жаңадан туылған нәрестенi асырап алған әйелдерге (еркектерге) нәрестенін туылған уақытына қарай қанша күндік ақылы демалыс берiледi?
<variantright> бала дүниеге келгеннен кейін 56 күн
<variant> бала дүниеге келгеннен кейін 55 күн
<variant> бала дүниеге келгеннен кейін 60 күн
<variant> бала дүниеге келгеннен кейін 70 күн
<variant> баладүниеге келгеннен кейін 65 күн

<question3> Енбекке уақытша жарамсыздығына байланысты қызметкерге берілетін жәрдемақының мөлшерi қандай болуы мүмкiн?
<variantright> орташа айлық жалақының 100
<variant> 10 еселенген айлық жалақыдан кем емес
<variant> 10 орташа айлық жалақы мәлшерінде
<variant> 5 еселенген айлық жалақыдан кем емес
<variant> орташа айлық жалақының 5-10 

<question3> Толық материалдық жауапкершiлiк туралы жазбаша шарттарды кiммен жасайды?
<variantright> 18 жасқа толғандармен
<variant> 17 жасқа толғандармен
<variant> 16 жасқа толғандармен
<variant> 15 жасқа толғандармен
<variant> 14 жасқа толғандармен

<question3> Тәртiптiк жазаның қолданылу мерзiмi қанша күннен аспауы тиiс?
<variantright> 1 айдан аз болмауы
<variant> 2 айдан аз болмауы 
<variant> 3 айдан аз болмауы
<variant> 1 аптадан аз болмауы
<variant> 5 айдан аз болмауы

<question3> Еңбек дауларын қандай органдар қарайды?
<variantright> еңбек қорғау инспекциясы
<variant> прокуратура
<variant> кәсiподақ комитетi
<variant> соттар 
<variant> жауапкершілігі шектеулі серіптестері 

<question3> Жыл сайынғы еңбек шарты бойынша қызметкерлерге төленетін демалыс уақыты.
<variantright> 24
<variant> 30
<variant> 32
<variant> 28
<variant> 56

<question3> Зақымданудың сипатына қарай өндiрiстiк жарақатты қандай түрлерге бөлуге болады?
<variantright> мех-қ; терм-қ; хим-қ; сәулелiк; электрлiк
<variant> терм-қ; хим-қ, мех-қ, сәулелік, жылулық
<variant> электрлiк,мех-қ,терм-қ, жылулық, рад-қ
<variant> терм-қ,сәулелiк,мех-қ, рад-қ, хим-қ
<variant> электрлік, аралас, мех-қ, рад-қ, ренгендік

<question3> Термиялық жарақатқа нелер жатады?
<variantright> жылу соққылары, күйiктер, үсулер
<variant> күйiктер, жылу соққылары, күн тию
<variant> жылу соққылары, күйіктер, күн соққылары
<variant> үсулер,күйiктер, күн соққылары
<variant> күйіктер, күн соққылары, жарық сәулелері

<question3> 1 ... 5 адам өлімге ұшыраған жағдайда қандай органдар тергеу жұмыстарын жүргізеді?
<variantright> енбеқ қорғау бойынша өкiлеттiгi бар мемлекеттік органдар
<variant> жергілікті мемлекеттік басқару органының қызметкерлері
<variant> Қазақстан Республикасы үкiметi
<variant> енбеқ және әлеуметтiк қорғау министрлігі
<variant> премьер министрдің орынбасары

<question3> Әрбiр жазатайым оқиғаның салдарынан еңбек қабiлетiн жоғалтқандарға медициналық сараптамаға сәйкес қандай құжаттар дайындалады?
<variantright> Н-1 актiсi 4 данадан толтырылады
<variant> Н-2 актiсi, 5 данадан толтырылады
<variant> 7-Т түрi, 4 данадан толтырылады 
<variant> 7 ТВН түрi, 5 данадан толтырылады 
<variant> 7-БТ түрі, 4 данадан толтырылады

<question3> Үш күнін ішінде жазатайым оқиғаны тергеу жұмыстарының нәтижесі бойынша Н-1 акті кімге беріледі?
<variantright> зардап шеккен  адамдарға немесе оның туыстарына  
<variant> мекеменің  еңбек қорғау бас инженерiне немесе еңбек қорғау инженеріне
<variant> жауапкершілігі шектеулі серіптестері немесе кәсiподақ комитетiне
<variant> енбек қорғау департаментiне
<variant> кәсіпорынның бас инженеріне

<question3> Кәсiпорын архивiнде жазатайым оқиғаны тергеу материалдары қанша жыл сақталады?
<variantright> 45 жыл
<variant> 36 жыл
<variant> 3 жыл
<variant> 30 жыл
<variant> 5 жыл

<question3> Жұмыскерлердің біліктілігін тексеру кезексіз жүргізіледі: еңбекті қорғауда жаңа және қайтарылған нормативті құқықтық актілерді кірістіру жағдайында; техникалық процесстердің, құрылғылардың өзгеруі кезінде; басқа жұмысқа ауысқан жағдайда. Барлық жағдайлар толық көрсетілген бе?
<variantright> көрсетілмеген, авария оқиғасынан немесе жазатайым жағдайдан кейін еңбекті қорғау және өндіріс қауіпсіздігі талаптарын бірнеше рет бұзған жағдайда
<variant> көрсетілмеген, еңбекті қорғау және өндіріс қауіпсіздігі талаптарын бірнеше рет бұзған жағдайда
<variant> көрсетілмеген, авария оқиғасынан, жазатайым жағдайдан және жанжалдан кейін
<variant> барлығы
<variant> көрсетілмеген, авария оқиғасынан, жазатайым жағдайдан және өндірістегі жанжалдан кейін

<question3> Кәсiби ауруға ұшырағандарға жасалынған Н-1 актiсiнiң көшiрмесi кiмдерге берiледi?
<variantright> денсаулық сақтау мекемесiне
<variant> кәсiподақ комитетiне
<variant> құқық қорғау органына
<variant> жергілікті қорғау органына
<variant> прокуратура органына

<question3> Созылмалы кәсіби ауруды тексеруге неше күн берiледi?
<variantright> 7 тәулік
<variant> 12 тәулік
<variant> 11 тәулік
<variant> 10 тәулік
<variant> 9 тәулік

<question3> Ауыр деңгейдегі  кәсiби ауруларды тергеуге неше сағат берiледi?
<variantright> 24 сағат
<variant> 18 сағат
<variant> 45 сағат
<variant> 10 сағат
<variant> 17 сағат

<question3> Ауыр жазатайым жағдайдан кейін мекеме басшысы зардап шеккен жұмыскеріне дәл сол күні белгіленген іс-әрекеттерді қолдану кезінде нені жасамау керек?
<variantright> жазатайым жағдайға кінәлі жұмыскерді тәртіп жөніндегі жауапқа тартты
<variant> зардап шеккен жұмыскерді аураханаға өзінің көлігімен жеткізді
<variant> зардап шеккен жұмыскердің туыстарына өндірісте болған жазатайым жағдайды хабарлады
<variant> өндірісте жазатайым жағдайды тергеу жүргізілгенге дейін құпия сақтаудың орнына,болған жағдайды айқындап қойды (сызба құрастыру,суретке түсіру жұмыстарын жүргізу)
<variant> алғашқы дәрігерлік көмек қызметін шақырды

<question3> Еңбекті қорғау бойынша аса қауіпті объектпен немесе жұмыспен айналысатын жұмыскерлердің біліктілігін тексеру мерзімді түрде жылына бір рет өтуі тиіс. Біліктілікті тексеру мерзімі дұрыс көрсетілген бе?
<variantright> берілген жауап дұрыс
<variant> дұрыс емес-3 жылда бір рет
<variant> жаңа ережелер мен қондырғылар ауыстырылған жағдайда біліктілікті тексеру жұмыстары жүргізіледі
<variant> мерзімді жұмысберуші айқындайды
<variant> демалыс күннен кейін тексеріліс жүргізіледі

<question3> Жұмысқа бара жатқанда немесе жұмыстан қайтқан кезде өндiрiстен тыс болған жазатайым оқиғаларды тергеу кезінде тергеу комисиясының құрамына кімдер кіреді?
<variantright> еңбек ұжымының өкiлi
<variant> кәсіподақ ұжымының өкiлi
<variant> әкiмшiлiктің жүмыскерлерi
<variant> еңбек қорғау инженерi
<variant> тіршілік қауіпсіздік инженері

<question3> Н-2 акті қәсiпорынның архивiнде қанша жыл сақталады?
<variantright> 5 жыл ішінде
<variant> 10 жыл ішінде
<variant> 15 жыл ішінде
<variant> 20 жыл ішінде
<variant> 25 жыл ішінде

<question3> Н-1 актiнiң түрi қандай бөлiмдерден тұрады?
<variantright> текстiк, кодтық
<variant> текстiк, графикалық
<variant> кодалық, графикалық
<variant> графикалық, экономикалық
<variant> экономикалық, текстік

<question3> «Әлеуметтік демалыс» түсінігіне дұрыс анықтама беріңіз?
<variantright> жыл сайынғы ақылы еңбек демалысы қызметкердің тынығуына, жұмыс қабілетін қалпына келтіруіне, денсаулығын нығайтуына және қызметкердің өзге де жеке қажеттіктеріне арналады және жұмыс орны (лауазымы) мен орташа жалақысы сақтала отырып, белгілі бір күнтізбелік күндер санына беріледі.
<variant> қызметкерлер қызметкерлердің өкілдері, жұмыс берушілер (жұмыс берушілердің өкілдері), мемлекеттік органдар арасындағы еңбек қатынастарын және олармен тікелей байланысты өзге де қатынастарды реттеу мәселелері бойынша олардың мүдделерін үйлестіруді қамтамасыз етуге бағытталған өзара қатынастар жүйесі.
<variant> жұмыс орны (лауазымы) мен осы Кодексте белгіленген жағдайларда орташа жалақысын сақтай отырып, қызметкердің жыл сайынғы тынығуын қамтамасыз ету немесе әлеуметтік мақсаттар үшін қызметкерді белгілі бір кезеңге жұмыстан босату;
<variant> қызметкердің еңбек міндеттерін орындаудан бос және өз қалауы бойынша пайдалана алатын уақыты.
<variant> қызметкердің немесе жұмыс берушінің жазбаша өтініші не өзге тәсілмен (курьерлік почта, почта байланысы, факсимильді байланыс және электрондық почта арқылы) берілген өтініштер

<question3> Техника қауiпсiздiгiне мемлекеттiк стандарт бойынша қандай шифр берiлген?
<variantright> 12
<variant> 10
<variant> 9
<variant> 8
<variant> 7

<question3> Әйелдер мен жастар неше жасқа дейiн мiндеттi түрде әр жылғы медициналық қараудан өтiп тұруы керек?
<variantright> 45 және 18
<variant> 45 және 17
<variant> 45 және 16
<variant> 45 және 15
<variant> 45 және 14

<question3> Еңбек қорғау заңдылықтарын бұзғаны үшiн жұмыскерлер мен қызметкерлердi жауапкершiлiктiң қандай түрлерiне тартуға болады:
<variantright> тәртiптiк, әкiмшiлiк, қылмыстық
<variant> қылмыстық, тәртiптiк, экономикалық
<variant> қылмыстық, әкiмшiлдiк, экономикалық
<variant> қылмыстық, әкiмшiлдiк, азаматтық
<variant> қылмыстық, материалдық, тәртіптік

<question3> Техниканы қауiпсiздендiру жөнiндегi мемлекеттiк стандарт неше топтық класқа бөлінген?
<variantright> 6
<variant> 5
<variant> 4
<variant> 3
<variant> 2

<question3> Жасы 15-ке келген жастарды қандай жағдайда жұмысқа қабылдауға болады?
<variantright> ата анасының қағаз жүзінде рұқсатымен
<variant> жеке басының куәлігі болған кезде
<variant> туу туралы куәлігі болған кезде
<variant> мектеп директорының рұқсатымен
<variant> жеке басының төл құжаты болғанда

<question3> Қазақстан Республикасының Еңбек кодексі алғаш рет қай жылы қабылданды?
<variantright> 15 мамыр 2007 ж.
<variant> 23 қараша 2005 ж.
<variant> 1 маусым 2008 ж.
<variant> 16 шілде 2008 ж.
<variant> 11 сәуір 2014 ж.

<question3> Қауiптi өндiрiстiк факторға анықтама берiңiз?
<variantright> жарақатқа, денсаулықтың бұзылуына әкеп соқтыратын
<variant> адам денсаулығына ұзақ әсер етiп кәсіби ауруға әкеп соғады
<variant> жұмыс iстеу қабылетiн төмендететін факторлар туындайды
<variant> жарақатқа, ауруға әкеп соқтыратын қауіптер төнеді
<variant> денсаулықтың бұзылуына әкеп соқтыратын факторлар әсер етеді

<question3> Еңбек қауiпсiздiгi стандарттарының жүйесiне енетiн стандарттарды көрсетiңiз?
<variantright> Салалық, салааралық, қауiпсiздiк
<variant> Салалық, аймақтық қауiпсiздiк
<variant> Салалық,салааралық, ведомствалық
<variant> Салалық, салааралық, аймақтық
<variant> қауіпсіздік, стандарттары, ведомствалық

<question3> Еңбек қорғау туралы ережелердi атаңыз?
<variantright> жалпыға бiрдей, салараалық, салалы ереже
<variant> салалы ереже, жалпыға бiрдей ереже
<variant> салалық және салааралық ережелер
<variant> салалық және барлығына бiрдей ережелер
<variant> салалы және ведомствалық ережелер

<question3> Еңбек қорғаудың жалпыға бiрдей ережесі қандай жерлерге беріледі?
<variantright> шаруашылықтың барлық салаларына
<variant> өндiрiстiң бiрнеше салаларына
<variant> өндiрiстiң кейбiр жабдықтар түрiне
<variant> өндiрiстiң кейбiр салаларына
<variant> өндірістің әртүрлі салаларына

<question3> Еңбек қорғаудың салалық ережесi қандай жерлерге беріледі?
<variantright> шаруашылықтың кейбiр салаларына
<variant> өндiрiстiң кейбiр жабдықтар түрiне
<variant> өндiрiстiң барлық салаларына
<variant> өндiрiстiң бiрнеше салаларына
<variant> өндірістің әртүрлі салаларына

<question3> Қайталама жүргiзiлетiн жоспарлы нұсқау қай уақытта және не үшiн жүргiзiледi?
<variantright> тоқсанына 1 рет бiлiмiн көтеру үшiн
<variant> 6 айда 1 рет бiлiмiн көтеру үшiн
<variant> 7 айда бiр рет бiлiмiн көтеру үшiн
<variant> 9 айда бiр рет бiлiмiн көтеру үшiн
<variant> жылына бір рет білімін көтеру үшін

<question3> Жеке шарт - деген ұғымға анықтама берiңiз.
<variantright> жазбаша нысанда жасалатын келiсiм шарт 
<variant> жұмыс берушi және қызметкер арасында жасалатын ауызша келiсiм
<variant> кәсіподақ орындауға керекті жазбаша келісім
<variant> жұмыс берушi және кәсiподақ арасындағы келiсiм
<variant> жұмыс беруші мен жұмыскерлердің арасындағы келісім

<question3> Қазақстан Республикасының еңбек кодексі қандай құжатқа негiзделедi?
<variantright> ҚР Конституциясына
<variant> ҚР азаматтық қорғаныс заңына
<variant> ҚР еңбек қорғау заңына
<variant> ҚР заң актiлерiнiң негiзiне
<variant> ҚР еңбек қауіпсіздігі заңына

<question3> Тергеу нәтижелері  Н-2 актiнiң формасы бойынша  неше данаға  дейін толтырылады?
<variantright> 4-5
<variant> 1-2
<variant> 2-3
<variant> 5
<variant> 4

<question3> Н-2 актiн толтырғанда, оның кодтык бөлiмiн кiм жазады?
<variantright> кәсiпорын
<variant> кәсiподақ комитетi
<variant> вице президент
<variant> енбек қорғау инженерi
<variant> бас инженер

<question3> Н-1 формалы актіні кім бекітеді?
<variantright> кәсiпорын басшысы
<variant> кәсiподақ комитетi
<variant> енбек қорғау инженерi
<variant> жергілікті басшы
<variant> аудан әкімі

<question3> Жарақатты талдау негiзiнен қандай тәсiлдермен жүргiзiледi?
<variantright> стат-қ, монограф-қ, топтық, эконом-қ
<variant> топтық, топограф-қ, монограф-қ, геолог-қ
<variant> эконом-қ, монограф-қ, геолог-қ, стат-қ
<variant> стат-қ, топтық, топограф-қ, геолог-қ
<variant> топтық, эконом-қ, геолог-қ, есептеу. 

<question3> Өзiнiң еңбек қабiлетiнен толық немесе жартылай айырылған жұмысшыларға төленетiн бiр жылғы жәрдемақының көлемi қандай құжаттармен анықтанылады?
<variantright> ұжымдық шарт ҚР заңдары
<variant> ұжымдық шарт, жарақат алғаны туралы
<variant> ҚР заңдарымен, ЕҚ келісімдерімен
<variant> ҚР қаулыларымен, ЕҚ келісімдерімен
<variant> ҚР заңдарымен, жарамсыз қағаздарымен

<question3> Кәсiби аурудың салдарынан мүгедектiктiң бiрiншi немесе екiншi тобына жатқандарға төленетiн шығынның мөлшерi қанша болуы керек?
<variantright> жылдық табыстан 5 есе кем болмауы
<variant> жылдық табыстан 10 есе кем болмауы
<variant> жылдық табыстан 12 есе кем болмауы
<variant> жылдық табыстан 15 есе кем болмауы
<variant> жылдық табыстан 9 есе кем болмауы

<question3> 3 топтағы мугедек деп танылған қызметшiлерге төленiнетiн 1 жылғы жәрдем ақының мөлшерi жылдық табыстың көлемiнен қанша болуы керек?
<variantright> жылдық табыстан 2 есе кем болмауы
<variant> жылдық табыстан 10 есе кем болмауы
<variant> жылдық табыстан 13 есе кем болмауы
<variant> жылдық табыстан 15 есе кем болмауы
<variant> жылдық табыстан 9 есе кем болмауы

<question3> Өндiрiстегi жазатайым оқиғаның салдарынан өлген адамдарға төленетiн жәрдемақының мөлшерi жылдық табыстың көлемiнен қанша болуы керек?
<variantright> 10 есе кем болмауы
<variant> 7 есе кем болмауы
<variant> 8 есе кем болмауы
<variant> 6 есе кем болмауы
<variant> 9 есе кем болмауы

<question3> Н-1 формалы актiсi зардап шегушіге неше күннен кейін беріледі?
<variantright> 3 күн
<variant> 10 күн
<variant> 15 күн
<variant> 20 күн
<variant> 5 күн

<question3> Бірнеше адамдар жұмыс орнында уланса, оны тергеу бойынша комиссиясының құрамының мүшесіне қосымша қандай қызметтің өкілі кіреді?
<variantright> санэпидемстанция
<variant> жедел жәрдем қызметі
<variant> өрт сөндіру қызметі
<variant> полиция қызметі
<variant> аумақтық поликлиника

<question3> 2024 жылға бекітілген айлық есептік көрсеткіштің (АЕК) соммасы?
<variantright> 3692 тг
<variant> 2500 тг
<variant> 42500 тг
<variant> 1916 тг
<variant> 5000 тг

<question3> Жалпы улылық әсері бар химиялық ароматты көмiрсутектердi көрсетіңіз?
<variantright> бензол, толуол, ниторбензол
<variant> анилин, хлор, бензол, лигнин
<variant> анилин, бензин, бензопирен
<variant> ксилол, гексон, күкіртсутек
<variant> ацетон, аммиак, ацетилен

<question3> Түршiгерлiк химиялық зиянды заттармен жанасқанда, адамда қандай өзгерiстер болуы мүмкiн?
<variantright> сілемейлі қабықтар зақымданады, қан аурулары
<variant> асматикалық құбылыстар, сәуле аурулары
<variant> қан құрамының өзгеруі, сәуле аурулары
<variant> адам терiлерiнде аллергиялық құбылыстар
<variant> онкологиялық аурулар, сәуле аурулары

<question3> Канцерогендiк заттардың адам организiмiне әсер етуi қандай аурулардың дамуына әкелiп соғуы мүмкiн?
<variantright> қатерлi iсiктерге
<variant> қан ауруларына
<variant> қатерсiз iсiктерге
<variant> терi ауруларына
<variant> онкологиялық ауруларға

<question3> Еңбек кодексіне сәйкес қалыпты жұмыс уақытысы аптасына қанша сағаттан аспауы тиіс?
<variantright> 40
<variant> 48
<variant> 52
<variant> 36
<variant> 20

<question3> Химиялық заттардың қауiптiлiгiн қандай көрсеткiш арқылы анықтауға болады?
<variantright> заттардың шектi рұқсат етiлген мөлшері
<variant> орташа өлiмге алып келетiн мөлшерi 
<variant> асқазанды улап ,өлiмге душар ететiн дозасы
<variant> ингаляциялық улану мүмкiндiгi коэффициентi
<variant> шекті рұқсат етілген деңгейі және мәлшері

<question3> Шаң өзiнiң құрамына және түрiне байланысты адамның қандай органдарына қолайсыз әсер етедi?
<variantright> адамның тыныс алу жолдарына
<variant> адамның есту мүшесіне
<variant> адамның басына
<variant> адамның iшек асқазан органдарына 
<variant> адамның қол-аяғына

<question3> Шаң өзiнiң ұсақтығына байланысты қандай түрлерге бөлiнедi?
<variantright> майдалылығы iрiлеу, орташалау, ұсақтау
<variant> майдалылығы орташалау, ұсақтау, өте ірі
<variant> майдалылығы ұсақтау, орташалау, өте ірі
<variant> майдалылығы iрi, орташалау, төмендеу
<variant> майдалылығы шамалы ірі,өте ірі,төмендеу

<question3> Ұсақтығы сәл iрiлеу шаңдарға қандай шаңдар жатады?
<variantright> өлшемi 10 мкм-ден жоғары
<variant> өлшемi 3 мкм- ден жоғары
<variant> өлшемi 2 мкм- ден жоғары
<variant> өлшемi 1 мкм- ден жоғары
<variant> өлшемі 2,5 мкм-ден жоғары

<question3> Ұсақтығы орташалау шаңдарға қандай шаңдар жатады?
<variantright> өлшемi 10 мкм-ден 5 мкм-ден дейiнгi
<variant> өлшемi 10 мкм-ден жоғары
<variant> өлшемi 12 мкм-ден дейiнгi
<variant> өлшемi 13 мкм-ге дейiнгi
<variant> өлшемi 10,5 мкм-ге дейiнгi

<question3> Ұсақтығы майда шаңдарға қандай шаңдар жатады?
<variantright> өлшемi 5 мкм-ден төмендеу
<variant> өлшемi 6 мкм-ден 7 ге дейiнгi
<variant> өлшемi 6 мкм-ден 8 мкм-ден дейiнгi
<variant> өлшемi 6 мкм-ден 10 мкм-ден дейiнгi
<variant> өлшемi 5,5 мкм-ден төмендеу

<question3> Қауiптiлiгi қай класқа жататын химиялық зиянды заттарға үздiксiз бақылау жүргiзiледi?
<variantright> 1 класқа
<variant> 2 класқа
<variant> 3 класқа
<variant> 3 класқа
<variant> 2,3 класқа

<question3> Қауiптiлiгi қай класқа жататын химиялық зиянды заттарға  бақылау жүргiзiледi?
<variantright> 2,3,4
<variant> 1,2,3
<variant> 5 3,4
<variant> 4,5,6
<variant> 1,4,6

<question3> Тыныс алу мүшелерін қорғау құралдары қандай түрлерге бөлінеді?
<variantright> сүзгілі және оқшауланған
<variant> сүзгілі және шаңнан қорғау
<variant> қорғайтын және жартылай қорғайтын
<variant> жабық және ашық
<variant> көрінетін және көрінбейтін

<question3> Қайталанба нұсқама барлық жұмыскерлермен жүргізеді, тек құрылғыларды жөндеу жұмыстарымен, тексерумен, құрал жабдықтарды қолданумен, сақтаумен, қайта жөндеумен байланысы жоқ жұмысшы тұлғалармен өтпейді. Көрсетілген тұжырымдар МЕСТ сай келе ме?
<variantright> иә, сай келеді
<variant> қайталанба нұсқама ескертусіз барлық жұмыскерлермен жүргізіледі
<variant> барлық категориядағы жұмыскерлер көрсетілмеген
<variant> қайталанба нұсқама кіріспе нұсқамадан өткен барлық жұмыскерлермен жүрізіледі
<variant> қайталанба нұсқама барлық жұмыскерлермен жүргізіледі

<question3> Адам организмiне әсер ету дәрежесiне байланысты ШРЕМ-i 0,1 мг/м3-ден төмен химилық зиянды заттар қауiптiлiгi жағынан қандай класқа жатады?
<variantright> қауiптiлiгi төтенше
<variant> қауiптiлiгi жоғары
<variant> қауiптiлiгi орташалау
<variant> қауiптiлiгi аздау
<variant> қауіптілігі өте жоғары

<question3> Адам организмiне әсер ету дәрежесiне байланысты ШРЕМ-i 0,1 ... 1 мг/м3 аралығындағы химиялық зиянды заттар қауiптiлiгi жағынан қандай класқа жатады?
<variantright> қауiптiлiгi жоғары
<variant> қауiптiлiгi төтенше
<variant> қауiптiлiгi орташалау
<variant> қауiптiлiгi аздау
<variant> қауіптілігі өте жоғары

<question3> Адам организмiне әсер ету дәрежесiне байланысты ШРЕМ-i 1 ... 10 мг/м3 аралығындағы химиялық зиянды заттар қауiптiлiгi жағынан қандай класқа жатады?
<variantright> қауiптiлiгi орташалау
<variant> қауiптiлiгi жоғары
<variant> қауiптiлiгi төтенше
<variant> қауiптiлiгi аздау
<variant> қауіптілігі өте аздау

<question3> Адам организмiне әсер ету дәрежесiне байланысты ШРЕМ-i 10 мг/м3 -тен жоғары химиялық зиянды заттар қауiптiлiгi жағынан қандай класқа жатады?
<variantright> қауiптiлiгi аздау
<variant> қауiптiлiгi орташалау
<variant> қауiптiлiгi төтенше
<variant> қауiптiлiгi жоғары
<variant> қауіптілігі өте төмен

<question3> Жұмыс орындарында ауаның газдылығын қандай прибормен анықтауға болады?
<variantright> газды талдау приборымен
<variant> аспирациялық қондырғымен
<variant> хромотографпен
<variant> интерферометрмен
<variant> гигрометрмен

<question3> Ауа қозғалысының жылдамдығын қандай прибормен өлшеуге болады?
<variantright> анемометрмен
<variant> барометрмен
<variant> актинометрмен
<variant> гигрометрмен
<variant> гигрографпен

<question3> Ауаның салыстырмалы ылғалдылығын қандай прибормен өлшеуге болады?
<variantright> психрометрмен
<variant> актинометрмен
<variant> термографпен
<variant> барометрмен
<variant> барографпен

<question3> Жылу сәулелерiнiң қарқындылығы қандай прибормен өлшенедi?
<variantright> актинометрмен. 
<variant> термометрмен. 
<variant> термопаралармен. 
<variant> датчиктермен. 
<variant> термографпен. 

<question3> Жұмыс жағдайына сай келетін жылудың артықшылығы және жұмыс жағдайына сай келген жылудың аздығы қандай өлшеммен өлшенедi?
<variantright> Дж/м3·сағ
<variant> Кал/м2·сағ
<variant> Ккал/м2·сағ
<variant> Ккал/м3·сағ
<variant> Ккал/м3 сағ

<question3> Тостаған секiлдi анемометрдiң өлшеу шегi қандай:
<variantright> 1 ден 20 м/с-дейін
<variant> 1 ден 15 м/с-дейін
<variant> 1 ден 16 м/с-дейiн
<variant> 1 ден 17 м/с-дейiн
<variant> 1 ден 18 м/с-дейін

<question3> Катотермометр факторы қандай өлшеммен өлшенедi:
<variantright> мкал/см2
<variant> град/м2
<variant> град/см2
<variant> град/м3
<variant> град/см2сағ

<question3> Анероид құралымен ауаның қандай параметрі өлшенедi:
<variantright> атмосфералық ауаның қысымы
<variant> ауаның абсолюттiк ылғалдылығы
<variant> ауа қозғалысының шапшаң жылдамдығы
<variant> ауа қозғалысының аз жылдамдығы
<variant> ауаның максималды ылғалдылығы 

<question3> Ылғалдылықты дәл өлшеу үшiн қандай прибор қолданылады:
<variantright> аспирациялық психрометр
<variant> гигрограф приборы
<variant> гигрометр приборы
<variant> Августа психрометрi
<variant> электрлік психрометр

<question3> Жұмыс орнында өтілетін алғашқы нұсқама мекемеге қабылданған мамандармен, жұмыскерлермен, тәжірибе жұмысымен келген студенттермен, сонымен қатар басқа бөлімге немесе басқа жұмысқа ауысқан жағдайда жүргізіледі. Көрсетілген тұжырымдар МЕСТ сай келе ме?
<variantright> алғашқы нұсқама мамандармен жүргізілмейді
<variant> иә
<variant> жұмыс орнында өтілетін алғашқы нұсқама кіріспе нұсқамадан өткен жұмыскерлерге жүргізілмейді
<variant> барлық категориядағы жұмыскерлер көрсетілген
<variant> жоқ, сай келмейді

<question3> Түнгі уақыттағы жұмыстарға кәмілет жасқа толмағандармен қоса кімдер жіберілмейді?
<variantright> жүкті әйелдер мен мүгедектер
<variant> басшы мен оның орынбасары
<variant> 21 жасқа толмаған әйелдер
<variant> еңбек қорғау инженер
<variant> көп балалы әйелдер мен зейнеткерлер

<question3> Катотермометр құралымен не өлшенеді?
<variantright> ауа қозғалысының кiшкене жылдамдығы
<variant> ауа қозғалысының жылдамдығы 20м/с жоғары
<variant> ауа қозғалысының шапшаң жылдамдығы
<variant> ауа қозғалысының қарқындылығы
<variant> ауа қозғалысының ең төменгі жылдамдығы

<question3> Кәсіпорындардың объектілері мен өндірістерінің санитарлық классификациясына сәйкес, 1 кластағы кәсіпорындар үшін санитарлық қорғау аймақтарының көлемі қандай?
<variantright> 1000 м
<variant> 500 м 
<variant> 300 м
<variant> 100 м
<variant> 50 м

<question3> Люксметр аспабымен жұмыс жағдайының қандай параметірі өлшенеді?
<variantright> жарықтылық
<variant> шаңдану
<variant> ауаның қозғалысы
<variant> температура
<variant> діріл

<question3> Люксметр аспабының өлшем бірлігі?
<variantright> Лк
<variant> Лм
<variant> Лб
<variant> Па
<variant> м/с

<question3> Жұмыс орнындағы жарықтылықты өлшейтін аспаб?
<variantright> Люксметр
<variant> Анемометр
<variant> Анеройд
<variant> Катотермометр
<variant> Сейсмограф

<question3> Ионизациялық сәуле адам организмiне кiре отырып қандай ауруларға әкелуi мүмкiн?
<variantright> сәуле ауруларына
<variant> өкпе ауруларына
<variant> ас қазан ауруына
<variant> терінің зақымдануына
<variant> өкпе бүйрек ауруына
`