export const testingName = `Бұлтты және мобильді технологиялар`;
export const testingStr = `
<question1> Бұлтты сақтауды пайдалану үшін қандай негізгі шарт орындалуы керек?
<variantright> компьютер арқылы Интернетке кіру
<variant> компьютерде Windows амалдық жүйесі болуы керек
<variant> тек Google Chrome браузерін пайдалануыңыз керек
<variant> D дискісінде кемінде 20 Гб бос жадының болуы
<variant> тек Opera браузерін пайдалануыңыз керек

<question1> Бұлтты технологияны қолданудың артықшылығы неде?
<variantright> планетаның кез-келген нүктесінен кез-келген уақытта деректерді басқару мүмкіндігі
<variant> қашықтағы серверде сақтау құпиялылықты бұзу тәуекелінің болуын болжайды
<variant> қызмет көрсететін провайдерге тәуелділік
<variant> сақталатын ақпараттың қауіпсіздігі
<variant> сақталатын ақпараттың жойылуы

<question1> Бұлтты технологияның кемшілігі?
<variantright> ақпаратты сақтаудағы тәуекел
<variant> кейбір қызметтерді тегін пайдалану
<variant> интернет болған жағдайдағы қолжетімділік
<variant> шексіз масштабтау мүмкіндігінің болуы
<variant> интернетке қосылу құны төмен болуы

<question1> Бұлттардың моделі қайсысы?
<variantright> PaaS, IaaS, SaaS
<variant> PaaS, SaaS IaaS, SaaS
<variant> SaaS, IaaS, XaaS
<variant> IaaS, XaaS, SaaS
<variant> XaaS, SaaS, PaaS

<question1> SaaS бұлт моделінің басты ерекшелігі:
<variantright> белгілі бір бағдарламалар жиынтығымен жұмыс істеу
<variant> өз індеттеріне бұлтты орнату
<variant> бұлттағы әртүрлі байланыс құралдарын ұсыну
<variant> сервистер түрінде есептеу ресурстарын ұсыну
<variant> серверлермен жұмыс кезінде қауіпсіздікті қамтамасыз ету жөніндегі қызметтер

<question1> Дәстүрлі бұлт технологиясының қайсысы браузер поштасының аналогы болып табылады (Mail.ru, Yandex.ru және т. б.) 
<variantright> Mocrisoft Outlook 
<variant> Microsoft Publisher
<variant> Microsoft Word
<variant> Microsoft Excel
<variant> Microsoft Live

<question1> Болашақ тенденцияларды немесе мінез-құлықты болжау үшін есептеу жүйелері арқылы ретроспективті деректерді іздеу қалай аталады? 
<variantright> машиналық оқыту 
<variant> нейрондық оқыту
<variant> гибридті оқыту
<variant> бұлтты есептеу
<variant> дәстүрлі оқыту

<question1> Azure-ге жеке желілердің арнайы талшықты қосылыстары қалай аталады? 
<variantright> ExpressRoute 
<variant> FastRoute
<variant> MicroRoute
<variant> EthernetRoute
<variant> MacroRoute

<question1> Мазмұнды пайдаланушыларға Azure-де таратылған деректер орталықтарының сенімді желісінде жеткізу
<variantright> кэштеу серверлер желісі
<variant> оқиғалар хабтарының желісі
<variant> резервтік серверлер желісі
<variant> теңгерімдеуші серверлер желісі
<variant> негізгі серверлер желісі

<question1> Түйіннің операциялық жүйесінің файлдық жүйесінде файл ретінде сақталатын виртуалды машиналардың дискілік бөлімдері:
<variantright> виртуалды дискілер
<variant> бұлтты дискілер
<variant> жеке дискілер
<variant> қоғамдық дискілер
<variant> контейнерлік дискілер

<question1> Пайдаланушылар мен топтарды басқарудың сенімді мүмкіндіктерін қамтамасыз ететін және Office 365 сияқты Microsoft Online Services қызметтерін және SaaS үшінші тарап қосымшаларын қоса алғанда, қосымшаларға қауіпсіз қол жетімділікті қамтамасыз ететін бұлтты сәйкестендіру және қол жеткізуді басқару шешімі?
<variantright> Azure Active Directory
<variant> Azure DocumentDB
<variant> Azure HDInsight
<variant> AppDynamics
<variant> Azure DB

<question1>  Бұлтты есептеу стандарттарын және олардың үйлесімділігін қай ұйым жасайды? 
<variantright>  Open Cloud Consortium 
<variant> Closed Cloud Consortium
<variant>  Internet Cloud Consortium
<variant> World Cloud Consortium
<variant>  Country Cloud Consortium

<question1> Жеке операциялық жүйе (ОЖ) – бұл қолданушыларға қосымшаларды физикалық компьютерде жұмыс істей тұрғандай орындауға мүмкіндік беретін оқшауланған бағдарламалық контейнер. Мұндай жүйе қалай аталады? 
<variantright> виртуалды машина
<variant> виртуализация
<variant> хосттың операциялық жүйесі
<variant> виртуалды машина эмуляторы
<variant> хост виртуализациясы

<question1> Нақты жабдыққа орнатылған операциялық жүйе қалай аталады? Осы операциялық жүйенің бөлігі ретінде виртуализация бағдарламалық жасақтамасы әдеттегі қосымша ретінде орнатылады. 
<variantright> хосттың операциялық жүйесі
<variant> виртуалды машина
<variant> виртуализация
<variant> виртуалды машина эмуляторы
<variant> хост виртуализациясы

<question1> Хосттың операциялық жүйесіне орнатылған және VM мониторынан және графикалық қабықтан тұратын бағдарламалық жасақтама
<variantright> виртуалды машина эмуляторы 
<variant> виртуалды машина
<variant> виртуализация
<variant> хосттың операциялық жүйесі
<variant> хост виртуализациясы

<question1> Есептеу ресурстарының абстракциясы және қолданушыға өзінің іске асырылуын «инкапсуляциялайтын» (жасыратын) жүйені ұсыну – бұл
<variantright> виртуализация 
<variant> виртуалды машина 
<variant> хосттың операциялық жүйесі
<variant> виртуалды машина эмуляторы
<variant> хост виртуализациясы

<question1> Құрылған виртуалды машинаға орнатылған операциялық жүйе
<variantright> қонақ операциялық жүйесі 
<variant> хосттың операциялық жүйесі
<variant> виртуалды машина эмуляторы
<variant> хост виртуализациясы
<variant> қонақ виртуализациясы

<question1> Ресурстарды жеке бөліктерге логикалық бөлуге негізделген Виртуализация деп аталады: 
<variantright> домендік 
<variant> қонақ бөлмесі
<variant> хост
<variant> қызмет көрсету
<variant> эмуляторлық

<question1> Қонақ ОЖ ядросын модификациялау басқа виртуалды машиналармен қақтығыспай, аппаратурамен тікелей жұмыс істей алатын жаңа API жиынтығын қамтитын тәсіл деп аталады. 
<variantright> паравиртуализация
<variant> толық виртуалдау
<variant> монолитті
<variant> ішінара виртуалдау
<variant> эмуляторлық виртуализация

<question1> Қонақ операциялық жүйелерінің өзгертілмеген даналарын қолданатын тәсіл, бірақ осы ОЖ-нің жұмысын қолдау үшін әдеттегі операциялық жүйе ретінде әрекет ететін хост ОЖ-нің үстіне олардың орындалуын эмуляциялаудың жалпы қабаты деп аталады
<variantright> толық виртуализация 
<variant> паравиртуализация
<variant> монолитті
<variant> эмуляторлық виртуализация
<variant> ішінара виртуалдау

<question1> Бағдарламалық эмуляцияның қандай түрін қолданған кезде нұсқаулар түсіндіріледі және нақты процессор қабылдаған нұсқауларға айналады?
<variantright> толық эмуляциялық нұсқаулар
<variant> нұсқаулықтарды іріктеп эмуляциялау
<variant> API эмуляциясы
<variant> ішінара виртуалдау
<variant> монолитті нұсқаулар

<question1> Қандай виртуализация параллель жұмыс істейтін тәуелсіз жұмыс ортасын құру үшін бір хост ОЖ ядросын қолдануды білдіреді?
<variantright> ОЖ ядросы деңгейінде виртуализация
<variant> Желіні виртуализациялау
<variant> Қосымшаларды виртуализациялау
<variant> Көріністерді виртуализациялау
<variant> Мәтіндерді виртуализациялау

<question1> Физикалық желіні бағдарламалық әдіспен толық іске асыру
<variantright> Желіні виртуализациялау
<variant> ОЖ ядросы деңгейіндегі виртуализация
<variant> Қосымшаларды виртуализациялау
<variant> Көріністерді виртуализациялау
<variant> Мәтіндерді виртуализациялау

<question1> Қандай виртуализация қосымшалардың әрбір данасы, оның барлық негізгі компоненттері: файлдар (соның ішінде жүйелер), тізілім, қаріптер, INI файлдары, COM нысандары, қызметтері виртуализацияланатын ОЖ-мен басқарылатын өзара әрекеттесуі бар қолданбалы оқшаулау моделін қолдануды білдіреді?
<variantright> Қосымшаларды виртуализациялау
<variant> ОЖ ядросы деңгейіндегі виртуализация
<variant> Желіні виртуализациялау
<variant> Көріністерді виртуализациялау
<variant> Мәтіндерді виртуализациялау

<question1> Қандай виртуализация пайдаланушы интерфейсін эмуляциялауды білдіреді, яғни пайдаланушы қосымшаны көреді және онымен терминалда жұмыс істейді? 
<variantright> Көріністерді виртуализациялау
<variant> ОЖ ядросы деңгейіндегі виртуализация
<variant> Желіні виртуализациялау
<variant> Қосымшаларды виртуализациялау
<variant> Мәтіндерді виртуализациялау

<question1> Қашықтағы жұмыс үстелімен және виртуализациямен қосылыстардың үйлесімі
<variantright> Virtual Desktop Infrastructure (VDI)
<variant> Nvidia GRID технологиясы
<variant> Amazon WorkSpace
<variant> DaaS Қызметі
<variant> DotGNU Технологиясы

<question1> GPU виртуализациясы, қашықтан қол жеткізу және сеансты басқару шешімі, бұл бірнеше пайдаланушыларға GPU ортақ ресурстарын қолдана отырып, графикалық бағдарламалармен бір уақытта жұмыс істеуге мүмкіндік береді
<variantright> Nvidia GRID технологиясы
<variant> Virtual Desktop Infrastructure (VDI)
<variant> Amazon WorkSpace
<variant> DaaS Қызметі
<variant> DotGNU Технологиясы

<question1> Физикалық сақтау ресурстары үшін абстракция деңгейін қалыптастыратын және виртуалды ортада оларды бағыттауды, оңтайландыруды және басқаруды қолдайтын мүмкіндіктердің үйлесімі
<variantright> сақтау виртуализациясы
<variant> желіні виртуализациялау
<variant> қосымшаларды виртуализациялау
<variant> көріністерді виртуализациялау
<variant> мәтіндерді виртуализациялау

<question1> Серверлердің, қоймалардың және желілердің ресурстарын жан-жақты виртуализациялауды, оларды біріктіруді және қосымшаларға сұраныс бойынша және бизнестің басымдықтарына сәйкес дәл бөлуді қамтамасыз ететін компоненттер
<variantright> Инфрақұрылым қызметтері
<variant> Қосымшалар қызметтері
<variant> NVIDIA GRID технологиясы
<variant> DaaS қызметі
<variant> DotGNU технологиясы

<question1> VSphere платформасындағы барлық қосымшаларға, олардың түріне немесе ОЖ-ге қарамастан, қызмет көрсету деңгейлерін басқаруды қамтамасыз ететін компоненттер</question1>
<variantright> Қолданба қызметтері
<variant> Инфрақұрылым қызметтері
<variant> NVIDIA GRID технологиясы
<variant> DaaS қызметі
<variant> DotGNU технологиясы

<question1> Гипервизорды ядро, құрылғы драйверлері және енгізу/шығару стегі сияқты компоненттерді қамтитын бір деңгейде қандай тәсіл орналастырады
<variantright> монолитті
<variant> микроядролық
<variant> көп ядролы
<variant> эмуляторлық
<variant> командалық

<question1> Бөлімдерді оқшаулау мен жадты басқарудың негізгі міндеттерін ғана орындайтын өте жұқа, мамандандырылған гипервизор қандай тәсілді қолданады?
<variantright> микроядролық
<variant> монолитті
<variant> көп ядролы
<variant> командалық
<variant> эмуляторлық

<question1> Төмен деңгейлі ресурстарға (деректер қоймасы, есептеу құрылғылары және желіге қол жеткізуді ұсынатын бұлтты есептеу қызметтерін пайдалану моделі деп аталады
<variantright> Инфрақұрылым қызмет ретінде
<variant> Платформа қызмет ретінде
<variant> Қосымша қызмет ретінде
<variant> Декомпилятор
<variant> Желі қызмет ретінде

<question1> Қосымшаға «бұлттар»жағдайында жұмыс істеу мүмкіндігін қамтамасыз ететін қолданбалы бағдарламалық интерфейс. Бағдарлама іс жүзінде бұлтты есептеу провайдері ұсынатын мамандандырылған операциялық жүйенің басқаруымен жұмыс істейді.
<variantright> Платформа қызмет ретінде
<variant> Инфрақұрылым қызмет ретінде
<variant> Қосымша қызмет ретінде
<variant> Желі қызмет ретінде
<variant> Эмулятор қызмет ретінде

<question1> Бұлтты қызмет провайдері белгілі бір қосымшаның ішінде барлық бизнес логикасын жүзеге асыратын бұлтты есептеу қызметтерін пайдалану моделі деп аталады
<variantright> Қосымша қызмет ретінде
<variant> Инфрақұрылым қызмет ретінде
<variant> Платформа қызмет ретінде
<variant> Қызмет ретінде эмулятор
<variant> Желі қызмет ретінде

<question1> Өзара әрекеттесу моделі нақты анықталған интерфейстерді қолдана отырып, қосымшалардың (қызметтердің) әртүрлі функционалды модульдерін бір-бірімен байланыстыратын компонент болып табылады
<variantright> Сервиске бағытталған сәулет
<variant> Virtual Desktop Infrastructure (VDI) 
<variant> NVIDIA GRID технологиясы
<variant> DaaS қызметі
<variant> SaaS қызметі

<question1> Платформа қызмет ретінде
<variantright> PaaS моделі
<variant> SaaS моделі
<variant> IaaS моделі
<variant> DaaS қызметі
<variant> xaas моделі

<question1> Инфрақұрылым қызмет ретінде
<variantright> IaaS моделі
<variant> PaaS моделі
<variant> SaaS моделі
<variant> DaaS қызметі
<variant> xaas моделі

<question1> Бағдарламалық жасақтама қызмет ретінде
<variantright> SaaS моделі
<variant> PaaS моделі
<variant> IaaS моделі
<variant> DaaS қызметі
<variant> xaas моделі

<question1> Виртуалды бұлттың төрт түрі бар. Ұсынылған түрлердің қайсысы жоқ екенін анықтаңыз
<variantright> жүйелік
<variant> гибридті
<variant> публикалық
<variant> қоғамдық
<variant> корпоративтік

<question1> Жеке бұлт
<variantright> ұйымның меншігі
<variant> жүйелік бұлт
<variant> корпоративтік ұйымдар құрылымдарының бірі
<variant> бірнеше компаниялар басқарады
<variant> виртуалды бұлт

<question1> Ең көп қолданылатын бұлтты сақтау орындарының бірі
<variantright> Google Drive
<variant> Яндекс.Диск
<variant> Dropbox
<variant> Mega
<variant> OneDrive

<question1> Қоғамдық бұлт
<variantright> бірнеше ұйымдар арасында бөлінеді
<variant> барлық басқару құқықтары пайдаланушыларға тиесілі
<variant> әрқашан ақылы
<variant> деректерді берудің үлкен жылдамдығы
<variant> тегін

<question1> Білім беруде бұлтты технологияларды қолдану мысалы
<variantright> қашықтық олимпиадалар
<variant> брокерлік биржадағы валюта саудасы
<variant> тауарларды интернет-дүкен арқылы сатып алу
<variant> пациенттерді қашықтықтан диагностикалау
<variant> сайттарды брондау

<question1> Бұлтты технологияның кемшілігі
<variantright> бұл деректер қоймасы, зиянкестер деректерді рұхратсыз иеленеді 
<variant> жұмысқа қажетті құралдарды веб-сервис автоматты түрде ұсынады
<variant> барлық ақпарат кез келген құрылғыдан қол жетімді
<variant> сервистер оларды пайдалану қажеттілігіне қарай ғана төленеді
<variant> сайттарды брондау

<question1> Бұлтты сақтауға қойылатын негізгі талаптардың бірі
<variantright> сенімділік
<variant> мәні
<variant> өзектілігі
<variant> нәтижелілік
<variant> төзімділік

<question1> Бағдарлама провайдерде немесе үшінші тарапта орналасқан және клиенттерге жазылым арқылы қол жетімді болатын бағдарламалық жасақтаманы жеткізудің бизнес моделі қалай аталады? 
<variantright> SaaS
<variant> DaaS
<variant> IaaS
<variant> PaaS
<variant> XaaS

<question1> Қосымша Коммуналдық деп аталады, егер…
<variantright> оны бірнеше клиент пайдаланған жағдайда
<variant> ол тегін болғанда
<variant> онда жарнама бар болған жағдайда
<variant> қосымшаны техникалық қолдау төлемге кіргенде
<variant> сенімді болған жағдайда

<question1> Бағдарламалық жасақтаманы тарату және пайдалану моделі қалай аталады, онда тұтынушы кез-келген платформадан, соның ішінде мобильді құрылғылар мен планшеттік компьютерлерден, сондай-ақ кез-келген шолғыш арқылы жұмыс үстеліне мобильді қол жеткізу үшін төлейді?
<variantright> DaaS
<variant> SaaS
<variant> IaaS
<variant> PaaS
<variant> XaaS

<question1> Бұлтты есептеу тұжырымдамасына негізделген қызметтер ретінде компьютерлік инфрақұрылымды (әдетте виртуализация түрінде) ұсынудың бизнес моделі қалай аталады?
<variantright> IaaS
<variant> SaaS
<variant> DaaS
<variant> PaaS
<variant> XaaS

<question1> Компания орналастырылған ортаны өзінің ақпараттық орталығының логикалық кеңеюі ретінде пайдаланатын дәстүрлі хостингтің аналогы қандай модель болып табылады?
<variantright> IaaS
<variant> SaaS
<variant> DaaS
<variant> PaaS
<variant> XaaS

<question1> IaaS моделіндегі бұлттың негізгі физикалық және виртуалды инфрақұрылымын кім басқарады және бақылайды? 
<variantright> Бұлтты провайдер
<variant> Бұлтты қызметтерді тұтынушы
<variant> XaaS
<variant> IaaS
<variant> PaaS

<question1> PaaS моделіндегі бұлттың негізгі физикалық және виртуалды инфрақұрылымын кім басқарады және бақылайды?
<variantright> Бұлтты провайдер
<variant> Бұлтты қызметтерді тұтынушы
<variant> IaaS
<variant> PaaS
<variant> XaaS

<question1> Егер компания басшылығы қазіргі компьютерлік Инфрақұрылым негізгі қызметті жүзеге асыру үшін жеткіліксіз екенін түсінсе, бұлтты қызметтердің қандай түріне жүгінеді? 
<variantright> IaaS
<variant> SaaS
<variant> DaaS
<variant> PaaS
<variant> XaaS

<question1> Тұтынушыға жаңа немесе қолданыстағы қосымшаларды кейіннен орналастыру үшін негізгі бағдарламалық жасақтаманы орналастыру үшін бұлтты инфрақұрылымды пайдалану мүмкіндігі берілген бұлтты қызмет түрі қалай аталады?
<variantright> PaaS
<variant> SaaS
<variant> DaaS
<variant> IaaS
<variant> XaaS

<question1> Стандартты емес бағдарламалық жасақтаманы (ескірген, мамандандырылған, өзіндік бағдарламалық жасақтаманы және тапсырыс бойынша жасалған) пайдаланатын компания бұлтты қызметтердің қандай түріне жүгінеді?
<variantright> PaaS
<variant> SaaS
<variant> DaaS
<variant> IaaS
<variant> XaaS

<question1> Тұтынушы әзірлеушілерге өздерінің бұлтты қосымшалары мен қызметтерін жобалау, құру және орналастыру үшін толық орта беретін бұлтты қызметке қол жеткізген кезде бұлтты қызмет түрі қалай аталады?
<variantright> aPaaS
<variant> aSaaS
<variant> aDaaS
<variant> aIaaS
<variant> aXaaS

<question1> Өз клиенттеріне ұсынатын бұлтты қызметтердің түрі қалай аталады бұлтты қолдау олардың инфрақұрылымы?
<variantright> DaaS
<variant> RaaS
<variant> IaaS
<variant> PaaS
<variant> XaaS

<question1> Dropbox бұлтты қызметі не үшін қажет
<variantright> деректерді сақтау үшін
<variant> қосымшаларды әзірлеу үшін
<variant> құжаттармен бірлесіп жұмыс істеу үшін
<variant> істен шыққан жағдайда қалпына келтіру үшін
<variant> сайттарды әзірлеу үшін

<question1> WoMM принциптеріне негізделген маркетингтік стратегия дегеніміз не?
<variantright> сарафанды радио
<variant> жарнаманың ең көп саны
<variant> тартылған клиенттің бағасын барынша азайту
<variant> бәсекелестердегі ұқсас қызметтердің кемшіліктеріне назар аудару
<variant> шектеулерге назар аударуды азайту

<question1> Мобильді қосымшалардың жақсарту мен IT өнімдерінің жақсартудың басты айырмашылығы неде?
<variantright> қолдану арнасының ерекшелігі
<variant> клиенттік базаның айырмашылықтары
<variant> жарнама бағасындағы айырмашылық
<variant> мобильді құрылғылардың функционалдық ерекшеліктерімен қойылатын шектеулер
<variant> виртуалды базаның айырмашылықтары

<question1> Егер бағдарламаны жасаушы «бөлісу» белгішесін орналастырса, қандай жақсарту әдісін қолданады?
<variantright> WoM-маркетинг
<variant> Шолу
<variant> Мобильді қосымшалардың жарнамалық желісі
<variant> QR коды
<variant> Іске асыру

<question1> Жақсарту әдісі ретінде мобильді қосымшалардың жарнамалық желісінің басты кемшілігі неде?
<variantright> жарнаманы таргеттеудің күрделілігі
<variant> басқа қосымшадағы жарнаманың жоғары бағасы
<variant> қосымшада жарнаманың болуы пайдаланушылардың оған деген қызығушылығын күрт төмендетеді
<variant> мобильді құрылғының кішкентай экраны көбінесе жарнамалық ақпаратты қабылдауға мүмкіндік бермейді
<variant> барлық нұсқалар дұрыс

<question1> Жарнаманы көргеннен кейін қосымшаны қанша адам орнатқанын көрсететін метрика қалай аталады?
<variantright> конверсия
<variant> диверсия
<variant> регрессия
<variant> виралдылық
<variant> реверсия

<question1> Бағдарлама туралы таныстарына қанша қолданушы айтқанын көрсететін метрика қалай аталады?
<variantright> виральность
<variant> диверсия
<variant> айырбастау
<variant> регрессия
<variant> реверсия

<question1> Retention көрсеткіші нені көрсетеді?
<variantright> қанша пайдаланушы бағдарламаға қайта оралды
<variant> жарнаманы көргеннен кейін қосымшаны қанша қолданушы жүктеді
<variant> қолданба ішінде қанша пайдаланушы сатып алды
<variant> достарыңызға қолданба туралы қанша қолданушы айтты
<variant> қосымшаны қанша қолданушы жүктеді

<question1> Бұлтты технологияның ерекшеліктерін бөлектеңіз:
<variantright> шығындарды азайту
<variant> операциялық тәуекелдердің ұлғаюы
<variant> бөлу
<variant> осалдық
<variant> теңгерімділік

<question1> Бұлттық технологиялар негізінде қосымшаларды әзірлеу мен іске қосуға арналған қызмет қалай аталады?
<variantright> Windows Azure
<variant> MS OneDrive
<variant> Google Docs
<variant> MS Office 365
<variant> Google Drive

<question1> Бұлтта қосымшаларды әзірлеуге және орындауға арналған бұлтты негізделген қызметті атаңыз?
<variantright> Amazon Web Service
<variant> MS OneDrive
<variant> MS Office 365
<variant> Google Drive
<variant> Dropbox

<question1> Ұялы телефондарға арналған операциялық жүйелер арасында кім көшбасшы? 
<variantright> Android
<variant> iOS
<variant> Windows Phone
<variant> BlackBerry
<variant> Symbian

<question1> Планшеттерге арналған операциялық жүйелер арасында кім көшбасшы? 
<variantright> Android
<variant> iOS
<variant> Windows Phone
<variant> BlackBerry
<variant> Symbian

<question1> Google Play қолданбалар дүкенінің ерекшелігі неде? 
<variantright> қолданбалардың алдын ала модерациясы жоқ
<variant> әрбір пайдаланушы қосымшаны жүктегеннен кейін пікір қалдыруға міндетті
<variant> барлық қосымшалар ақылы
<variant> барлық қосымшалар тегін
<variant> қолданбаларды кез келген әзірлеуші жариялай алады

<question1> Мобильді құрылғылар нарығында қай қолданбалар дүкені көшбасшы болып табылады? 
<variantright> App Store
<variant> Google Play
<variant> Windows Phone Store
<variant> Amazon App
<variant> Google

<question1> Сақтау үшін хабарлама кезегін қабылдайтын Веб-қызмет: 
<variantright> Amazon Simple Queue Service
<variant> ColdFusion
<variant> DotGNU
<variant> GlassFish
<variant> Google App Engine

<question1> Amazon S3 Веб-қызметі: 
<variantright> пайдаланушыларға кез-келген уақытта, кез-келген жерде Интернет арқылы деректердің кез-келген көлемін сақтауға және қалпына келтіруге мүмкіндік беретін интерфейсті ұсынады
<variant> пайдаланушыларға кез-келген уақытта, кез-келген жерде интернет арқылы деректердің кез-келген көлемін жасауға мүмкіндік беретін интерфейсті ұсынады
<variant> пайдаланушыларға күндізгі уақытта Интернет арқылы деректердің белгілі бір көлемін ғана сақтауға және қалпына келтіруге мүмкіндік беретін интерфейсті қамтамасыз етеді
<variant> пайдаланушыларға кез-келген уақытта Интернет арқылы деректердің кез-келген көлемін өңдеуге мүмкіндік беретін интерфейсті ұсынады
<variant> Пайдаланушыларға Интернет арқылы деректердің аз мөлшерін өңдеуге мүмкіндік беретін интерфейсті ұсынады

<question1> VMware View Платформасы:
<variantright> vSphetre платформасындағы виртуалды машиналарда пайдаланушы жұмыс станцияларын орталықтандыруды қамтамасыз ететін өнімдер кешені
<variant> Citrix XenServer платформасындағы виртуалды машиналарда пайдаланушы жұмыс станцияларын орталықтандыруды қамтамасыз ететін өнімдер кешені
<variant> VirtualBox платформасындағы виртуалды машиналарда пайдаланушы жұмыс станцияларын орталықтандыруды қамтамасыз ететін өнімдер кешені
<variant> Oracle платформасындағы виртуалды машиналарда пайдаланушы жұмыс станцияларын орталықтандыруды қамтамасыз ететін өнімдер жиынтығы
<variant> ColdFusion платформасындағы виртуалды машиналарда пайдаланушы жұмыс станцияларын орталықтандыруды қамтамасыз ететін өнімдер кешені

<question1> Бұл функциялардың қайсысы «бағыттау және қашықтан қол жеткізу»консолінен конфигурацияланбайды
<variantright> Active Directory
<variant> Қашықтан қол жеткізу
<variant> Пакеттерді сүзу
<variant> Интернетке ортақ пайдалану
<variant> Бұлтқа қол жеткізу

<question1> Аты аңызға айналған Megaupload негізін қалаушы Ким доткомның бұлтты файл алмасу құралы
<variantright> Mega
<variant> Copy
<variant> Bitcasa
<variant> Yunpan 360
<variant> iCloud

<question1> Windows Azure Web Sites-те веб-сайтты орналастыруға болатын бұлтты сақтау қызметі қалай аталады? 
<variantright> DropBox
<variant> OneDrive
<variant> Git
<variant> iCloud
<variant> Bitcasa

<question1> Windows Azure Web Sites-те қандай орналастыру опцияларына қолдау көрсетіледі? 
<variantright> Web Deploy, FTP, Git, TFS, DropBox, Mercurial
<variant> Web Deploy, FTP, TFS, TeamCity, Mercurial
<variant> TFS, Web Deploy, Git, SMB, FTP
<variant> FTP, TFS, TeamCity
<variant> Git, SMB, FTP

<question1> Windows Azure Web Sites-те қандай орналастыру опцияларына қолдау көрсетіледі? 
<variantright> Web Deploy
<variant> DropBox
<variant> TeamCity
<variant> HTTP
<variant> VPN

<question1> Windows Azure Web Sites үш режимде жұмыс істей алады: тегін, ортақ және стандартты. Автоматты масштабтауды қандай режимде жүргізуге болады?
<variantright> Standard
<variant> Shared
<variant> Free
<variant> Ортақ және стандартты
<variant> Ортақ, еркін және стандартты

<question1> Windows Azure Web Sites үш режимде жұмыс істей алады: тегін, Жалпы және стандартты. Автоматты масштабтауды қандай режимде жүргізуге болады?
<variantright> Standard
<variant> Shared
<variant> Free
<variant> Common
<variant> Тегін және жалпы

<question1> Жеке домен атауын веб-сайтқа қай режимде қосуға болады?
<variantright> Shared, Standard
<variant> Free, Shared, Standard
<variant> Standard
<variant> Free
<variant> Өзіңіздің домен атыңызды веб-сайтқа байланыстыра алмайсыз

<question1> Жеке домен атауын веб-сайтқа қай режимде қосуға болады?
<variantright> Shared
<variant> Free, Shared, Standard
<variant> Тегін және жалпы
<variant> Common
<variant> Өзіңіздің домен атыңызды веб-сайтқа байланыстыра алмайсыз

<question1> Windows Azure Web Sites қандай модельді жүзеге асырады?
<variantright> PaaS элементтері бар SaaS
<variant> PaaS
<variant> IaaS
<variant> XaaS
<variant> SaaS

<question1> Windows Azure Web Sites қандай модельді жүзеге асырады?
<variantright> SaaS
<variant> XaaS
<variant> IaaS
<variant> PaaS
<variant> IaaS элементтері бар PaaS

<question1> Windows Azure Web Sites-те WordPress блогын қандай жағдайда орналастыруға болады?
<variantright> WordPress блогы опциясында қол жетімді
<variant> WordPress әзірлеушілерімен келісім болған жағдайда
<variant> Бұрыннан бар блогта
<variant> Windows Azure-де WordPress-ті кеңейту мүмкін емес
<variant> Windows Azure Web Sites әзірлеушілерімен келісім болған жағдайда

<question1> Ірі компанияларда сервистерді жеткізу инфрақұрылымын оңтайландыру мақсатында қосымшаларды виртуалдандыруға және жариялауға арналған Платформа:
<variantright> Citrix XenApp
<variant> Oracle VM
<variant> VMware Player
<variant> VirtualBox
<variant> VMware ESXi

<question1> Worker рөліне өзіңіздің бағдарламалық жасақтамаңызды қалай орнатуға болады? 
<variantright> RDP және Startup-тапсырмаларды қосу арқылы
<variant> Powershell сценарийлерінің көмегімен
<variant> Perl сценарийлері арқылы
<variant> JavaScript көмегімен
<variant> Python көмегімен

<question1> Конфигурация файлдары мен қызмет анықтамалары қандай рөл атқарады?
<variantright> қызметті анықтау файлында рөлдердің сипаттамасы, оларға кіру нүктелері және көрсетілген мәндерсіз конфигурация параметрлері бар
<variant> қызметті анықтау файлында әртүрлі параметрлер үшін тікелей мәндер бар
<variant> қызмет файлында рөлдер мен олардың қатысу нүктелері сипатталған, бірақ параметр мәндері бос 
<variant> сервисті анықтау файлында көрсетілген мәндерсіз сервер параметрлері бар
<variant> қызметті анықтау файлында анықтау файлында анықталған параметрлер үшін мәндер бар

<question1> Физикалық серверлерді көптеген виртуалды машиналарға бөлетін Гипервизор:
<variantright> VMware ESX Server
<variant> Citrix XenApp
<variant> Oracle VM
<variant> VMware Player
<variant> VirtualBox

<question1> Windows Azure Access Control Service жүйесінде қандай провайдерлерге қолдау көрсетіледі?
<variantright> Live ID, Facebook, Google, Twitter, Custom
<variant> Live ID, Facebook, Card
<variant> Live ID, Google, Custom, Wordpress
<variant> Live ID, Card
<variant> Live ID, Wordpress

<question1> Service Bus-та қандай компоненттер бар?
<variantright> Notification Hub
<variant> Notification Services
<variant> Push Notifications
<variant> Integration Tool
<variant> Service Bus Integration Pack

<question1> Гипервизорды жүзеге асыруға монолитті тәсілдің ерекшеліктері:
<variantright> драйверлер мен стекті пайдалану
<variant> түрлі CorrelationID орнату
<variant> кепілді жеткізуді пайдалану
<variant> сүзгілерді пайдалану
<variant> транзакцияларды пайдалану

<question1> VMware Ace Платформасы:
<variantright> Қорғалған виртуалды машиналарды құруға арналған өнім
<variant> Azure-де есептеулерді басқаруға арналған компонент
<variant> Microsoft деректер орталығының компьютері
<variant> Мәліметтер базасын басқаруға арналған Azure компоненті
<variant> Жадты басқаруға арналған Azure компоненті

<question1> Паравиртуализацияны жүзеге асыру ерекшеліктері:
<variantright> ОЖ ядросының модификациясы оған жаңа API жиынтығын қосу 
<variant> Сұранысты жеткізу үшін корпоративтік брандмауэрден өту
<variant> Хабарламаларды жеткізу
<variant> Бірнеше аймақтық кеңселерге әртүрлі хабарламаларды жеткізу
<variant> Жүктемені теңгеру және істен шығуға төзімділікті қамтамасыз ету

<question1> Паравиртуализацияны жүзеге асыру ерекшеліктері:
<variantright> хост функцияларын арнайы гипервизор жүйесі орындайды
<variant> үлкен файлдарды бірнеше аймақтық кеңселерге жіберу
<variant> транзакцияларды пайдалану
<variant> хабарламалардың телнұсқаларын Автоматты анықтауды пайдалану
<variant> жазылушыларға хабарламаларды жеткізу

<question1> SAN деректерді сақтау желісінің каскадты құрылымы
<variantright> Ұяшықтар жиынтығы
<variant> Виртуалды машина
<variant> Azure әзірлеушісінің рөлі
<variant> Web-қосымша
<variant> Тәуелсіз процесс

<question1> SAN деректерді сақтау топологиясы желінің максималды байланысын қамтамасыз етеді:
<variantright> тор
<variant> клетчатка
<variant> өрнекті
<variant> сызықтық
<variant> қисық

<question2> San жоғары жылдамдықты коммутацияланған деректерді сақтау желісі деректермен алмасу протоколын қолданады:
<variantright> Fibre Channel
<variant> Queue
<variant> Topic
<variant> Relay
<variant> Notification Hub

<question2> Деректерді сақтау жүйесі:
<variantright> ақпараттық ресурстарды сенімді сақтауды ұйымдастыру жөніндегі бағдарламалық-аппараттық шешім
<variant> жергілікті желілердегі желілік трафикті бақылау компоненті
<variant> процесс атрибуты; сүзгілерді пайдалану
<variant> Azure дамуындағы Web рөлі
<variant> транзакцияларды пайдалану; сүзгілерді пайдалану; кепілдендірілген жеткізуді пайдалану; әртүрлі CorrelationID орнату

<question2> Mosso компаниясының PaaS технологиясының қай өнімі серверлік ОЖ таңдау мүмкіндігімен бір сағаттық серверді жалға береді:
<variantright> Cloud Servers
<variant> Nero Burning ROM
<variant> Ashampoo Burning Studio
<variant> AOMEI Backupper
<variant> Handy Backup

<question2> SaaS қолданбасын орналастыру моделі:
<variantright> лицензияланбаған бағдарламалық жасақтаманы тиімді пайдалануға мүмкіндік береді
<variant> бұл компьютерлік инфрақұрылымды қамтамасыз ету (әдетте виртуализация түрінде) 
<variant> веб-қосымшаларды әзірлеу, тестілеу, орналастыру және қолдау үшін интеграцияланған платформаны ұсыну
<variant> бағдарламалық жасақтаманы сату моделі, онда жеткізуші веб-қосымшаны жасайды және тапсырыс берушілерге интернет арқылы Бағдарламалық жасақтамаға қол жеткізуге мүмкіндік береді
<variant> жеткізуші өзі басқаратын бағдарламалық жасақтаманы сату моделі

<question2> SaaS қолданбасын орналастыру моделі:
<variantright> соңғы пайдаланушыға сұраныс бойынша қызмет ретінде қосымшаны ұсынуды білдіреді
<variant> бұл компьютерлік инфрақұрылымды қамтамасыз ету (әдетте виртуализация түрінде) 
<variant> веб-қосымшаларды әзірлеу, тестілеу, орналастыру және қолдау үшін интеграцияланған платформаны ұсыну
<variant> бағдарламалық жасақтаманы сату моделі, онда жеткізуші веб-қосымшаны жасайды және тапсырыс берушілерге интернет арқылы Бағдарламалық жасақтамаға қол жеткізуге мүмкіндік береді
<variant> компьютерлік Инфрақұрылым

<question2> Mosso компаниясының PaaS технологиясының қандай өнімі сақталатын файлдардың көлемі үшін ай сайынғы погигабайт төлемі бар Cloud-хостинг қызметін ұсынады:
<variantright> Cloud Files
<variant> Nero Burning ROM
<variant> Ashampoo Burning Studio
<variant> AOMEI Backupper
<variant> Handy Backup

<question2> Тапсырыс беруші де, қызмет жеткізушісі де болып табылатын бір компанияның ішінде қызметтерді ұсыну үшін бұлтты жүйелерді орналастырудың қандай нұсқасы қолданылады:
<variantright> жеке бұлт
<variant> ақылы бұлт
<variant> тегін бұлт
<variant> корпоративтік бұлт
<variant> жалпы бұлт

<question2> Өнім ерекшеліктері Ес2 Amazon компаниясының IaaS технологиясы:
<variantright> Xen хостингі
<variant> Операциялық тәуекелдердің ұлғаюы
<variant> Шығындарды азайту
<variant> Икемділік
<variant> Осалдық

<question2> Бұлтты есептеулерді қолданудың негізгі мәселелері:
<variantright> кез келген ақпаратқа қол жеткізе алуы
<variant> жадының шектеулілігі және мобильді құрылғылар процессорларының жылдам әрекет етуі
<variant> мобильді құрылғылардың экраны мен пайдаланушы интерфейсі шектеулі
<variant> мобильді құрылғылар үшін Windows жоқ
<variant> мобильді құрылғыларға арналған браузерлердің болмауы

<question2> Бұлтты есептеулерді қолданудың негізгі мәселелері:
<variantright> интернетке тұрақты қосылуды талап етеді
<variant> клиентке инсталляция қажет емес
<variant> ыңғайлы графикалық веб-интерфейс
<variant> мобильді құрылғылардан іске қосуға болады
<variant> тезірек жұмыс істейді

<question2> Бұлтты жүйелерді орналастырудың қандай нұсқасын бұлтты провайдерлер сыртқы тұтынушыларға қызмет көрсету үшін пайдаланады:
<variantright> қоғамдық бұлт
<variant> жалпы бұлт
<variant> жеке бұлт
<variant> сервистік бұлт
<variant> арнайы бұлт

<question2> SaaS бағдарламалық жасақтамасының негізгі ерекшеліктері:
<variantright> «бір-көп» моделі бойынша қосымшаларды жеткізу
<variant> хабарламаларды жеткізу
<variant> жазылушыларға хабарламаларды жеткізу
<variant> бірнеше аймақтық кеңселерге әртүрлі хабарламаларды жеткізу
<variant> жүктемені теңгерімдеу және жүктемесі жоғары жүйелердің істен шығуының болмаушылығын қамтамасыз ету

<question2> SaaS бағдарламалық жасақтамасының негізгі ерекшеліктері:
<variantright> Желі бойынша басқару және коммерциялық БҚ-ға желілік қолжетімділік орталықтандырылған ДӨО-да жүзеге асырылады
<variant> Петербург көшелеріндегі трафикті бақылауға арналған компонент
<variant> Бүкіл әлем бойынша әртүрлі ДӨО арасында пайдаланушы трафигін таратуға арналған компонент
<variant> Клиенттің компьютеріндегі тапсырмалар трафигін бақылауға арналған компонент
<variant> Жабдық істен шыққан немесе ДӨО-да профилактикалық жұмыстар жүргізілген жағдайда да пайдаланушыларға бағдарламалық сервистерді ұсыну

<question2> .NET Services қызметінің «қызмет шинасы» компоненті қандай операцияларды қамтиды:
<variantright> берілген қосымшалар үшін жаңа порттарды ашпай, желілік мекен-жайларды түрлендіру және желіаралық экрандар арқылы өту мәселесін шешеді
<variant> сервистер туралы ақпаратты экранға шығарған кезде масштабтың өзгеруі
<variant> ауқымды бұлтты прожекторлар
<variant> кез келген құрылғыдан бұлтта жұмыс істейтін пайдаланушылардың сұрауларының кез келген саны кезінде сервистердің бұлтта жұмыс істеу мүмкіндігі
<variant> бұлтты ұйымдастыру үшін кең ауқымды қаржыландыру алу

<question2> Amazon CloudFront Веб-қызметі:
<variantright> соңғы пайдаланушыларға жеткізу
<variant> су белгілері сияқты сандық құқықтарды реттейді
<variant> аналитика мен есептерді жақсартады
<variant> консольді жақсартады
<variant> жеке мазмұнның параметрлерін жақсартады

<question2> Windows Azure сақтау:
<variantright> үлкен екілік нысандарды сақтауға мүмкіндік береді
<variant> деректерді өңдеу орталығының мамандандырылған Web-сервистері арқылы бағдарламалар мен деректер бойынша масштабталатын виртуалдандырылған іс-қимылдар
<variant> ұшақта компьютерде есептеу
<variant> таратылған есептеулер сияқты
<variant> бұлт түріндегі экран сақтағышпен Windows XP жүйесінде есептеу

<question2> Windows Azure сақтау:
<variantright> SQL құрылымдалған сұрау тілін қолданады
<variant> Деректерді өңдеу орталығының мамандандырылған Web-сервистері арқылы бағдарламалар мен деректер бойынша масштабталатын виртуалдандырылған іс-қимылдар 
<variant> Ұшақта компьютерде есептеу
<variant> Таратылған есептеулер сияқты
<variant> Бұлт түріндегі экран сақтағышпен Windows XP жүйесінде есептеу

<question2> Windows Azure платформасының Net Services компоненті қандай функцияны орындайды
<variantright> «бұлтты» және жергілікті қосымшалар үшін таратылған инфрақұрылымды қамтамасыз етеді
<variant> деректерді өңдеу орталығының мамандандырылған Web-сервистері арқылы бағдарламалар мен деректер бойынша масштабталатын виртуалдандырылған іс-қимылдар
<variant> ұшақта компьютерде есептеу
<variant> таратылған есептеулер сияқты
<variant> бұлт түріндегі экран сақтағышпен Windows XP жүйесінде есептеу

<question2> Windows Azure платформасының SQL Azure компоненті қандай функцияны орындайды
<variantright> Server-де деректерді сақтау
<variant> Орналастыруды жоспарлау
<variant> Барлық опциялар
<variant> Паравиртуализация
<variant> Толық виртуализация

<question2> Виртуализация - бұл:
<variantright> бағдарламалық логикамен біріктірілген, аппараттық бөліктен абстракцияланған есептеу қуатын беру тәсілі
<variant> серверлік инфрақұрылымға қатысты информатика әдістері мен жаңа ақпараттық технологиялар жетістіктерін енгізудің жүйелік процесі
<variant> қазіргі заманғы ақпараттық-телекоммуникациялық технологиялардың көмегімен құрылған бірыңғай ақпараттық кеңістікте барлық элементтер ұтымды интеграцияланған және оңтайлы жұмыс істейтін Процесс
<variant> цифрлық куәліктерді құру, басқару және ашу мүмкіндігінің сенімділігін қамтамасыз етудің серверлік технологиясы
<variant> серверлік технология

<question2> Төменде көрсетілгендердің қайсысы виртуализация әдісі емес?
<variantright> Ішінара виртуализация
<variant> Толық виртуализация
<variant> Жеке виртуализация
<variant> Паравиртуализация
<variant> Ааппараттық виртуализация

<question2> Орналастыру сервері:
<variantright> Windows тобының операциялық жүйелерінің Microsoft серверлік технологиясы желісі бойынша орнатуға арналған 
<variant> Цифрлық куәліктерді жасау, басқару және ашу мүмкіндігінің сенімділігін қамтамасыз етудің серверлік технологиясы
<variant> Windows жаңартуларын жүктеу және орнатуды қамтитын серверлік технология. Егер қызмет өшірілген болса, онда бұл компьютерде автоматты жаңарту мүмкіндіктерін немесе Windows Update веб-торабын пайдалану мүмкін болмайды
<variant> Соңғы нүктелер мен басқа RPC қызметтерін салыстыруды қамтамасыз етеді
<variant> Барлық элементтер ұтымды интеграцияланған және қазіргі заманғы ақпараттық-телекоммуникациялық технологиялардың көмегімен құрылған бірыңғай ақпараттық кеңістікте оңтайлы жұмыс істейтін Процесс

<question2> Төменде көрсетілгендердің қайсысы орналастыру кезеңдеріне жатады?
<variantright> Орналастыруды жоспарлау
<variant> Сұрау файлын құру
<variant> Барлық опциялар
<variant> Паравиртуализация
<variant> Толық виртуализация

<question2> Операциялық жүйенің кескінін жасау үшін бағдарламаларды көрсетіңіз:
<variantright> Nero Burning ROM
<variant> Ashampoo Burning Studio
<variant> Барлық опциялар
<variant> AOMEI Backupper
<variant> Handy Backup

<question2> Виртуалды машина менеджері қандай мүмкіндіктерді қамтиды?
<variantright> деректер орталығы
<variant> қалпына келтіру тізілімдері
<variant> барлық опциялар
<variant> бірнеше компьютерді синхрондау
<variant> жұмыс станциялары мен серверлер үшін резервтік көшіру

<question2> System Center 2012 R2 негізгі міндеті қандай:
<variantright> АТ-инфрақұрылымын мониторингілеу
<variant> Өнімділік мониторингінде
<variant> Бұлтты қойманың әкімшілік міндеттерін шешуде
<variant> Маңызды деректерді журналға жазуда
<variant> Жаңарту серверлерін конфигурациялауда

<question2> Тек Windows Server-де қол жетімді Hyper-V компоненттерін көрсетіңіз:
<variantright> Талшықты арнаның виртуалды адаптері
<variant> Әдепкі желі (Nat қосқышы) 
<variant> Виртуалды машиналарды жылдам құру және жинау
<variant> Командлеттерді пайдалана отырып, күрделі операцияларды іске асыру
<variant> RAID-0 виртуалды адаптері

<question2> PowerShell шақырылған виртуалды машиналардың тізімін алу үшін қайсы пәрменді қолданамыз:
<variantright> Get-VM
<variant> Get-Command
<variant> Start-VM
<variant> New-VM
<variant> Push-VM

<question2> Hyper-V - бұл:
<variantright> төмен деңгейлі қабық негізіндегі виртуалдау технологиясы
<variant> серверлік инфрақұрылымға қатысты информатика әдістері мен жаңа ақпараттық технологиялар жетістіктерін енгізу процесі
<variant> стандарттау технологиясы каталог қызметімен жұмыс істеу кезінде басқа қосымшалар өздерінің каталогтарын қолдауы керек екенін қамтамасыз етеді
<variant> RAID-0 аналогы
<variant> диск кеңістігін виртуализациялау технологиясы

<question2> Storage Spaces – бұл:
<variantright> диск кеңістігін виртуализациялау технологиясы
<variant> RAID-0 аналогы
<variant> бақылау сомасы жазумен кезектесетін дискіге страйптарды жазу
<variant> стандарттау технологиясы каталог қызметімен жұмыс істеу кезінде басқа қосымшалар өздерінің каталогтарын қолдауы керек екенін қамтамасыз етеді
<variant> серверлік инфрақұрылымға қатысты информатика әдістері мен жаңа ақпараттық технологиялардың жетістіктерін енгізу процесі

<question2> Hyper-V ата-ана бөлімінің компонентіне:
<variantright> виртуалды машинаның жұмыс процесі
<variant> виртуализация қызметтерінің клиенттері
<variant> қалпына келтіру тізілімдері
<variant> деректерді өңдеу орталығы
<variant> Жұмыс процесі

<question2> Hyper-V ата-ана бөлімінің компонентіне:
<variantright> VMM
<variant> ОС кодындағы модификациялар
<variant> VM шинасы
<variant> Мұрағаттық процестер
<variant> Жобалау қызметтері

<question2> Hyper-V ата-ана бөлімінің компонентіне:
<variantright> VID
<variant> Виртуализация қызметтерінің клиенттері
<variant> ОС кодындағы модификациялар
<variant> Мұрағаттық процестер
<variant> Жобалау қызметтері

<question2> Hyper-V еншілес бөлімінің компонентіне:
<variantright> виртуализация қызметтерінің клиенттері
<variant> драйверлер
<variant> виртуалды машинаның жұмыс процесі
<variant> мұрағаттық процестер
<variant> жобалау қызметтері

<question2> Hyper-V еншілес бөлімінің компонентіне:
<variantright> ОС кодындағы модификациялар
<variant> VMM
<variant> VID
<variant> MED-V
<variant> App-V

<question2> MS Virtual Server 2005 R2 қолдайды:
<variantright> 32 биттік хост
<variant> 64 биттік виртуалды машиналар
<variant> виртуалды машинаға максимум 1 процессор
<variant> виртуалды машинаға 8ГБ ОП дейін
<variant> виртуалды машинаға 16ГБ ОП дейін

<question2> Hyper-V R2 қолдайды:
<variantright> 64 биттік виртуалды машиналар
<variant> виртуалды машинаға максимум 1 процессор
<variant> 32 биттік хост
<variant> 16 биттік хост
<variant> виртуалды машинаға 16ГБ ОП дейін

<question2> MS Virtual Server 2005 R2 қолдайды:
<variantright> ресурстарды басқару мүмкіндігі
<variant> виртуалды машиналардың суреттерін жасау
<variant> виртуалды машинаға 4 Гб дейін ОП
<variant> виртуалды машинаға 8ГБ ОП дейін
<variant> виртуалды машинаға 16ГБ ОП дейін

<question2> Ата-аналар мен балалар бөлімдері арасындағы жоғары жылдамдықты өзара әрекеттесу қамтамасыз етіледі:
<variantright> VM шинасы
<variant> Виртуалды машинаның жұмыс процесі
<variant> Виртуалды машина драйвері
<variant> Виртуалды машинаның жұмыс сервері
<variant> Виртуалды машинаны іске асыру

<question2> Ата-аналар бөліміне қонақтық ОЖ сұраныстары жіберіледі:
<variantright> Виртуалдау қызметтерінің клиенті
<variant> VM шинасы
<variant> Виртуалды машинаның жұмыс процесі
<variant> Виртуалды машинаның жұмыс сервері
<variant> Виртуалды машинаны іске асыру

<question2> Виртуалды машинаны конфигурациялау, іске қосу, тоқтата тұру мәселелерін шешу қамтамасыз етіледі:
<variantright> виртуалды машинаның жұмыс процесі
<variant> виртуалдау қызметтерінің клиенті
<variant> виртуалдау қызметтерінің провайдері
<variant> клиенттің виртуалдау базалары процесімен
<variant> клиенттің виртуалдау процесіне қатысуы

<question2> Дұрыс жауап нұсқасын көрсетіңіз:
<variantright> Виртуализация ортасын Microsoft Hyper - V - ден Windows Server 2008-ге Hyper-V рөлімен ауыстыруға болады
<variant> Windows Server-дің алдыңғы нұсқасын Microsoft Hyper-V Server-ге жаңартуға болады
<variant> Hyper-V серверлерін виртуализациялау шешімі тек Microsoft Hyper-V Server жеке өнімі ретінде ұсынылған
<variant> Виртуалды машина «таза» аппараттық құралдағы ұқсас конфигурациямен бірдей тиімділікпен жұмыс істейді
<variant> Виртуалды машиналар қолданба ішіндегі физикалық бар құрылғылармен ғана жұмыс істей алады

<question2> Дұрыс нұсқаны белгілеңіз:
<variantright> Windows Server-дің алдыңғы нұсқасын Microsoft Hyper-V серверіне жаңарту мүмкін емес
<variant> Microsoft Hyper-V Server-де графикалық пайдаланушы интерфейсі бар
<variant> Microsoft Hyper-V әр Windows қонақ операциялық жүйесі үшін лицензия талап етпейді
<variant> Виртуалды машина «таза» аппараттық құралдағы ұқсас конфигурациямен бірдей тиімділікпен жұмыс істейді
<variant> Виртуалды машиналар қолданба ішіндегі физикалық бар құрылғылармен ғана жұмыс істей алады

<question2> Дұрыс мәлімдемені таңдаңыз:
<variantright> Microsoft Hyper-V басқа серверлік рөлдерді қолдамайды
<variant> Виртуализация ортасын Microsoft Hyper - V - ден Windows Server 2008-ге Hyper-V рөлімен ауыстыру мүмкін емес
<variant> Microsoft Hyper-V әр Windows қонақ операциялық жүйесі үшін лицензия талап етпейді
<variant> Виртуалды машина «таза» аппараттық құралдағы ұқсас конфигурациямен бірдей тиімділікпен жұмыс істейді
<variant> Виртуалды машиналар қолданба ішіндегі физикалық бар құрылғылармен ғана жұмыс істей алады

<question2> Microsoft Hyper-V Server R2 қолдайды:
<variantright> хост компьютеріндегі 4-тен астам процессор
<variant> графикалық пайдаланушы интерфейсінің болуы
<variant> қосымшалардың істен шығуының тұрақтылығы
<variant> хост компьютеріндегі 64-тен астам процессор
<variant> хост компьютеріндегі 32-ден астам процессор

<question2> Windows Server 2008 R2 Standard қолдайды:
<variantright> Hyper-V-тен басқа серверлік рөлдерді пайдалану
<variant> Live Migration
<variant> Хост компьютеріндегі 16-дан астам процессор
<variant> Хост компьютеріндегі 64-тен астам процессор
<variant> Хост компьютеріндегі 32-ден астам процессор

<question2> Дұрыс анықтаманы таңдаңыз. VID-бұл:
<variantright> виртуалды машина драйвері
<variant> виртуалды машиналарға арналған құрылғыларды конфигурациялауды және басқаруды іске асыратын бағдарламалық модульдер
<variant> виртуалды машиналарды басқаруға және басқаруға арналған API-ге негізделген құралдар жиынтығы
<variant> деректерді өңдеу орталығын қалыптастыру корпоративтік бұлтты өрістеткеннен кейін жүзеге асырылады
<variant> ең көп сұранысқа ие бұлтты сервис техникалық қолдау қызметі болып табылады

<question2> Дұрыс мәлімдемені таңдаңыз:
<variantright> виртуалды машинада барлық стандартты компьютер компоненттері бар
<variant> виртуалды машиналар хост ішіндегі физикалық бар құрылғылармен ғана жұмыс істей алады
<variant> виртуалды машина «таза» аппараттық құралдағы ұқсас конфигурациямен бірдей тиімділікпен жұмыс істейді
<variant> әдетте, деректерді өңдеу орталығын қалыптастыру корпоративтік бұлтты орналастырғаннан кейін жүзеге асырылады
<variant> ең көп сұранысқа ие бұлтты сервис техникалық қолдау қызметі болып табылады

<question2> Дұрыс мәлімдемені таңдаңыз:
<variantright> Виртуалды машиналар құрылғыларды эмуляциялауды қолдайды
<variant> Виртуализацияның кез-келген платформасы барлық аппараттық құралдарды виртуализациялауды қолдайды
<variant> Виртуалды машина «таза» аппараттық құралдағы ұқсас конфигурациямен бірдей тиімділікпен жұмыс істейді
<variant> Виртуалды машиналар қолданба ішіндегі физикалық бар құрылғылармен ғана жұмыс істей алады
<variant> Виртуалды машинада кейбір стандартты емес компьютер компоненттері бар

<question2> Оқшауланған виртуалды орта аясында бағдарламалық шешімдерді қолдану:
<variantright> Қосымшаларды виртуализациялау
<variant> Сақтау жүйелерін виртуалдандыру
<variant> Желіні виртуалдандыру
<variant> ОЖ виртуализациясы
<variant> Серверді виртуализациялау

<question2> Сақтау жүйелерін виртуалдандыру:
<variantright> файлдарды виртуализациялау және блоктарды виртуализациялау
<variant> файлдарды виртуализациялау және серверлерді виртуализациялау
<variant> блоктарды виртуалдандыру және ОЖ виртуалдандыру
<variant> бағдарламаны виртуалдандыру және ОЖ виртуалдандыру
<variant> серверді виртуалдандыру және ОЖ виртуалдандыру

<question2> Желінің ішкі виртуализациясы:
<variantright> Бір хосттың бірнеше виртуалды машиналары арасында виртуалды желі құру
<variant> Бірнеше виртуалды желілерді бір желіге біріктіру
<variant> Виртуалды және физикалық машиналарды бірыңғай желіге біріктіру
<variant> Ethernet кадрларын IP желісі арқылы беру әдісі
<variant> Трафикті инкапсуляциялау әдісі

<question2> Файлдарды виртуализациялау бөлігі болып табылады:
<variantright> сақтау жүйелерін виртуалдандыру
<variant> қосымшаларды виртуализациялау
<variant> желіні виртуалдандыру
<variant> сайттарды виртуализациялау
<variant> домендерді виртуалдандыру

<question2> Зияткерлік жүктеме теңдестіру процесі бөлігі болып табылады:
<variantright> Серверлерді виртуализациялау
<variant> Желіні виртуалдандыру
<variant> ОЖ виртуализациясы
<variant> Сайттарды виртуализациялау
<variant> Домендерді виртуалдандыру

<question2> ОЖ виртуализациясы кейбір жағдайларда мүмкін емес:
<variantright> аппараттық қамтылымды виртуалдандыру
<variant> желіні виртуалдандыру
<variant> сақтау жүйелерін виртуалдандыру
<variant> сайттарды виртуализациялау
<variant> домендерді виртуалдандыру

<question2> Блоктарды виртуализациялау бөлігі болып табылады:
<variantright> Сақтау жүйелерін виртуалдандыру
<variant> ОЖ виртуалдандыру
<variant> Серверлерді виртуализациялау
<variant> Сайттарды виртуализациялау
<variant> Домендерді виртуалдандыру

<question2> Қосымшамен жұмыс істеу мүмкіндігі, оның бөліктерінің физикалық орналасуына қарамастан, пайдалануды білдіреді:
<variantright> Сервистерді виртуалдандыру 
<variant> ОЖ виртуалдандыру
<variant> Қосымшалар серверлерін виртуализациялау
<variant> Сайттарды виртуализациялау
<variant> Домендерді виртуалдандыру

<question2> Бір хостта бірнеше ОЖ пайдалану қамтамасыз етіледі: 
<variantright> қосымшалар серверлерін виртуалдандыру
<variant> қосымшаларды виртуалдандыру
<variant> жүйені виртуалдандыру
<variant> сайттарды виртуализациялау
<variant> домендерді виртуалдандыру

<question2> Негізгі жабдықты толық модельдеуді қамтамасыз етеді:
<variantright> толық виртуализация
<variant> аппараттық виртуализация
<variant> паравиртуализация
<variant> ішінара виртуализация
<variant> жүйелік виртуализация

<question2> Виртуалды ортада пайдалану үшін қонақ ОЖ дайындалатын виртуализация түрі: 
<variantright> паравиртуализация
<variant> толық виртуализация
<variant> аппараттық виртуализация
<variant> ішінара виртуализация
<variant> жүйелік виртуализация

<question2> Бір хостта бірнеше ОЖ-ны іске қосуды қамтамасыз ететін технология, ОЖ бір-бірінен және аппараттық ресурстардан тәуелсіз:
<variantright> аппараттық виртуализация
<variant> толық виртуализация
<variant> паравиртуализация
<variant> ішінара виртуализация
<variant> жүйелік виртуализация

<question2> Виртуалды желіні сипаттауға болады:
<variantright> желіні модельдеу
<variant> желіден жоғары деңгейде өрістетілетін желі
<variant> жеке бұлт
<variant> басқару ортасы
<variant> аппараттық платформа

<question2> Виртуалды машинаны келесі жұмыс станцияларын виртуализациялау шешімінде тек хост басқарады:
<variantright> Windows Virtual PC
<variant> MED-V
<variant> App-V
<variant> Hadoop
<variant> CSL

<question2> Есептеу ресурстарына сұраныстың біркелкі еместігі туралы ереже негіз болып табылады: 
<variantright>  қосымшаларды орналастырудың «бұлтты» тәсілі
<variant> қосымшаларды орналастырудың хостинг әдісі
<variant> қосымшаларды Тапсырыс берушінің жағында орналастыру тәсілі
<variant> барлық интернет-сайттарды біріктіретін жалпы бұлт
<variant> жеке бұлт

<question2> АТ-да есептеу ресурстарының абстракциясы деп түсініледі:
<variantright> виртуализация
<variant> middleware
<variant> software
<variant> frameware
<variant> openware

<question2> Виртуалды серверлер қабаты:
<variantright> аппараттық және кіші бағдарламалармен қамтамасыз ету
<variant> аппараттық және бағдарламалық қамтамасыз етумен
<variant> бағдарламалық және кіші бағдарламалармен қамтамасыз ету
<variant> аппараттық және желілік қамтамасыз етумен
<variant> аппараттық және операциялық қамтамасыз етумен

<question2> IaaS қосымшаларын орналастыру әдісімен клиент басқарады:
<variantright> басқару ортасы
<variant> аппараттық платформа
<variant> желілік ресурстар
<variant> операциялық жүйе
<variant> бағдарламалау

<question2> IaaS қосымшаларын орналастыру әдісімен клиент басқарады:
<variantright> қосымшалар
<variant> серверлер
<variant> виртуалдау
<variant> желілік ресурстар
<variant> операциялық жүйе

<question2> IaaS қосымшаларын орналастыру әдісімен клиент басқарады:
<variantright> мәліметтер базасы
<variant> аппараттық платформа
<variant> операциялық жүйемен
<variant> бағдарламалау
<variant> желілік ресурстар

<question2> PaaS қосымшаларын орналастыру әдісімен клиенттік басқару:
<variantright> қосымшалар
<variant> аппараттық платформа
<variant> желілік ресурстар
<variant> үлгілер
<variant> бағдарламалау

<question2> PaaS қосымшаларын орналастыру әдісімен клиент басқара алады:
<variantright> қосымшалар
<variant> серверлер
<variant> виртуалдау
<variant> үлгілер
<variant> бағдарламалау

<question2> PaaS қолданбаларын орналастыру әдісімен клиент басқармайды:
<variantright> мәліметтер базасы
<variant> қосымшалар
<variant> виртуалдау
<variant> бағдарламалау
<variant> үлгілер

<question2> Windows Azure тәсілді қолданады:
<variantright> PaaS
<variant> SaaS 
<variant> IaaS
<variant> XaaS
<variant> FaaS

<question2> Дұрыс мәлімдемені таңдаңыз:
<variantright> Windows Azure IT инфрақұрылымын басқару процесін жеңілдетеді
<variant> Windows Azure қосымшаларды жедел тестілеу мүмкіндігін қолдамайды
<variant> Мобильді қосымша мен бұлттағы мобильді қызмет арасында ақпарат алмасу үшін Windows Azure
<variant> Ұялы телефон пайдаланушыларының мінез-құлқының дұрыстығын бақылау үшін Windows Azure
<variant> Windows Azure құпия пайдаланушы ақпаратын сақтау үшін

<question2> Дұрыс мәлімдемені таңдаңыз:
<variantright> Windows Azure қосымшаларды веб арқылы таратуға мүмкіндік береді
<variant> Windows Azure үлкен көлемдегі деректерді сақтауға мүмкіндік бермейді
<variant> Мобильді қосымша мен бұлттағы мобильді қызмет арасында ақпарат алмасу үшін Windows Azure
<variant> Ұялы телефон пайдаланушыларының мінез-құлқының дұрыстығын бақылау үшін Windows Azure
<variant> Windows Azure құпия пайдаланушы ақпаратын сақтау үшін

<question2> Дұрыс мәлімдемені таңдаңыз:
<variantright> коммуникациялық сервистер «бұлтты» қызметтер ретінде барынша сұранысқа ие
<variant> әдетте, деректерді өңдеу орталығын қалыптастыру корпоративтік бұлтты орналастырғаннан кейін жүзеге асырылады
<variant> ең танымал бұлтты сервис-бұл техникалық қолдау қызметі
<variant> тиімді вирусқа қарсы қорғаныстың болмауы
<variant> бөлімді немесе бүкіл қосымшаны бұлтқа ауыстыру

<question2> Дұрыс мәлімдемені таңдаңыз:
<variantright> корпоративтік бұлт құру-компанияның деректерді өңдеу орталықтарының эволюциялық дамуы
<variant> ең көп сұранысқа ие бұлттық сервис вирусқа қарсы қорғау қызметтері болып табылады 
<variant> ең танымал бұлтты сервис-бұл техникалық қолдау қызметі
<variant> тұтынылатын IT-ресурстардың саны мен құнын жедел есепке алу қажеттілігінің болуы
<variant> бөлімді немесе бүкіл қосымшаны бұлтқа ауыстыру

<question2> Дұрыс мәлімдемені таңдаңыз:
<variantright> коммуникациялық сервистер «бұлтты» қызметтер ретінде барынша сұранысқа ие
<variant> ең көп сұранысқа ие бұлтты сервис техникалық қолдау қызметі болып табылады
<variant> деректерді сақтау кеңістігінің болмауы
<variant> тиімді вирусқа қарсы қорғаныстың болмауы
<variant> бөлімді немесе бүкіл қосымшаны бұлтқа ауыстыру

<question2> «Бұлтты» қамтамасыз етуде пайда болатын қажеттіліктің болуын бағалауға болатын белгі:
<variantright> тестілеу үшін жұмыс ортасын тез кеңейту қажеттілігі
<variant> деректерді сақтау кеңістігінің болмауы
<variant> тиімді вирусқа қарсы қорғаныстың болмауы
<variant> бөлімді немесе бүкіл қосымшаны бұлтқа ауыстыру
<variant> бұлтты қызметтер Жергілікті қызметтермен өзара әрекеттесетін интеграция

<question2> «Бұлтты» қамтамасыз етуде пайда болатын қажеттіліктің болуын бағалауға болатын белгі:
<variantright> тұтынылатын IT-ресурстардың есепке алу қажеттілігінің болуы
<variant> дамыған ішкі желілік инфрақұрылымның болуы
<variant> ағымдағы міндеттерді шешу үшін есептеу ресурстарының жетіспеушілігі
<variant> бөлімді немесе бүкіл қосымшаны бұлтқа ауыстыру
<variant> бұлтты қызметтер Жергілікті қызметтермен өзара әрекеттесетін интеграция

<question2> «Бұлтты» қамтамасыз етуде пайда болатын қажеттіліктің болуын бағалауға болатын белгі:
<variantright> пайдаланушы орталарының санына шектеулердің болмауы
<variant> тиімді вирусқа қарсы қорғаныстың болмауы
<variant> дамыған ішкі желілік инфрақұрылымның болуы
<variant> бөлімді немесе бүкіл қосымшаны бұлтқа ауыстыру
<variant> бұлтты қызметтер Жергілікті қызметтермен өзара әрекеттесетін интеграция

<question2> «Қосымшаны бұлтқа орналастыру» сценарийі үшін:
<variantright> PaaS сияқты қосымшаны орналастыру
<variant> Бөлімді немесе бүкіл қосымшаны бұлтқа ауыстыру
<variant> Бұлтты қызметтер жергілікті қызметтермен өзара әрекеттесетін интеграция
<variant> Кодтың бір бөлігін бұлтқа ауыстыру
<variant> Windows Azure және SQL Azure арасында деректер алмасу

<question2> «Қосымшаны бұлтқа орналастыру» сценарийіне:
<variantright> IaaS сияқты қосымшаны орналастыру
<variant> Бұлтты қызметтер Жергілікті қызметтермен өзара әрекеттесетін интеграция
<variant> Кодтың бір бөлігін бұлтқа ауыстыру
<variant> Windows Azure және SQL Azure арасында деректер алмасу
<variant> Пайдаланушы тіркелгілері мен парольдерді сақтау

<question2> «Қосымшаны бұлтқа орналастыру» сценарийі үшін:
<variantright> PaaS сияқты кодты орналастыру
<variant> Деректердің бір бөлігін бұлтқа көшіру
<variant> Кодтың бір бөлігін бұлтқа ауыстыру
<variant> Windows Azure және SQL Azure арасында деректер алмасу
<variant> Пайдаланушы тіркелгілері мен парольдерді сақтау

<question2> «Бұлт қызметтерін пайдалану» сценарийі үшін тән:
<variantright> Деректердің бір бөлігін бұлтқа көшіру
<variant> Раас сияқты кодты орналастыру
<variant> IaaS сияқты кодты орналастыру
<variant> XaaS сияқты кодты орналастыру
<variant> SaaS сияқты кодты орналастыру

<question2> Бұлттағы веб-қызметтер не бола алмайды?
<variantright> компьютер қызмет ретінде
<variant> инфрақұрылым Сервис ретінде
<variant> платформа қызмет ретінде
<variant> байланыс қызмет ретінде
<variant> қызмет ретінде сақтау

<question2> Microsoft Live жұмыс кеңістігі дегеніміз не?
<variantright> кез келген компьютерден құжаттарға қол жеткізу
<variant> фотогалерея құру
<variant> жаңалықтарды жариялау
<variant> құжаттарды құралдармен редакциялау нақты уақыттағы жұмыс кеңістігі
<variant> бейнеконференцияларды жариялау

<question2> Нақты уақыттағы жұмыс кеңістігінде толық функционалдығы бар веб-шолғышты таңдаңыз
<variantright> Internet Explorer
<variant> Google Chrome
<variant> Mozilla Firefox 3
<variant> Опера 10
<variant> Яндекс

<question2> Windows Azure кезегіне (VisibilityTimeout) хабарламаның көрінуін күту уақытын көрсетіңіз?
<variantright> 2 сағат
<variant> 1 минут
<variant> 30 минут
<variant> 1 сағат
<variant> 40 минут

<question2> Windows Azure-де масштабталатын қызметтерді дамыту, орналастыру және басқару үшін қажет қолданбалы бағдарламалау интерфейсі қалай аталады?
<variantright> Windows Azure үшін SDK пакеті
<variant> Windows Azure параметрлер жиынтығы
<variant> Windows Azure құралдар жинағы
<variant> Azure Платформасы
<variant> Windows Azure үшін SQL

<question2> NET Service Bus іске асыруға не мүмкіндік береді?
<variantright> Enterprise Service Bus үлгісін жүзеге асырады
<variant> Пайдаланушылардың авторизациясын басқару
<variant> Windows Azure және SQL Azure арасында деректер алмасу
<variant> Пайдаланушы тіркелгілері мен парольдерді сақтау
<variant> Windows Azure

<question2> Windows Azure Storage компоненттерін атаңыз
<variantright> Windows Azure Blob
<variant> Windows Azure Block
<variant> Windows Azure Data Lake
<variant> Windows Azure Stream Analytics
<variant> Windows Azure SQL

<question2> Windows Azure Queue дегеніміз не?
<variantright> асинхронды тапсырмаларды диспетчерлеу
<variant> жедел деректерді уақытша сақтау
<variant> үлкен деректер элементтерін сақтау
<variant> құрылымдық қызмет күйлерін сақтау
<variant> жедел деректерді ұзақ уақыт сақтау

<question2> Бұлтты есептеудің негізгі артықшылықтары қандай
<variantright> ақауларға төзімділік
<variant> жоғары үстеме шығындар
<variant> сәйкестендіру
<variant> аутентификация арқылы
<variant> қайталау

<question2> .NET Access Control Service не орындайды?
<variantright> Бекіту негізінде сәйкестендіру
<variant> SQL Azure қол жеткізуді шектеу
<variant> Мобильді құрылғылардың экраны мен пайдаланушы интерфейсі шектеулі
<variant> Мобильді құрылғыларға арналған браузерлердің болмауы
<variant> Мобильді құрылғыларға арналған файлдардың болмауы

<question2> .NET Access Control Service не орындайды?
<variantright> авторизацияны орталықтандырылған басқару
<variant> сәйкестендіру, қай уақытта қай қызмет белсенді
<variant> сақтық көшірме жасау
<variant> координаттарды анықтау, қай уақытта қай қызмет белсенді емес
<variant> үлкен деректер элементтерін сақтау

<question2> Windows Azure Blob ең үлкен өлшемі қандай? 
<variantright> 50 Гб
<variant> 1 Гб
<variant> 5 Гб
<variant> 10 Гб
<variant> 15 Гб

<question2> Windows Azure-де масштабталатын қызметтерді дамыту, орналастыру және басқару үшін қажет қолданбалы бағдарламалау интерфейсі қалай аталады?
<variantright> Windows Azure SDK
<variant> Windows Azure ConfigSet
<variant> Windows Azure Toolkit
<variant> Azure Framework
<variant> Windows Azure SQL

<question2> Azure геолокация құралы не үшін жауап береді?
<variantright> бірнеше деректер орталықтарында деректердің қайталануы
<variant> сервердің орналасу координаттарын анықтау
<variant> сәйкестендіру, қай уақытта қай қызмет Белсенді
<variant> сақтық көшірме жасау
<variant> координаттарды анықтау, қай уақытта қай сервис белсенді емес

<question2> .NET Workflow Services міндеті:
<variantright> Жұмыс процестерін басқару
<variant> Пайдаланушылардың аутентификациясы
<variant> Қол жеткізуді шектеу
<variant> Windows Azure және SQL Azure деректерімен алмасу
<variant> Windows Live және SQL Azure деректерімен алмасу

<question3> Windows Azure Blob дегеніміз не?
<variantright> Үлкен деректер элементтерін сақтау
<variant> Сервистер арасында деректер алмасуды іске асыру үшін асинхронды тапсырмаларды диспетчерлеу
<variant> Құрылымдық қызмет күйлерін сақтау
<variant> Жедел деректерді уақытша сақтау
<variant> MapReduce парадигмасындағы тапсырмаларды орындау тілі

<question3> Бұлттың түрі?
<variantright> Жеке бұлт
<variant> Ақпараттар бұлты
<variant> Жжедел бұлт
<variant> MapReduce бұлты
<variant> Асинхронды бұлт

<question3> Windows Azure кестесі дегеніміз не?
<variantright> құрылымдық қызмет күйлерін сақтау
<variant> үлкен деректер элементтерін сақтау
<variant> сервистер арасында деректер алмасуды іске асыру үшін асинхронды тапсырмаларды диспетчерлеу
<variant> жедел деректерді уақытша сақтау
<variant> шағын деректер элементтерін сақтау

<question3> Hadoop стекіне негізделген мәліметтер базасының қайсысы жұмыс істейді?
<variantright> HBase
<variant> Dynamo
<variant> Bigtable
<variant> Cassandra
<variant> Phoenix

<question3> HBase кластерінің қай бөлігі клиенттерді басқа Master-server-ге ауыстырады?
<variantright> ZooKeeper
<variant> HDFS-server
<variant> Region-server
<variant> Master-server
<variant> BRC-server

<question3> HBase-де Scan операторы қандай әрекетті орындайды?
<variantright> деректерді оқу кезінде кесінді алу
<variant> бір жолдың атомдық өзгерісі
<variant> атомдық жолды оқу
<variant> жолға жаңа баған қосу
<variant> жаңа бағанды өңдеу

<question3> HBase қолдану аймағы
<variantright> ДБ-ға жиі қайталанатын сұраулар
<variant> Бір серверде орналасқан деректер базасы
<variant> DB үшін бірегей сұраулар, ad-hoc талдау
<variant> ДБ-ның күрделілігі және үлкен географиялық таралуы
<variant> ДБ сұраулар, бір серверде сақтау

<question3> Кассандрада қандай сұрау тілі қолданылады?
<variantright> CQL
<variant> Open SQL
<variant> IDL
<variant> CQLSH
<variant> Phoenix

<question3> Жад таратылған жүйелер үшін MapReduce іске асыруын таңдаңыз
<variantright> Apache Hadoop
<variant> Phoenix
<variant> Google MapReduce
<variant> Yandex MapReduce
<variant> Open SQL

<question3> Үлкен деректер трендінің қалыптасуына әсер еткен маңызды оқиғаны белгілеңіз:
<variantright> MapReduce принципінің өнертабысы
<variant> Питон тілін дамыту
<variant> deepblue өнертабысы
<variant> SQL тілін дамыту
<variant> Windows Live тілін дамыту

<question3> MapReduce туралы қате мәлімдемені таңдаңыз: 
<variantright> MapReduce Hadoop әзірлеушілері ойлап тапты
<variant> Мәліметтер бастапқыда сақталған түйіндерде есептеулер жүргізілетін деректерді жаппай параллель өңдеуге арналған интерфейс
<variant> MapReduce – бұл екі операция: деректерді тарату және жинау
<variant> MapReduce-ті Google әзірлеушілері жариялады
<variant> MapReduce-бөлінген нәтижелерді бөлу, параллель өңдеу және жинақтау

<question3> Теориялық тұрғыдан өнімділік қанша есе артады. MapReduce бір түйіннен екіге ауысқан кезде мәтіндегі сөздердің саны?
<variantright> 2
<variant> 5
<variant> 4
<variant> 8
<variant> 7

<question3> Келесі ДҚБЖ технологияларының қайсысы MapReduce принципін қолданбайды
<variantright> Redis
<variant> Hadoop
<variant> Cassandra
<variant> HDInsight
<variant> Data Service

<question3> Деректерді сақтау үшін Hadoop кластерін қолдану қандай деректер өлшемдерінен басталады?
<variantright> 100Тб
<variant> 100Гб
<variant> 1ТБ
<variant> 10Гб
<variant> 10Тб

<question3> Hadoop-бұл: 
<variantright> Кластерлерде жұмыс істейтін, қызметтік бағдарламалар жиынтығы
<variant> Үлкен деректерді өңдеуге мүмкіндік беретін таратылған ДҚБЖ
<variant> MapReduce парадигмасындағы тапсырмаларды орындау тілі
<variant> Үлкен көлемді файлдарды сақтауға арналған таратылған файлдық жүйе
<variant> SQL Service парадигмасындағы тапсырмаларды орындау тілі

<question3> Есеп беру функциясын қамтамасыз ететін Windows Azure платформалық қызметі қалай аталады?
<variantright> SQL Azure Reporting 
<variant> Reporting Service
<variant> Data Service
<variant> Ground Reporting
<variant> SQL Service

<question3> MapReduce тәсілін не сипаттайды?
<variantright> Map функциясы бірегей жазба енгізулерін іздейді. Reduce функциясы map нәтижелерін біріктіреді
<variant> Reduce функциясы бірегей жазба енгізулерін іздейді. Map функциясы Map нәтижелерін біріктіреді
<variant> MapReduce деректерді бірнеше түйіндер бойынша таратуға арналған
<variant> Reduce нәтижесі map функциясының кірісіне жіберіледі
<variant> Reduce функциясы бірегей жазба сәйкессіздіктерін іздейді. Map функциясы Map нәтижелерін біріктіреді

<question3> Жергілікті нұсқамен салыстырғанда бұлтты HDInsight қолданудың қандай артықшылықтары бар?
<variantright> Сұрау бойынша виртуалды-шектеусіз масштабтау
<variant> HDInsight функциясына жергілікті қол жеткізу мүмкіндігі
<variant> Неғұрлым икемді даму моделі
<variant> Ұялы телефон пайдаланушыларының мінез-құлқының дұрыстығын қадағалау
<variant> Пайдаланушылар туралы құпия ақпаратты сақтау

<question3> Amazon ұсынған бұлтты есептеу платформасын құрайтын есептеу веб-қызметтерінің жиынтығы
<variantright> Amazon Web Services
<variant> Amazon Wuala
<variant> Yunpan 360
<variant> Amazon OneDrive
<variant> Amazon DevPay

<question3> Amazon Web Services-те жасалған қосымшаларға арналған шоттарды есептеу және басқару жүйесі
<variantright> Amazon DevPay
<variant> Amazon CloudFront
<variant> Amazon Simple Workflow (SWF)
<variant> Amazon Relational Database Service (RDS)
<variant> Amazon SQL

<question3> Мазмұнды жеткізу желісі (CDN) объектілерді сұрауға жақын жерде жеткізу үшін – бұл
<variantright> Amazon CloudFront
<variant> Amazon DevPay
<variant> Amazon Simple Workflow (SWF) 
<variant> Amazon Relational Database Service (RDS) 
<variant> Amazon SQL

<question3> Масштабталатын, тұрақты қосымшаларды құруға арналған қызмет
<variantright> Amazon Simple Workflow (SWF) 
<variant> Amazon DevPay
<variant> Amazon CloudFront
<variant> Amazon Relational Database Service (RDS) 
<variant> Amazon SQL

<question3> MySQL және Oracle қолдауымен масштабталатын дерекқор серверін ұсынатын жүйе
<variantright> Amazon Relational Database Service (RDS)
<variant> Amazon DevPay
<variant> Amazon CloudFront
<variant> Amazon Simple Workflow (SWF) 
<variant> Amazon SQL

<question3> Amazon Web Services инфрақұрылымына кіретін және бұлтта есептеу қуатын беретін Веб-қызмет қалай аталады?
<variantright> Amazon Elastic Compute Cloud (Amazon EC2) 
<variant> Amazon Simple Service Email (SES) 
<variant> Amazon Flexible Payments Service (FPS) 
<variant> Amazon DevPay
<variant> Amazon SQL

<question3>  Бұлтты есептеу саласындағы стандарттар мен олардың өзара үйлесімділігін әзірлейтін ұйым қайсы?
<variantright> Open Cloud Consortium
<variant> Closed Cloud Consortium
<variant> Internet Cloud Consortium
<variant> World Cloud Consortium
<variant> Country Cloud Consortium

<question3> Бұлтты есептеу пайдаланушыларының мүдделерін көрсететін бұлтты стандарттарды әзірлеу
<variantright> Cloud Standards Customer Councll
<variant> Distributed Management Task Force
<variant> National Institute of Standards and Technology (NIST) 
<variant> Cloud Data Management Interface (CDMI) 
<variant> Distributed Corporate Study Force

<question3> Корпоративтік және бұлтты есептеу ресурстарын басқару стандарттары
<variantright> Distributed Management Task Force
<variant> Cloud Standards Customer Councll
<variant> National Institute of Standards and Technology (NIST) 
<variant> Cloud Data Management Interface (CDMI) 
<variant> Distributed Corporate Study Force

<question3> Бұлтты жүйелерді басқару бойынша қай спецификациямен айналысады
<variantright> Cloud Data Management Interface (CDMI) 
<variant> Distributed Management Task Force
<variant> Cloud Standards Customer Councll
<variant> National Institute of Standards and Technology (NIST) 
<variant> Distributed Corporate Study Force

<question3> Қытайда орнатылған бұлтты деректер қоймасы?
<variantright> Yunpan 360
<variant> Mega
<variant> Copy
<variant> Bitcasa
<variant> CloudFire

<question3> Google дискісі қандай функцияларды іске асырмайды
<variantright> мобильді қосымша жасау
<variant> деректерді жинау және оларды өңдеу (Google нысандары мен кестелері) 
<variant> суреттер мен презентациялар жасау (Google суреттері мен презентациялары) 
<variant> ақпаратты сақтау және құралдар мен қызметтер жиынтығы (Google құжаттары) 
<variant> деректерді талдау 

<question3> Google құжаттарымен жұмыс істеу үшін ең жақсы браузер
<variantright> Mozilla Firefox
<variant> Yandex Chrom
<variant> Opera
<variant> Cent Browser
<variant> Atom

<question3> Google құжаттарында қандай операцияларды орындау мүмкін емес?
<variantright> рендеринг
<variant> компьютерден мәтіндік құжатты жүктеп, оны Google құжатына түрлендіру
<variant> құжаттарды редакторлау
<variant> құжатты басқа тілге аудару
<variant> құжатты электрондық пошта хабарына тіркеу

<question3> Google Drive-та құжаттарды іздеу қалай жүзеге асырылады?
<variantright> түрі, қолжетімділігі, меншік құқығы бойынша
<variant> меншік құқығы бойынша, өлшемі бойынша
<variant> тек атауы, көлемі бойынша
<variant> тек кілт сөздер, HTML құжаттар бойынша
<variant> шифрланған типіне байланысты

<question3> Кесте көмегімен Google дискте істеуге болады:
<variantright> өте үлкен топтар үшін бірлескен қызметтің түрлерін ұйымдастыру
<variant> кестелер көмегімен құрылымданған сандық деректерді өңдеу 
<variant> деректерінің мөлшері үлкен массивтерді жүйелі түрде өңдеу және сақтау
<variant> файлды рендерлеу
<variant> шифрлау

<question3> Виртуалды сыныптың көмегімен не істеуге болады?
<variantright> ұзақ мерзімді оқу жобаларын қолдауға болады
<variant> Мультимедиялық презентациялар жасауға болады
<variant> кестелер арқылы құрылымдалған сандық деректерді өңдеу
<variant> мәліметті шифрлау
<variant> файлды рендерлеу

<question3> Презентация форматы мәтін мен кестеден қалай ерекшеленеді
<variantright> слайдтық құрылымының болуымен
<variant> ұяшықтарды қосуды іске асыру арқылы
<variant> формулалардың болуымен
<variant> пәрмен жолының болуымен
<variant> сандық айнымалылардың болуымен

<question3> Презентациялар арналған:
<variantright> объект туралы ақпаратты ыңғайлы нысанда жеткізу
<variant> бағдарламалауға
<variant> айнымалылар арасындағы құрылымдық байланыстарды визуализациялауға
<variant> үлкен көлемдегі ақпараттың графикалық сызықтарын есептеу
<variant> мәтіндік файлдарды өңдеу

<question3> Google мәтіндік құжаты мүмкіндік бермейді:
<variantright> мобильдік қосымшаны бағдарламалауға
<variant> өрістерді/шегіністерді, қаріптерді өзгертуге
<variant> компьютерден құжаттарды жүктеуге
<variant> мәтінді өзге тілдерге аударуға
<variant> мәтіндік құжаттарды редакторлауға

<question3> Azure-де мобильді қызметі қалай жасалады?
<variantright> (New) түймесі арқылы
<variant> Арнайы API көмегімен
<variant> Ұялы телефоннан
<variant> Web-сервис сияқты
<variant> Эмулятормен

<question3> Мобильді сервис үшін бұлтты деректер базасы қандай мақсатқа қажет?
<variantright> мобильді қосымша мен бұлттағы мобильді қызмет арасында ақпарат алмасу үшін
<variant> ұялы телефон пайдаланушыларының мінез-құлқының дұрыстығын қадағалау үшін
<variant> пайдаланушылар туралы құпия ақпаратты сақтау үшін
<variant> бұлтты дерекқорды құру міндетті емес
<variant> пайдаланушылар туралы құпия ақпаратты редакциялау үшін

<question3> Ұялы қызметтердің URL мекенжайлары үшін қандай формат қолданылады?
<variantright> mymobileservice.azure-mobile.net
<variant> my.mobile.service
<variant> azure.mobile.service
<variant> servisa.net
<variant> my.azure.service

<question3> Мобильді сервиске байланысты Мобильді қосымшаны құру қажет пе?
<variantright> мобильді қосымшасыз да жасау пайдалы болуы екіталай
<variant> мобильді құрылғы платформасына байланысты
<variant> мобильді қосымшаны іске асыру платформасына байланысты
<variant> мобильді сервисті іске асыру платформасына байланысты
<variant> мобильді құрылғыны іске асыру платформасына байланысты

<question3> Windows Azure қызметтерін пайдаланатын мобильді қосымшаларды әзірлеу үшін қандай құрал қолданылады?
<variantright> Visual Studio 2012 Express for Windows Phone 8
<variant> Visual Studio 2010 Quantum for Mobile Phone
<variant> Visual Studio 2008 Professional for Smart Phone
<variant> Mobile Phone SDK for Mini Phone
<variant> Visual Studio 2006 for Classic Phone

<question3> Windows Azure қандай мобильді платформаларға қолдау көрсетеді?
<variantright> Windows Phone 8
<variant> Windows Phone 7
<variant> Windows Store
<variant> iOS
<variant> Android

<question3> Мобильді құрылғылар үшін бұлтты есептеулерді қолданудың қазіргі мәселесі қандай?
<variantright> мобильді құрылғылар процессорларының жылдам әрекет етуі
<variant> мобильді құрылғылардың экран және пайдаланушы интерфейсі шектеулі
<variant> мобильді құрылғылар үшін Windows жоқ
<variant> мобильді құрылғыларға арналған браузерлердің болмауы
<variant> мобильді құрылғыларға арналған файлдардың болмауы

<question3> Функционалдылық дегеніміз не?
<variantright> берілген әрекеттерді енгізуді талап ететін функционалдылық
<variant> сыныптар иерархиясы түрінде іске асырылатын функционалдылық
<variant> рәсім түрінде іске асырылатын функционалдылық
<variant> веб-сервис түрінде іске асырылатын функционалдылық
<variant> қосымша түрінде іске асырылатын функционалдылық

<question3> Деректер көзі туралы ақпарат қандай форматта беріледі?
<variantright> XML
<variant> DOC
<variant> PPT
<variant> RTF 
<variant> EXE

<question3> Бұлтты қосымшаларды тарату үшін Azure-де тағы қандай портал бар?
<variantright> Azure App Store
<variant> Windows 8 Store
<variant> MSDN
<variant> UDDI
<variant> Visual Studio

<question3> Java үшін Azure SDK мүмкіндіктері қандай?
<variantright> Java қолданбалы серверін виртуалды машинада бұлтта іске қосу
<variant> Java қызметін іске асыру тілінен C тіліне көшу#
<variant> Windows Azure бағдарламасын Java тілінде іске асыру
<variant> Azure қолданушыларын Java тіліне оқыту
<variant> Windows Azure бағдарламасын Python тілінде іске асыру

<question3> Бұлтты қосымшаны жасау үшін қандай жобаны қолдану керек?
<variantright> Windows Azure Project
<variant> Console Application
<variant> Windows Application
<variant> Standard Template Library
<variant> Standard Application

<question3> Бұлтты қызметті орналастыру дегеніміз не?
<variantright> ақпаратты жіберу
<variant> ақпаратты іске қосу
<variant> ақпаратты орындау
<variant> ақпаратты құрастыру
<variant> ақпаратты жүктеу

<question3> Әзірленген қызметті бұлтқа орналастыру үшін қандай режим ұсынылады?
<variantright> Тек сервистік пакет құру
<variant> Azure бұлтында бүкіл жобаны толық орналастыру
<variant> Бұлтқа айдау үшін ftp серверін пайдалану
<variant> Жөндеу
<variant> Бүкіл жобаны Windows Live бұлтында толық орналастыру

<question3> Орналастыру кезінде қандай файлды көрсету керек?
<variantright> Service package файлы
<variant> Visual Studio solution файлы
<variant> Service configuration-файл
<variant> Сервисті іздеу автоматты түрде орындалады
<variant> Data configuration-файл

<question3> Орналастырылған бұлтты веб-қызметтердің URL мекен-жайларының жалпы нысаны қандай?
<variantright> servicename.cloudapp.net
<variant> my.cloud.servicename
<variant> servicename.windows.azure.com
<variant> servicename.microsoft.com
<variant> servicename.cloud.com

<question3> Сервистік бұлт бумасының конфигурация файлының кеңейтімі қандай?
<variantright> cspkg
<variant> xml
<variant> cc
<variant> cs
<variant> http

<question3> Сертификаттарды жеткізуші?
<variantright> Windows Live
<variant> Microsoft Office
<variant> Microsoft Visual Studio
<variant> Microsoft SharePoint
<variant> Microsoft SQL

<question3> Azure-де VM рөлі қандай?
<variantright> Виртуалды машина жұмыс істейтін процесс
<variant> Java Virtual Machine (JVM) жұмыс істейтін процесс
<variant> Common Language Runtime жұмыс істейтін процесс
<variant> Smalllatk Virtual Machine жұмыс істейтін процесс
<variant> Common Language Machine жұмыс істейтін процесс

<question3> Бір виртуалды машинада бірнеше VM рөлдері орындалуы мүмкін бе?
<variantright> Әр VM рөлі жеке VM-де орындалады
<variant> Виртуалды машина жұмысына байланысты
<variant> Жүйенің жүктелуіне байланысты
<variant> Пайдаланушының платформасына бойынша
<variant> Жүйе компонентіне байланысты

<question3> Windows Azure Storage Blob дегеніміз не?
<variantright> Azure Storage-де екілік нысандарды сақтауға арналған құралдар
<variant> Azure Storage жаһандық компоненті
<variant> NET BLOB сияқты-үйінді
<variant> Нысандармен жұмыс істеуге арналған негізгі тіл (object handling үшін негізгі тіл) 
<variant> Azure-ге кірген кезде клиенттік компьютерде іске қосылатын каталог

<question3> Жаңа Storage account құру кезінде қандай үш веб-бет жасалады?
<variantright> BLOB, Table және Queue нысандарын сақтау үшін
<variant> Compute, Queue нысандарын сақтау үшін
<variant> Table және Queue нысандарын сақтау үшін
<variant> AppFabric нысандарын сақтау үшін
<variant> VM рөлі нысандарын сақтау үшін

<question3> Жеке бұлт дегеніміз не?
<variantright> пайдаланушы барлық компоненттерді басқаратын бұлт
<variant> корпоративті кешке жалға алынған бұлт
<variant> қалалық пәтерде орналастырылған бұлт
<variant> құпия ақпараты бар бұлт
<variant> пайдаланушы бірнеше компоненттерді басқаратын бұлт

<question3> Бұлт түрі қандай инфрақұрылым қызметі ретінде?
<variantright> ішкі жүйе қауіпсіздігін және деректер базасын басқаратын бұлт
<variant> аймақтың инфрақұрылымын басқаруға арналған бұлт
<variant> қаладағы экологияны жақсарту үшін бұлт
<variant> пайдаланушы тек өз қосымшаларын басқаратын бұлт
<variant> пайдаланушы бірнеше компоненттерді басқаратын бұлт

<question3> Бұлт түрі платформа қызметі ретінде?
<variantright> пайдаланушы тек өз қосымшаларын басқаратын бұлт
<variant> пайдаланушы қосымшаларды, орындауды қолдау ішкі жүйелерін, қауіпсіздік ішкі жүйесін және деректер базасын басқаратын бұлт
<variant> пайдаланушы барлық компоненттерді басқаратын бұлт
<variant> теміржол платформаларын басқаруға арналған бұлт
<variant> пайдаланушы бірнеше компоненттерді басқаратын бұлт

<question3> Қызмет ретінде бұлт түрі қандай?
<variantright> бұлт, онда барлық компоненттерді провайдер басқарады және пайдаланушы дайын бұлтты қызметтерді пайдаланады
<variant> пайдаланушы қосымшаларды, орындауды қолдау ішкі жүйелерін, қауіпсіздік ішкі жүйесін және деректер базасын басқаратын бұлт
<variant> пайдаланушы қосымшаларды, орындауды қолдау ішкі жүйелерін, қауіпсіздік сыртқы жүйесін және деректер базасын басқаратын бұлт
<variant> бағдарламалық жасақтаманы сатуға арналған бұлт
<variant> пайдаланушы қосымшаны, орындауды қолдау ішкі жүйелерін, қауіпсіздік ішкі жүйелерін және деректер базасын өзі құратын бұлт

<question3> Azure қай платформада қолданылмайды?
<variantright> ISpring
<variant> Windows 98
<variant> MacOS
<variant> Linux
<variant> Android

<question3> Azure Active Directory дегеніміз не?
<variantright> бұлтты каталогтарды құру және пайдаланушылардың кіруін басқару қызметі
<variant> Azure-ге кірген кезде клиенттік компьютерде іске қосылатын каталог
<variant> XIX ғасырдағы француз үкіметінің атауы
<variant> Active Directory сияқты
<variant> Әртүрлі бұлттарды бір бұлтқа біріктіруге арналған стандарт

<question3> Service Bus дегеніміз не?
<variantright> Бұлтты хабар алмасу қызметтеріне арналған Azure шинасы
<variant> Қызметшілерді жұмысқа тасымалдауға арналған автобус
<variant> Бұлтты қызмет түрі
<variant> School Bus сияқты
<variant> Active Directory сияқты

<question3> Қолданбаны бұлтқа орналастыру дегеніміз не?
<variantright> Жадыға орналастыру және оны іске қосу
<variant> Қолданба дискісі бар қорапты ашу
<variant> Қосымша жұмыс істейтін ОЖ іске қосу
<variant> Қосымшаны орнатумен бірдей
<variant> ОЖ ашу және оны іске қосу

<question3> Microsoft корпорациясы қандай ақысыз бұлтты қызметті ұсынады?
<variantright> Windows Live
<variant> Windows Azure
<variant> Windows Cloud
<variant> Windows Phone
<variant> Windows SQL

<question3> Windows Azure іске асыру қай платформаға негізделген?
<variantright> .NET
<variant> Java
<variant> Delphi
<variant> C
<variant> Python

<question3> Бұлтты есептеу пайдаланушысы қосымшалардың қандай түрін орындай алады?
<variantright> бұлтты
<variant> ішкі (on-premises) 
<variant> вирустық
<variant> зиянды
<variant> корпоративтік

<question3> Intercloud дегеніміз не?
<variantright> әр түрлі бұлттарды бір бұлтқа біріктіруге арналған стандарт
<variant> барлық интернет-сайттарды біріктіретін жалпы бұлт
<variant> бұлтты сервистерді әзірлеуші фирманың атауы
<variant> интернеттің жаңа атауы
<variant> жеке бұлт

<question3> Гибридті бұлт дегеніміз не?
<variantright> жеке және қоғамдық бұлттың бірігуі
<variant> екі жеке бұлт бөліктерінің буданы
<variant> нақты және виртуалды бұлт буданы
<variant> қабатты будақ бұлт
<variant> көптеген жеке бұлттардың буданы

<question3> Ашылмалы тізім қандай элемент?
<variantright> ComboBox
<variant> TextBox
<variant> ListBox
<variant> InputPanel
<variant> CheckBox

<question3> Пайдаланушы енгізген мәтінді бір жолды мәтін өрісі қандай элемент жасайды және оның қасиеттерінің бірінде сақтайды?
<variantright> TextBox
<variant> ListBox
<variant> InputPanel
<variant> ComboBox
<variant> CheckBox 

<question3> Айналдыру жолағы бар тізім қандай элемент?
<variantright> ListBox
<variant> TextBox
<variant> InputPanel
<variant> ComboBox
<variant> CheckBox

<question3> Тұжырымдама аясында бұлтты пайдалану кезінде басқарылатын элементтерге қандай элементтер жатады платформа қызмет ретінде
<variantright> қосымша
<variant> орындау ортасы
<variant> қауіпсіздік және интеграция
<variant> мәліметтер базасы
<variant> эмулятор

<question3> NET дегеніміз не?
<variantright> Бағдарламалаудың көптілді платформасы
<variant> Java бейімделген нұсқасы
<variant> Байланыс желісінің түрі
<variant> Microsoft жаңа бастамасының атауы
<variant> Жаңа CDN бастамасының атауы

<question3> Azure қызметінің конфигурациясы қай файлда анықталады?
<variantright> ServiceDefiniton
<variant> ServiceConfiguration
<variant> ServiceIcon
<variant> ServiceAppearance
<variant> ServiceData

<question3> Azure қызметінің құрылымы қалай анықталады?
<variantright> ServiceConfiguration
<variant> ServiceDefinition
<variant> Web.config
<variant> Security.config
<variant> Direct.config

<question3> Жеке ОЖ-мен физикалық компьютер, сол сияқты қосымшалармен де жұмыс істейтін оқшауланған бағдарламалық контейнер
<variantright> Виртуалды машина
<variant> Виртуализация
<variant> Хосттың операциялық жүйесі
<variant> Виртуалды машина эмуляторы
<variant> Операциялық жүйенің тізілімі

<question3> Нақты жабдыққа орнатылған операциялық жүйе қалай аталады? Осы операциялық жүйенің бөлігі ретінде виртуализация бағдарламалық жасақтамасы әдеттегі қосымша ретінде орнатылады
<variantright> Хосттың операциялық жүйесі
<variant> Виртуалды машина
<variant> Виртуализация
<variant> Виртуалды машина эмуляторы
<variant> Операциялық жүйенің тізілімі

<question3> Құрылған виртуалды машинаға орнатылған операциялық жүйе
<variantright> қонақтың операциялық жүйесі
<variant> хосттың операциялық жүйесі
<variant> виртуалды машина эмуляторы
<variant> операциялық жүйенің тізілімі
<variant> операциялық жүйенің мұрағаты

<question3> Azure CDN дегеніміз не?
<variantright> Content Delivery Network-Кэштеу Серверлер Желісі
<variant> Compact Discs for Niggers
<variant> Бұлтты есептеуге арналған жаңа бағдарламалау тілі
<variant> Бұлтты есептеулерге арналған желілік протокол
<variant> Деректерді өңдеу орталығының серверлеріндегі желілік хаттама

<question3> Azure Account әкімшісіне қандай мүмкіндіктер бар?
<variantright> бірлескен әкімшіні құру
<variant> жаңа жазылым жасау
<variant> жаңа бұлт жасау
<variant> бәсекелестер құру
<variant> бұлтта файлдар құру

<question3> Қонақтық ОЖ дегеніміз не?
<variantright> клиенттік компьютерде жұмыс істейтін ОЖ 
<variant> шетелдік қонақтың ноутбукіндегі ОС
<variant> деректер орталығының серверлерінде жұмыс істейтін ОЖ
<variant> желілік хостта жұмыс істейтін ОЖ
<variant> виртуалды хостта жұмыс істейтін ОЖ

<question3> Java үшін Windows Azure SDK дегеніміз не?
<variantright> Azure бұлтты қызметтерін дамытуға арналған API
<variant> Java пайдаланушыларының Azure зерттеу құралы
<variant> Java-да Azure аналогын іске асыру құралы
<variant> Java қосымшаларын c тіліне түрлендіруге арналған құрал
<variant> Python-да Azure аналогын іске асыру құралы

<question3> VB-де бұлтты қосымшаларды жасау үшін Visual Studio қажет пе?
<variantright> VB-да Visual Studio қажет
<variant> Standalone Azure SDK жеткілікті
<variant> Пәндік аймаққа және тапсырмаға байланысты
<variant> Azure нұсқасына байланысты
<variant> Azure утилиталарына байланысты

<question3> Azure Media Services дегеніміз не?
<variantright> Бұлтта медиа файлдарды ойнату қызметтері
<variant> Mass Media-да Azure жарнамасы
<variant> Azure-ге қол жеткізу үшін медиаторларды пайдалану
<variant> Бейнедегі Azure мүмкіндіктерін бейнелеу қызметтері
<variant> Халықтың өсуін теңдестіру утилитасы

<question3> Azure MarketPlace порталындағы өтімді кеңістік дегеніміз не?
<variantright> орындарды брондау утилитасы
<variant> ваннадағы су есептегіштерге арналған утилита
<variant> сұйық тамақ өнімдерін сатуға арналған утилита
<variant> су құбырын басқаруға арналған утилита
<variant> халықтың өсуін теңдестіру утилитасы

<question3> Azure Marketplace порталындағы жарнама менеджері дегеніміз не?
<variantright> жарнамаларды тарату бағдарламасы
<variant> менеджерлерге арналған утилита
<variant> психикаға арналған утилита
<variant> сабақ кестесін құруға арналған утилита
<variant> халықтың өсуін теңдестіру утилитасы

<question3> MarketPlace Azure порталындағы EarthPopulation дегеніміз?
<variantright> утилиталар мен мәліметтер базасы
<variant> халық саны туралы ақпарат беру утилитасы
<variant> халықтың өсуін ынталандыру бағдарламасы
<variant> халықтың дерекқоры
<variant> халықтың өсуін теңдестіру утилитасы

<question3> Гавайи жобасы дегеніміз не?
<variantright> Бұлтты бағдарламалық жасақтаманы әзірлеу
<variant> Гавайиде Ресей туристік агенттігін құру жобасы
<variant> Әлем университеттерінің күштерімен Лазурды дамыту жөніндегі жоба
<variant> Гавайи штатының экологиясын жақсарту жобасы
<variant> Гавайи штатының экономикасын жақсарту жобасы

<question3> Гавайи жобасының болашағы неде?
<variantright> Тұжырымдаманы дәлелдеу: мобильді құрылғыдан бұлтты есептеулерді қолдану
<variant> Windows Azure (Windows Azur) бойынша ұсыныстар әзірлеу
<variant> Мобильді құрылғылар үшін пайдалы бұлтты бағдарламалық жасақтаманы жинақтау
<variant> Гавайиге барып, онда мәңгі қалу мүмкіндігі
<variant> Бойынша ұсыныстар әзірлеу SDK пакеті Azure үшін

<question3> Мобильді құрылғылар үшін бұлтты есептеулерді қолданудың қазіргі перспективасы
<variantright> жадының шектеулілігі және мобильді құрылғылар процессорларының тез әрекет етуі
<variant> мобильді құрылғылардың экран және пайдаланушы интерфейсі шектеулі
<variant> мобильді құрылғылар үшін терезе жоқ
<variant> мобильді құрылғыларға арналған браузерлердің болмауы
<variant> мобильді құрылғылар үшін бұлтты БҚ экранының болмауы

<question3> Гавайи жобасында Мобильді қосымшаларды жасау үшін қандай құрал қажет?
<variantright> Гавайи SDK жобасы
<variant> Windows Azure үшін SDK пакеті
<variant> Финикс SDK
<variant> Java әзірлеушілері үшін Azure SDK 
<variant> Жолды болжау үшін SDK

<question3> Гавайи жобасы (Hawaii Project) нені іске асырады?
<variantright> Әлеуметтік мобильді ақпарат алмасу
<variant> Жолды болжау
<variant> БҰҰ Денсаулық сақтау
<variant> Microsoft SQL
<variant> SQL Феникс

<question3> Осы қызметтердің қайсысы Гавайи жобасының қызметтері болып табылады?
<variantright> Кілттерді сақтау қызметі
<variant> Аудармашы қызметтері
<variant> Компилятор қызметі
<variant> Деректерді өңдеу қызметі
<variant> Фильмдер жасау қызметі

<question3> Гавайи жобасы (Microsoft Research Hawaii Project) атқарады?
<variantright> Ретрансляция
<variant> Рандев Қызметі
<variant> Рок-музыка қызметі
<variant> Фильмдер Жасаушының Қызметтері
<variant> Қызмет Көрсетуді Тоқтату
`