export const testingName = `Бағдарламалық жасақтаманы әзірлеу тәсілдері`;
export const testingStr = `
<question1> «Клиент сұранысын өңдеу» функционалды блогы үшін «CRM-жүйе» нысаны
<variantright> Механизм
<variant> Басқару
<variant> Кіру
<variant> Шығу
<variant> Барлық жауаптар

<question1> бағдарламалық өнімге анықтама беріңіз
<variantright> оларды орнату, баптау, пайдалану және пысықтау жөніндегі бағдарламалар мен ілеспе құжаттаманың жиынтығы
<variant> бағдарламалық қамтамасыздандыруды әзірлеу, пайдалану және қолдау кезінде белгілі бір жүйелі өлшенетін тәсілді қолдану
<variant> компоненттер мен жүйелердің оларды орта мен желілердің жаңа өзгеретін жағдайларына бейімдеу үшін реинженериясы
<variant> әзірлеушілер ұжымдарын тиімді ұйымдастыру және олардың қызметін бағалау қажеттіліктері негізінде жүзеге асырылады
<variant> көптеген машиналық командалар мен мәліметтерге мақсаттардың белгілі бір жиынтығын көрсету процесі

<question1> берілген функцияны немесе функциялар тобын іске асыруға арналған міндетті және факультативті мүмкіндіктердің нақты анықталған және үйлестірілген ішкі жиынтығы бар бірнеше негізгі стандарттардың жиынтығы
<variantright> стандарттар профилі 
<variant> өмірлік цикл
<variant> каскадты модель
<variant> бағдарламалық инженерия 
<variant> процестердің жетілуі

<question1> пайда болу және пайдалану сәттерінен бастап жұмысын тоқтатуға дейін техникалық жүйелердің даму процестері мен кезеңдерінің жиынтығын көрсетеді
<variantright> өмірлік цикл
<variant> жүйелік техника
<variant> аппараттық профиль 
<variant> стандарттар бейіні 
<variant> өнімді біріктіру

<question1> жүйе объектілерінің және оның компоненттерінің архитектурасы мен құрылымын реттейтін профильдер 
<variantright> функционалдық
<variant> технологиялық
<variant> аппараттық 
<variant> жүйелік
<variant> интегралдық

<question1> жүйелік техника жүйені құру технологиясы ретінде ? 
<variantright> бағдарламалық өнімдер жетекші рөл атқаратын күрделі есептеу кешендерін құру мен жаңғыртудың барлық аспектілерін қамтиды
<variant> жүйенің функцияларын түбегейлі құрылымдық өзгерістерсіз, салыстырмалы түрде қарапайым дамытуға және өсіруге жол беруі тиіс 
<variant> жүйенің және бағдарламалар кешенінің өмірлік циклінің даму перспективасын қамтамасыз ету үшін интеграция мүмкіндігін көздеген орынды 
<variant> әртүрлі сыртқы ортада пайдаланушылардың міндеттерін шешу үшін бағдарламалар кешені мен деректер базасының жұмыс істеу сапасын жүйелі түрде арттыру
<variant> жүйелер мен компоненттердің тұтастығын және бастапқы шығындарын сақтай отырып, олардың функцияларын кеңейту және жетілдіру

<question1> смм әдістемесінде жетілу деңгейлері қаншаға бөлінген
<variantright> 3
<variant> 6
<variant> 5
<variant> 8
<variant> 2

<question1> басқарылатын - осы деңгейдегі процестер алдын-ала жоспарланған, олардың орындалуы бақыланады, бұл нәтижелер мен кезеңдердің, компоненттердің және жобаның орындалу уақытының болжамдылығына қол жеткізеді
<variantright> 2 деңгей
<variant> 3 деңгей
<variant> 5 деңгей
<variant> 1 деңгей
<variant> 4 деңгей

<question1> осы деңгейде бағдарламалық құралдың өмірлік циклінің негізгі процестері реттелмейді, толығымен реттелмейді және жеке мамандардың үйлестірілмеген жеке күштері мен қасиеттеріне байланысты болады
<variantright> 1 деңгей 
<variant> 4 деңгей
<variant> 3 деңгей 
<variant> 5 деңгей
<variant> 2 деңгей

<question1> осы деңгейде өмірлік циклінің технологиялық үдерістері сияқты, жасалатын бағдарламалық өнім мен оның компоненттерінің де сапа сипаттамаларын егжей-тегжейлі кезең-кезеңімен бағалау жүйесі қолданылуы тиіс
<variantright> 4 деңгей 
<variant> 1 деңгей
<variant> 2 деңгей
<variant> 5 деңгей
<variant> 3 деңгей

<question1> бұл деңгейдің негізгі мақсаттарының бірі - пайдаланылатын процестердің күшті және әлсіз жақтарын анықтау арқылы кездейсоқ ақаулар мен қателіктерден көріністер мен шығындарды азайту
<variantright> 5 деңгей 
<variant> 2 деңгей
<variant> 3 деңгей 
<variant> 4 деңгей
<variant> 1 деңгей

<question1> шектеулі ресурстармен қажетті сапа сипаттамалары бар күрделі жүйені құрудың бірыңғай мақсатына жету үшін ресми түрде ұйымдастырылған іс-шаралар кешені ? деп аталды 
<variantright> жоба
<variant> жүйе
<variant> бағдарлама
<variant> ресурс
<variant> компоненттер

<question1> міндеттер қоюды, шешімдер дайындауды, мамандарды жоспарлауды, ұйымдастыруды және ынталандыруды, жұмыс барысын бақылауды және күрделі жүйелер құру кезінде ресурстарды пайдалануды қамтитын қызметтің ерекше түрі
<variantright> жобаны басқару
<variant> стандарттар бейіндері 
<variant> жүйені басқару
<variant> жүйені әзірлеу
<variant> өмірлік цикл

<question1> бірліктерді тестілеу ?
<variantright> жүйенің бір элементінің жұмысын тексеру
<variant> бағдарламалық компоненттерінің әрекеттесуін тексеру
<variant> сыртқы қосымшаларға тестілік интерфейстер
<variant> бқ құрылымын әдістемелік талдау және талдау жүргізу
<variant> бқ басқару элементтеріндегі сипат мәндерін өзгерту

<question1> оларды орнату, баптау, пайдалану және пысықтау жөніндегі бағдарламалар мен ілеспе құжаттаманың жиынтығы
<variantright> бағдарламалық өнім
<variant> бқ-ны әзірлеу процесі 
<variant> бағдарламалау
<variant> жүйені әзірлеу
<variant> жобаны басқару

<question1> компьютерлерді пайдалану және техникалық қызмет көрсету үшін қандай бағдарламалар бар? 
<variantright> жүйелік бағдарламалар
<variant> бағдарламалау жүйелері
<variant> аспаптық бағдарламалар
<variant> операциялық жүйе
<variant> қолданбалы бағдарламалар

<question1> компьютердің белгілі бір түрі үшін белгілі бір бағдарламалау тілінде бағдарламаларды жасауға және пайдалануға не арналған?
<variantright> бағдарламалау жүйелері
<variant> операциялық жүйе
<variant> жүйелік бағдарламалар
<variant> қолданбалы бағдарламалар
<variant> аспаптық бағдарламалар

<question1> күнделікті іс-әрекетте құжаттарды құру кезінде құрал ретінде қолданылатын бағдарламалар қалай аталады?
<variantright> аспаптық бағдарламалар
<variant> қолданбалы бағдарламалар
<variant> жүйелік бағдарламалар
<variant> операциялық жүйе
<variant> бағдарламалау жүйелері

<question1> пайдаланушының компьютерлік бағдарламалық процестермен өзара әрекеттесуін не қамтамасыз етеді?
<variantright> операциялық жүйе
<variant> жүйелік бағдарламалар
<variant> аспаптық бағдарламалар
<variant> утилитарлық бағдарламалар
<variant> бағдарламалау жүйелері

<question1> барлық компьютерлік құрылғылар мен процестерді қандай бағдарлама басқарады?
<variantright> операциялық жүйе
<variant> утилитарлық бағдарламалар
<variant> жүйелік бағдарламалар
<variant> бағдарламалау жүйелері
<variant> аспаптық бағдарламалар

<question1> жобаны іске асырудың негізінде қандай процесс жатыр 
<variantright> жоспарлау
<variant> жұмыс істеу
<variant> бағдарламалау 
<variant> жобалау
<variant> іске асыру

<question1> басқару технологиясын жобалауды қандай модель жүзеге асырады
<variantright> ақпараттық-технологиялық модель
<variant> математика-статикалық модель
<variant> графика-анимациялық модель
<variant> иммитациялық-ақпараттық модель
<variant> ақпараттық-техногендік модель

<question1> жобаның сипаттамалық қасиеті
<variantright> жұмыс кешені
<variant> жоспарды асыру
<variant> рәсімдер жасау
<variant> процестер
<variant> командалар

<question1> жобаның міндеттері мен соңғы нәтижелерін не анықтайды
<variantright> қамту саласы
<variant> уақыт сапасы
<variant> ақшаны үнемдеу
<variant> жұмыс ұзақтығы
<variant> жобаны жоспарлау

<question1> гантель диаграммасы дегеніміз не?
<variantright> онда әрбір жұмыс уақыт шкаласында орналасқан жолақ түрінде ұсынылады
<variant> microsoft project жобаны құру және жүргізу үшін әртүрлі құралдарды ұсынады
<variant> жұмыстар бір мезгілде аяқталады
<variant> бір жұмыс екінші жұмыс басталғанға дейін аяқталмайды 
<variant> басында аяқтау жүргізіледі 

<question1> объектіге бағытталған тәсілдің негізгі ұғымдары:
<variantright> объект және класс
<variant> объект және құрылым
<variant> семантика
<variant> синтаксис
<variant> белгілеу

<question1> объектілер мен кластар:
<variantright> пәндік аймақтың негізгі абстракциялары
<variant> нақты іс-әрекеттер немесе жұмыстардың атаулары
<variant> пәндік саланың негізгі мәні
<variant> пәндік саланың негізгі тәуелділіктері
<variant> пәндік саланы негізгі жалпылау

<question1> қандай 2 түрін диаграмма өзара іс-қимыл, бұл-
<variantright> реттілік диаграммалары және кооперативтік диаграммалар
<variant> мінез-құлық диаграммалары және бірлескен диаграммалар
<variant> класс диаграммалары және кооперативтік диаграммалар
<variant> жүйелілік диаграммалары және қызмет диаграммалары
<variant> реттілік диаграммалары және іске асыру диаграммалары

<question1> класс дегеніміз:
<variantright> жалпы құрылым мен мінез-құлықпен байланысты көптеген нысандар
<variant> жалпы құрылым мен мінез-құлыққа байланысты мәліметтер жиынтығы
<variant> құрылымның ортақтығына байланысты көптеген ақпарат
<variant> мінез-құлықтың ортақтығына байланысты көптеген хабарламалар
<variant> қойылған міндеттердің ортақтығымен байланысты атрибуттардың жиынтығы

<question1> прецеденттер:
<variantright> сыртқы актерлермен өзара әрекеттесу арқылы жүйе, ішкі жүйе немесе класс жүзеге асыра алатын uml тіліндегі әрекеттер тізбегінің сипаттамасы 
<variant> прецеденттермен немесе субъектілермен (жүйе, ішкі жүйе немесе класс) өзара әрекеттесу кезінде орындалатын uml-дегі логикалық байланысты рөлдердің жиынтығы.
<variant> әрекет етуші тұлғалардың барлығын немесе бір бөлігін, пайдалану жағдайларын және олардың жүйеде өзара іс-қимылын графикалық түрде көрсету
<variant> көптеген объектілерден және олардың арасындағы қатынастардан, соның ішінде олар алмасатын хабарламалардан тұратын өзара әрекеттесулерді сипаттайтын диаграмма
<variant> хабарламаларды қабылдайтын және жіберетін объектілердің құрылымдық ұйымдастырылуына басты назар аударылатын диаграмма

<question1> актер - бұл:
<variantright> прецеденттермен немесе нысандармен (жүйе, ішкі жүйе немесе класс) өзара әрекеттесу кезінде орындалатын uml-дегі логикалық байланысты рөлдердің жиынтығы
<variant> сыртқы актерлермен өзара әрекеттесу арқылы жүйе, ішкі жүйе немесе класс жүзеге асыра алатын uml тіліндегі әрекеттер тізбегінің сипаттамасы
<variant> әрекет етуші тұлғалардың барлығын немесе бір бөлігін, пайдалану жағдайларын және олардың жүйеде өзара іс-қимылын графикалық түрде көрсету
<variant> көптеген объектілерден және олардың арасындағы қатынастардан, соның ішінде олар алмасатын хабарламалардан тұратын өзара әрекеттесулерді сипаттайтын диаграмма
<variant> хабарламаларды қабылдайтын және жіберетін объектілердің құрылымдық ұйымдастырылуына басты назар аударылатын диаграмма

<question1> әрекет етуші - бұл ? бар мінез-құлық
<variantright> мәні 
<variant> қатынас
<variant> қауымдастық
<variant> прецендент
<variant> класс атауы

<question1> пайдалану жағдайының диаграммасы (case diagram қолданыңыз) - бұл:
<variantright> барлық немесе кейіпкерлердің бір бөлігін, пайдалану жағдайларын және олардың жүйеде өзара іс-қимылын графикалық түрде көрсету
<variant> олар алмасатын хабарламаларды қоса алғанда, көптеген объектілерден және олардың арасындағы қатынастардан тұратын өзара іс-қимылды сипаттайтын диаграмма
<variant> хабарламалардың уақытша реттілігіне назар аударатын диаграмма
<variant> хабарламаларды қабылдайтын және жіберетін объектілердің құрылымдық ұйымдастырылуына негізгі назар аударылатын диаграмма
<variant> класстар, интерфейстер, кооперациялар, сондай-ақ олардың арасындағы байланыстар жиынтығын көрсететін диаграмма

<question1> ақпараттық-техникалық модель дегеніміз не?
<variantright> бұл жобаны басқару мәселелерін шешудің тәртібі мен шарттары
<variant> бұл графиктегі көрсеткілер жұмыстарды, ал шыңдар оқиғаларды бейнелейді
<variant> бұл жұмыстың иерархиялық құрылымын құру
<variant> бұл орындаушылар мен жұмыс арасындағы байланысты талдайды
<variant> бұл жұмыстың одан әрі барысын болжау

<question1> ақпараттық-техникалық модельді әзірлеу ? кезеңдерден тұрады?
<variantright> 3
<variant> 4
<variant> 5
<variant> 2
<variant> 1

<question1> жоба жоспары -
<variantright> бұл жобаны басқарудың барлық функцияларын жоспарлау нәтижелерін қамтитын және жобаны орындау мен бақылау үшін негіз болып табылатын бірыңғай, дәйекті және келісілген құжат
<variant> бұл жобаны басқарудың барлық функцияларын жоспарлау нәтижелерін қамтитын және жобаны орындау мен бақылау үшін негіз болып табылатын бірыңғай, дәйекті және келісілген құжат болмайды
<variant> осы оқиғаға кіретін барлық жұмыстарды орындау нәтижесі, одан шығатын барлық жұмыстарды бастауға мүмкіндік береді; желілік матрицада оқиға, әдетте, үйірме түрінде белгіленеді
<variant> бұл жобаны басқару мәселелерін шешудің тәртібі мен шарттарының стандартталған сипаттамасын қамтитын басқару процесінің моделі
<variant> бұл қалыптасқан жағдайды ескере отырып, қойылған мақсаттарға жету үшін ең жақсы іс-қимыл әдісін анықтаудың үздіксіз процесі

<question1> жоспарлау -
<variantright> бұл қалыптасқан жағдайды ескере отырып, қойылған мақсаттарға жету үшін ең жақсы іс-қимыл әдісін анықтаудың үздіксіз процесі
<variant> бұл жобаны басқару міндеттерін шешудің тәртібі мен шарттарының стандартталған сипаттамасын қамтитын басқару процесінің моделі
<variant> бұл жобаны басқарудың барлық функцияларын жоспарлау нәтижелерін қамтитын және жобаны орындау мен бақылау үшін негіз болып табылатын бірыңғай, дәйекті және келісілген құжат
<variant> осы оқиғаға кіретін барлық жұмыстарды орындау нәтижесі, одан шығатын барлық жұмыстарды бастауға мүмкіндік береді; желілік матрицада оқиға, әдетте, үйірме түрінде белгіленеді
<variant> бұл негізгі мақсаты жобаның ұзақтығын минимумға дейін қысқарту болып табылатын әдістер

<question1> желілік жоспарлау әдістері -
<variantright> бұл негізгі мақсаты жобаның ұзақтығын минимумға дейін қысқарту болып табылатын әдістер
<variant> бұл жобаны басқарудың барлық функцияларын жоспарлау нәтижелерін қамтитын және жобаны орындау мен бақылау үшін негіз болып табылатын бірыңғай, дәйекті және келісілген құжат
<variant> бұл қалыптасқан жағдайды ескере отырып, қойылған мақсаттарға қол жеткізу үшін іс-қимылдың ең жақсы тәсілін айқындаудың үздіксіз процесі
<variant> осы оқиғаға кіретін барлық жұмыстарды орындау нәтижесі, одан шығатын барлық жұмыстарды бастауға мүмкіндік береді; желілік матрицада оқиға, әдетте, үйірме түрінде белгіленеді
<variant> іске асыру кезінде не істеу керек екендігі туралы өрескел түсінік жоба

<question1> жобаны құрылымдау процесі
<variantright> бұл жұмыстың иерархиялық құрылымын (isr) құру, яғни мақсатқа жету үшін орындалатын жұмыстарға дәйекті көп деңгейлі бөлу мақсаты
<variant> осы оқиғаға кіретін барлық жұмыстарды орындау нәтижесі, одан шығатын барлық жұмыстарды бастауға мүмкіндік береді; желілік матрицада оқиға, әдетте, үйірме түрінде белгіленеді
<variant> бұл қалыптасқан жағдайды ескере отырып, қойылған мақсаттарға қол жеткізу үшін іс-қимылдың ең жақсы тәсілін айқындаудың үздіксіз процесі
<variant> жобаны басқару технологиясын жобалауды жүзеге асыруға, яғни басқарушылық міндеттерді шешу реттілігі мен өзара байланысын белгілеуге көмектеседі
<variant> қолда бар ресурстарды неғұрлым тиімді пайдалану және мерзімдерді қысқарту үшін жоба бойынша жұмыстардың бүкіл кешенін орындаудың ғылыми негізделген үйлестірілген жоспарын дайындайды

<question1> ақпараттық-технологиялық модель (itm) -
<variantright> жобаны басқару технологиясын жобалауға, яғни басқарушылық міндеттерді шешудің дәйектілігі мен өзара байланысын белгілеуге көмектеседі
<variant> жобаны басқару жүйесінде осы матрицаны қолдана отырып, жоба командасында жобаның барлық қатысушыларының міндеттері, құқықтары мен жауапкершіліктерін бөлуге болады
<variant> орындаушылар мен жұмыс арасындағы өзара байланысты талдайды
<variant> жолдар атауларының бағандарында міндеттер, яғни жобаны басқару процесін құрайтын қызмет түрлері санамаланады
<variant> матрица өрісінде шартты белгілер кірістер мен шығулар жиынтығын байланыстыратын түрлендіру функцияларын білдіреді

<question1> жоспарлау дегеніміз не?
<variantright> бұл қалыптасқан жағдайды ескере отырып, қойылған мақсаттарға жету үшін ең жақсы іс-қимыл әдісін анықтаудың үздіксіз процесі
<variant> бұл негізгі мақсаты жобаның ұзақтығын минимумға дейін қысқарту болып табылатын әдістер
<variant> бұл жұмыстың иерархиялық құрылымын (isr) құру, яғни мақсатқа жету үшін орындалатын жұмыстарға дәйекті көп деңгейлі бөлу мақсаты
<variant> бұл негізгі мақсаты жобаның ұзақтығын минимумға дейін қысқарту болып табылатын әдістерге шолу
<variant> бұл жұмыстың иерархиялық құрылымын құру (иққ)

<question1> жобаны басқару тиімдірек болады ? 
<variantright> егер жұмыс құнын дәлірек жоспарлауға мүмкіндік берсе
<variant> енгізілген жұмыс кестесінің ұзақтығын белгілейді
<variant> task dependency (жұмысқа тәуелділік артқан жағдайда)
<variant> мерзімнен тыс уақыт бойынша тарифтік мөлшерлемелер
<variant> аспаптық құралдар - жұмыс уақытын өзгерту болса

<question1> бірінші кезең - бұл ?
<variantright> жоспарлау
<variant> жазу мәтіні
<variant> мазмұнын әзірлеу
<variant> беттеу
<variant> түсті бөлу

<question1> әзірлеудегі проблемалық аймақ анықтайды: 
<variantright> қауіпсіздік; деректер құрылымы, функционалдылық
<variant> шақыру кезектілігі; нышандық; қауіпсіздік
<variant> функцияны іске асыру; шақыру реті
<variant> шақыру реті; деректер құрылымы; аппараттық 
<variant> тестілік өңдеу; символдық; деректер құрылымы

<question1> жүйенің архитектурасы, оның функциялары, сыртқы жағдайлары, аппаратура мен бқ арасындағы функциялардың бөлінуі ? өмірлік цикл кезеңінде анықталады
<variantright> талаптарды талдау 
<variant> тексеру және тестілеу
<variant> тестілеу және талдау
<variant> жобалау 
<variant> сүйемелдеу

<question1> интерфейстер және адам мен жүйе арасындағы функциялардың таралуы ? өмірлік цикл кезеңінде анықталады
<variantright> талаптарды талдау 
<variant> тексеру және тестілеу
<variant> тестілеу және талдау
<variant> жобалау 
<variant> сүйемелдеу

<question1> d-талаптардың түрлері: 
<variantright> функционалдық талаптар; функционалдық емес талаптар
<variant> тиімділікке қойылатын талаптар; функционалдық емес талаптар
<variant> интерфейс талаптары; функционалдық талаптар
<variant> бағдарламалық талаптар; функционалдық талаптар
<variant> интерфейс талаптары; тиімділікке қойылатын талаптар

<question1> бағдарламалық жасақтаманы жобалау процесінде оны дамыту мен түрлендіруге бағдарлау; бағдарламалық құралдарды, модельдер мен прототиптерді жинақтау және қайта пайдалану; жобалау процесінде тәуекел мен шығындарды талдау ?
<variantright> спиральды модельдің артықшылықтары
<variant> имитациялық модельдің артықшылықтары
<variant> спиральды модельдің кемшіліктері
<variant> каскадты модельдің артықшылықтары
<variant> каскадты модельдің кемшіліктері

<question1> модельдеу кезінде белсенділік диаграммалары қолданылады: 
<variantright> бизнес-процестерді; технологиялық процестерді
<variant> бизнес-процестерді;технологиялық ағындарды
<variant> мінез - құлық; дәйекті және қатар әрекеттер
<variant> жүйелі және қатар іс-қимылдар; функциялар 
<variant> технологиялық процестерді; мінез-құлықты; функцияларды

<question1> класстың негізгі стереотиптері:
<variantright> шекаралық элемент; мәні; басқару элементі
<variant> шекаралық элемент; мәні; бағынышты элемент
<variant> интерфейс элементі; мәні; басқару элементі
<variant> басқарушы элемент; тәуелсіз элемент; байланыстар
<variant> тәуелсіз элемент; бағынышты элемент; байланыстар

<question1> класстар ортақ объектілер жиынтығын сипаттауға мүмкіндік береді ? 
<variantright> атрибуттар; операциялар; қатынастар және семантика
<variant> атрибуттармен; компоненттермен және класстармен; интерфейстермен
<variant> пакеттермен; қатынастармен және семантикамен; байланыстармен
<variant> компоненттермен және тораптармен; интерфейстермен; пакеттермен
<variant> операциялармен; компоненттермен және тораптармен; процестермен

<question1> «объект-байланыс» (erd) деректерді модельдеу диаграммасы келесілерден тұрады: 
<variantright> нысандар; атрибуттар; байланыстар
<variant> мәні; объектілер; операциялар
<variant> атрибуттар; класстар; объектілер
<variant> байланыстар; объектілер; субъектілер
<variant> класстар; объектілер; кіші класстар

<question1> uml тұжырымдамалық моделі құрамдас бөліктерді қамтиды: 
<variantright> блоктардың өзара үйлесімін анықтайтын ережелер
<variant> өзара модельдің жалпы және аралық механизмдері
<variant> модельдер мен блоктардың механизмдерін анықтайтын ережелер
<variant> кеңейту тетіктерін анықтайтын ережелер
<variant> класстар мен компоненттерді анықтайтын ережелер

<question1> мінез-құлық элементтері ішкі пакеттерден тұрады: 
<variantright> пайдалану нұсқалары және автоматтар; кооперациялар; жалпы мінез-құлық
<variant> реттілік; пайдалану нұсқалары және автоматтар; мінез-құлық
<variant> орналастыру; кооперациялар; пайдалану нұсқалары және автоматтар
<variant> жалпы мінез-құлық; араластыру; кооперация; жалпы компоненттер
<variant> жүйелілік; пайдалану нұсқалары және автоматтар; класстар

<question1> жоба технологиялық қызметтен ерекшеленеді ?
<variantright> олар қайталанады және жоба ерекше, әрқашан басталу және аяқталу күні болады
<variant> жоба үздіксіз қызмет, ал процесс-бір реттік іс-шара болып табылады
<variant> жоба ұйымның өзгермейтіндігін қолдайды, ал процестер оның өзгеруіне ықпал етеді
<variant> ұйымдағы процестер құжатпен регламенттеледі
<variant> жобалар құжаттамалық ресімдеуді талап етпейді

<question1> жобаны әзірлеу сатысында
<variantright> жоба ресурстарының 9-15% жұмсалады
<variant> жоба ресурстарының 65-80% жұмсалады
<variant> жоба ресурстары жұмсалмайды
<variant> барлық ресурстар жұмсалады
<variant> жоба ресурстарының 50% жұмсалады

<question1> жоба - бұл ?
<variantright> уақыт бойынша шектелген, нәтижелердің сапасына белгіленген талаптармен, қаражатты жұмсау шектеулерімен және ерекше ұйыммен жеке жүйені мақсатты түрде өзгерту
<variant> жоспарланған іс-шараны іске асыру жөніндегі инженерлік, техникалық, ұйымдастыру-құқықтық құжаттама
<variant> алдына қойылған мақсаттарға қол жеткізу мақсатында біртұтас ретінде әрекет ете алатындай етіп ұйымдастырылған элементтер тобы
<variant> алға қойылған мақсатқа қол жеткізу мақсатында өндірісі қамтамасыз етілуге тиіс жұмыстардың, өнімдер мен көрсетілетін қызметтердің жиынтығы
<variant> алдына қойылған мақсаттарға қол жеткізу мақсатында адамдарды да, техникалық элементтерді де қамтиды

<question1> project expert жүйесі мүмкіндік береді? 
<variantright> кәсіпорынды дамытудың оңтайлы жолын таңдау
<variant> кәсіпорынды өндірістік қорлармен қамтамасыз ету
<variant> технологиялық процестерді компьютерлендіру
<variant> функционалдық міндеттерді шешуді автоматтандыру
<variant> басқару объектілері арасында байланыс орнатады

<question1> project expert жүйесі арқылы менеджерлер? 
<variantright> кәсіпорынды қаржыландырудың оңтайлы схемасы
<variant> басқару объектілері арасында байланыс орнатады
<variant> технологиялық желілерді басқарады
<variant> бөлімшелерде айналымдағы ақпаратты талдайды
<variant> кәсіпорынды өндірістік қорлармен қамтамасыз етеді

<question1> project expert жүйесін модельдеу блогы мыналарды қамтиды? 
<variantright> жоспарды қалыптастыру модулі
<variant> сезімталдықты талдау модулі
<variant> пайда мен шығындар туралы есеп
<variant> жобаны нұсқалық талдау модулі
<variant> пайданы пайдалану туралы есеп

<question1> project expert жүйесінің талдау блогы мыналарды қамтиды? 
<variantright> жобаның тиімділігін талдау модулі
<variant> жобаның инвестициялық жоспарын қалыптастыру модулі
<variant> пайданы пайдалану туралы есеп
<variant> бизнес-жоспарды түзету және құру модулі
<variant> жобаны нұсқалық талдау модулі

<question1> project expert жүйесін басқару блогы мыналарды қамтиды? 
<variantright> ақша түсімдерін өзектендіру модулі
<variant> ұйымның операциялық жоспарын қалыптастыру модулі
<variant> статистикалық талдау модулі
<variant> графиктер мен диаграммаларды құру модулі
<variant> стандартты қаржылық көрсеткіштерді есептеу модулі

<question1> project expert жүйесінің есеп беру блогына мыналар кіреді? 
<variantright> бизнес-жоспарды редакциялау және құру модулі
<variant> макроэкономикалық ортаны сипаттау модулі
<variant> стандартты қаржылық көрсеткіштерді есептеу модулі
<variant> ақша түсімдерін өзектендіру модулі
<variant> статистикалық талдау модулі

<question1> project expert жүйесімен жұмыс мыналарды қамтиды?
<variantright> модель құру
<variant> басқару объектілері арасында байланыс орнату
<variant> өнім өндірудің технологиялық карталарын әзірлеу
<variant> басқарушылық шешімдер қабылдау рәсімдерін әзірлеу
<variant> статистикалық талдау

<question1> өмірлік цикл құрамындағы процестердің саны мен түрлері:
<variantright> 5 негізгі; 4 ұйымдастырушылық; 8 қосалқы
<variant> 4 негізгі; 5 ұйымдастырушылық; 8 қосалқы
<variant> 5 негізгі; 8 ұйымдастырушылық; 5 қосалқы
<variant> 3 негізгі; 4 ұйымдастырушылық; 5 қосалқы
<variant> 8 негізгі; 4 ұйымдастырушылық; 3 қосалқы

<question1> rational rose ортасында тұрақтылық нұсқалары қолданылады:
<variantright> тұрақты; уақытша
<variant> уақытша; серпінді
<variant> статикалық; динамикалық
<variant> уақытша; статикалық
<variant> тұрақты; статикалық

<question1> бағдарламалық жасақтаманы әзірлеуге, пайдалануға және сүйемелдеуге қатаң жүйелі сандық тәсілді қолдануды зерттейтін пән ?
<variantright> бағдарламалық инженерия
<variant> ақпараттық жүйе
<variant> компьютерлік жүйе
<variant> бағдарламалық кешендер
<variant> аспаптық құралдар

<question1> стандартты кіші бағдарламалардың объектілік модульдерінен жүктеу модулін құрайтын бағдарлама
<variantright> құрастырушы
<variant> транслятор
<variant> анализатор
<variant> редактор
<variant> жөндеуші

<question1> case-құралдар келесі белгілер бойынша жіктеледі: 
<variantright> қолжетімді платформалар бойынша
<variant> қолданылатын диаграммалар бойынша
<variant> процестер саны бойынша
<variant> пайдаланылған нысандар саны бойынша
<variant> қажетті ресурстар саны бойынша

<question1> dfd деректер ағындарының диаграммаларының негізгі компоненттеріне не жатады? 
<variantright> ішкі нысандар
<variant> деректер жинағыштары
<variant> процестер
<variant> сыртқы объектілер 
<variant> сақтау

<question1> uml-дегі прецеденттер арасындағы қатынастардың түрлері:
<variantright> include; extend
<variant> interface; extend
<variant> dependency; extend
<variant> include; interface
<variant> include; dependency

<question1> uml белгілеуіндегі класстың негізгі стереотиптеріне мыналар жатады:
<variantright> entity (мәні); boundary (шекара); control (басқару)
<variant> функциялар (жұмыстар); entity (мәні); boundary (шекарасы)
<variant> деректер жинақтауыштары (сақтау орындары); функциялары (жұмыстары)
<variant> boundary (шекара); control (басқару); функциялар (жұмыстар)
<variant> operation (операциялар); entity (мәні); control (басқару)

<question1> өмірлік цикл модельдерінің түрлері:
<variantright> спиральды және каскадты модель
<variant> имитациялық және каскадты модель
<variant> спиральды және баспалдақ моделі
<variant> спиральды және интеграциялық модель
<variant> каскадты және интеграциялық модель

<question1> rad әдіснамасы бойынша өмірлік цикл фазалардан тұрады: 
<variantright> талаптарды талдау және жоспарлау; жобалау; құру және енгізу
<variant> талаптарды талдау және жоспарлау; жобалау; тексеру және тестілеу
<variant> тексеру және тестілеу; өмірлік цикл; талаптарды жоспарлау
<variant> құру және енгізу; тексеру және тестілеу; өмірлік цикл;
<variant> талаптарды талдау және жоспарлау; жобалау; тексеру және жөндеу

<question1> case құралдарының негізгі артықшылықтары: 
<variantright> әзірлеу уақытын азайту; модификациялау кезінде жеңілдету
<variant> әзірлеу уақытын ұлғайту; модификациялау кезінде жеңілдету
<variant> деректерге қолжетімділіктің күрделенуі; әзірлеуге уақыттың азаюы
<variant> деректерге қол жеткізудің күрделенуі; түрлендіру кезінде жеңілдету
<variant> әзірлеу, тестілеу және енгізу уақытын азайту

<question1> uml тілінде анықталған көріну деңгейлері: 
<variantright> protected (қорғалған)
<variant> addonly (тек қосылған)
<variant> instance (дана)
<variant> frozen (мұздатылған)
<variant> classifier (классификатор)

<question1> swebok мақсаты (бағдарламалық қамтамасыздандырды жасау денесі) - ?
<variantright> бағдарламалық қамтамасыз ету инженериясында білімді біріктіру
<variant> бағдарламалық жасақтама класының негізгі стереотиптері
<variant> бірыңғай модельдеу тілінде жасалынған бағдарлама
<variant> жүктеу модулін қалыптастыратын бағдарлама
<variant> жүйе сөздігін модельдеу процесінде сипаттау нысаны

<question1> swebok (software engineering body of knowledge) білімінің өзегі ?
<variantright> ieee әзірлеген нормативтік құжат
<variant> ansi әзірлеген нормативтік құжат
<variant> бағдарламалық құжатты жазу стандарты
<variant> жүктеу модулін қалыптастыратын бағдарлама
<variant> жүйе сөздігін модельдеу процесі

<question1> бағдарламалық қамтамасыздандыруды жасау процесі ?
<variantright> swebok білімінің ұйымдастырушылық салалары
<variant> бірыңғай модельдеу тілін бағдарлама тіліне аудару
<variant> ansi білімінің ұйымдастырушылық салалары
<variant> жүктеу модулін қалыптастыратын бағдарлама
<variant> жүйе сөздігін модельдеу процесі

<question1> құрылысты басқару, жобаларды басқару жатады ?
<variantright> swebok білімінің ұйымдастырушылық салалары
<variant> swebok білімінің негізгі салалары
<variant> ansi білімінің ұйымдастырушылық салалары
<variant> ansi білімінің негізгі салалары 
<variant> model mart білімінің ұйымдастырушылық салалары

<question1> инженерлік талаптар, бағдарламалық қамтамасыз етуді жобалау жатады ?
<variantright> swebok білімінің негізгі салалары
<variant> swebok білімінің ұйымдастырушылық салалары
<variant> ansi білімінің ұйымдастырушылық салалары
<variant> ansi білімінің негізгі салалары 
<variant> model mart білімінің ұйымдастырушылық салалары

<question1> бқ тестілеу және сүйемелдеу келесілерге жатады ?
<variantright> swebok білімінің негізгі салалары
<variant> swebok білімінің ұйымдастырушылық салалары
<variant> ansi білімінің ұйымдастырушылық салалары
<variant> ansi білімінің негізгі салалары 
<variant> model mart білімінің ұйымдастырушылық салалары

<question1> бағдарламалық қамтамасыздандыруды жобалау әдістемесімен анықталған барлық жұмыстарды орындауға мүмкіндік беретін бағдарламалар ?
<variantright> бағдарламалық құралды әзірлеу құралдары 
<variant> ansi корпорациясы әзірлеген нормативтік құжат
<variant> бағдарламалық құжатты жазу стандарты
<variant> жүктеу модулін қалыптастыратын бағдарламалар
<variant> жүйе сөздігін модельдеу бағдарламалары

<question1> project expert модулінің терезесінде актуалдылық ? құралдардың түрлері бойынша нақты деректерді енгізуге арналған карточкалар 
<variantright> 12
<variant> 10
<variant> 11
<variant> 14
<variant> 15

<question1> project expert бөлімінде актуалдылық бөлімінде қанша модуль бар 
<variantright> 3
<variant> 5
<variant> 1
<variant> 2
<variant> 4

<question1> project expert-те жобаны талдау бөлімінде қанша модульдері бар
<variantright> 9
<variant> 3
<variant> 8
<variant> 6
<variant> 7

<question1> project expert-те жоба бөлімі қанша модульдер бар
<variantright> 6
<variant> 8
<variant> 9
<variant> 7
<variant> 5

<question1> жүйелік жобалау кезеңінде 
<variantright> ақпараттық жүйенің әрбір элементі бойынша егжей-тегжейлі ерекшеліктер жасалуы тиіс 
<variant> жұмысқа қабілетті ақпараттық жүйе құрылуға тиіс 
<variant> болашақ ақпараттық жүйеге қойылатын функционалдық талаптар тұжырымдалуы тиіс 
<variant> ақпараттық жүйені іске асыру (жүзеге асыру) мүмкіндігі туралы қорытынды тұжырымдалуы тиіс 
<variant> бағдарламалық қамтамасыз ету инженериясы бойынша білімді біріктіру

<question1> жүйелі зерттеулер кезеңінде 
<variantright> ақпараттық жүйені іске асыру мүмкіндігі туралы қорытынды тұжырымдалуы тиіс 
<variant> жұмысқа қабілетті ақпараттық жүйе құрылуға тиіс 
<variant> болашақ ақпараттық жүйеге қойылатын функционалдық талаптар тұжырымдалуы тиіс 
<variant> ақпараттық жүйенің әрбір элементі бойынша егжей-тегжейлі ерекшеліктер жасалуы тиіс 
<variant> бағдарламалық қамтамасыз ету инженериясы бойынша білімді біріктіру

<question1> жүйелік талдау кезеңінде 
<variantright> болашақ ақпараттық жүйеге қойылатын функционалдық талаптар тұжырымдалуы тиіс 
<variant> жұмысқа қабілетті ақпараттық жүйе құрылуға тиіс 
<variant> ақпараттық жүйенің әрбір элементі бойынша егжей-тегжейлі ерекшеліктер жасалуы тиіс 
<variant> ақпараттық жүйені іске асыру мүмкіндігі туралы қорытынды тұжырымдалуы тиіс 
<variant> бағдарламалық қамтамасыз ету инженериясы бойынша білімді біріктіру

<question1> project expert арналған 
<variantright> жұмыс істеп тұрған кәсіпорынның қаржылық моделін құру 
<variant> клиенттермен қарым-қатынасты басқаруды автоматтандыру 
<variant> пректтерді басқаруды автоматтандыру 
<variant> процесс моделін құру 
<variant> деректер моделін құру

<question1> microsoft project арналған 
<variantright> жобаларды басқаруды автоматтандыру 
<variant> клиенттермен қарым-қатынасты басқаруды автоматтандыру 
<variant> жаңа немесе жұмыс істеп тұрған кәсіпорынның қаржылық моделін құру 
<variant> процесс моделін құру 
<variant> деректер моделін құру

<question1> инвестициялық талдау мен жобалауды автоматтандыру жүйелеріне мыналар жатады 
<variantright> project expert 
<variant> 1с-кәсіпорын 
<variant> кеңесші + 
<variant> microsoft project 
<variant> галактика

<question1> project expert-те нәтижелер бөлімі неше модульді қамтиды 
<variantright> 9
<variant> 5
<variant> 2
<variant> 8
<variant> 6

<question1> project expert-те қаржыландыру бөлімінде неше модульдер бар 
<variantright> 8
<variant> 5
<variant> 4
<variant> 2
<variant> 7

<question1> project expert бөлімінде актуалдылық келесі модульдерді біріктіреді
<variantright> өзектендіру
<variant> бизнесті бағалау
<variant> өткізу жоспары
<variant> есеп
<variant> нәтижелер

<question1> project expert-те жобаны талдау бөлімі келесі модульдерді біріктіреді
<variantright> қаржылық көрсеткіштер
<variant> пайда-шығындар
<variant> акционерлік капитал
<variant> өндіріс жоспары
<variant> компания

<question1> project expert бөлімінде операциялық жоспар модульдерді біріктіреді
<variantright> өндіріс жоспары
<variant> пайда-шығындар
<variant> акционерлік капитал
<variant> компания
<variant> өзектендіру

<question1> project expert-те нәтижелер бөлімі келесі модульдерді біріктіреді
<variantright> пайда-шығындар
<variant> өндіріс жоспары
<variant> акционерлік капитал
<variant> валюта
<variant> cash flow

<question1> project expert-те қаржыландыру бөлімі келесі модульдерді біріктіреді
<variantright> акционерлік капитал
<variant> жоба
<variant> қоршаған орта
<variant> өзектендіру
<variant> валюта

<question2> project expert жаңа жобаны, файлдарды құруға қажетті негізгі ақпаратты қамтиды
<variantright> шаблондар
<variant> кітапханалар
<variant> жобалар
<variant> прототиптер
<variant> сәйкессіздік

<question2> project expert -те деректерді жаңарту келесідей мүмкіндікке ие болады
<variantright> егжей-тегжейлі
<variant> жалпы-жеке
<variant> сәйкессіздік
<variant> ескерту
<variant> тізім

<question2> жоба сарапшысында жаңарту модулінің диалогтық терезесінің әр картасында келесідей жұмыс аймақтары бар
<variantright> үстел
<variant> ескерту
<variant> тізім
<variant> жолдар
<variant> жасушалар

<question2> project expert-те бөлімнің басына кәсіпорынның қаржылық-экономикалық жағдайы туралы мәліметтер енгізіледі.
<variantright> компания
<variant> жоба
<variant> қоршаған орта
<variant> жаңарту
<variant> пайда мен залал

<question2> жоба сарапшысында жобаны талдау бөлімінің сезімталдылықты талдау диалогтық терезесінде басқару түймелері мен жұмыс аймақтары бар.
<variantright> қорытынды кесте
<variant> бастапқы баланс
<variant> кәсіпкерлікті бағалау
<variant> қаражатты алу
<variant> шаблондар

<question2> project expert-те жобаны іске асыру жоспарланған қаржылық-экономикалық ортаны сипаттау үшін бөлім
<variantright> қоршаған орта
<variant> жоба
<variant> компания
<variant> жаңарту
<variant> инвестициялық көрсеткіштер

<question2> project expert-те жобаны ашқаннан кейінгі бөлім
<variantright> жоба
<variant> компания
<variant> қоршаған орта
<variant> жаңарту
<variant> инвестициялық жоспар

<question2> project expert-те жобаны іске асыруға байланысты дайындық жұмыстары ? бөлімде сипатталған
<variantright> инвестициялық жоспар
<variant> жоба
<variant> компания
<variant> операциялық жоспар
<variant> нәтижелер

<question2> жоба сарапшысы диалогтық терезесі картаның қандай мүшесінің кірісін талдау нәтижелерінде көрсетеді?
<variantright> инвестициялық көрсеткіштер
<variant> бөлімге қатысушылардың табысы
<variant> жобаны талдау
<variant> қаражатты алу
<variant> бизнесті бағалау

<question2> project expert әр түрлі жобаларда, файлдарда қолданылатын деректерді сақтауға арналған
<variantright> кітапханалар
<variant> шаблондар
<variant> жобалар
<variant> прототиптер
<variant> кестелер

<question2> project expert-те толық қаржылық модель құру кезінде пайдаланушы операциялық қызметтің стратегиясын сипаттайды, өндірілген өнімді сату туралы, кәсіпорынның өндірістік қызметі кезеңіне жататын тұрақты және өзгермелі шығындар туралы деректерді енгізуді, өткізуді не сипаттайды.
<variantright> операциялық жоспар
<variant> жоба
<variant> компания
<variant> инвестициялық жоспар
<variant> нәтижелер

<question2> project expert бағдарламасында бағдарламамен бірге жеткізілетін стандартты үлгіні қолдану арқылы жаңа жобаны құруды едәуір жеделдетуге болады
<variantright> normal.pet
<variant> normal.рех
<variant> project.pet
<variant> project.рех
<variant> project.реl

<question2> project expert-те бөлім жоспарының орындалуын бақылауды ақпараттық қолдау үшін қолданылады
<variantright> өзектендіру
<variant> нәтижелер
<variant> жоба
<variant> жобаны талдау
<variant> инвестициялық жоспар

<question2> project expert-те кез келген қаржылық модельдеу құралдарына қол жеткізу арқылы жүзеге асады
<variantright> мазмұн терезесі
<variant> жоба мәзірі бөлімі
<variant> құралдар тақтасы
<variant> құралдар мәзірі
<variant> файл мәзірі

<question2> жоба сарапшысы шығындар мен кірістердің сату көлеміне тәуелділігін зерттейді, ол сату көлемін көрсетеді, онда шығындар өнімді, модульді сатудан түскен табысты толығымен жабады. жобаны талдау бөлімі
<variantright> шығындарды талдау
<variant> кәсіпкерлік қызметті бағалау
<variant> қаржылық көрсеткіштер
<variant> қатысушылардың табысы
<variant> пайда мен залал

<question2> project expert бағдарламасында негізгі мәзірдің барлығын жабу командасы функционалдық пернелермен қайталанады
<variantright> shift + f8
<variant> shift + f3
<variant> ctrl + z
<variant> ctrl + o
<variant> ctrl + d

<question2> project expert-те мәзір бөлімінде мазмұны, қолданылуы, бағдарлама туралы командалары берілген
<variantright> көмек
<variant> қызмет
<variant> нәтижелер
<variant> терезе
<variant> қоршаған орта

<question2> project expert-те деректерді экспорттау және импорттау процедураларын бастайтын командалар мәзір бөлімін қамтиды
<variantright> алмасу
<variant> нәтижелер
<variant> жоба
<variant> қызмет
<variant> талдау

<question2> project expert бағдарламасында файлдармен жұмыс істеу және есептерді басып шығару командалары мәзір бөлімінде топтастырылған
<variantright> жоба
<variant> нәтижелер
<variant> айырбас
<variant> қызмет
<variant> талдау

<question2> project expert-те «жобаны талдау» бөлімінің сезімталдылықты талдау модулі өнімділік көрсеткіштерінің сезімталдығын талдау негізінде басқа да бірқатар факторлардың мәндерінің өзгеруіне талдау жасайды.
<variantright> біржақты талдау
<variant> көп айнымалы «егер не» анализі
<variant> gap талдау
<variant> «бір адамға» талдау әдісі
<variant> «көптен көпке» талдаудың бір жақты әдісі

<question2> project expert қосымша тізімнен таңдалған кестелерді құру және қарау мүмкіндігін, сондай-ақ пайдаланушының өзі анықтаған құрылымы бар кестелерді құру мүмкіндігін ұсынатын ? нәтижелер мәзірі
<variantright> орта контур
<variant> жоғарғы контур
<variant> қайта есептеу
<variant> сүзгі командасы
<variant> төменгі контур

<question2> project expert негізгі құжаттарды және оларға сәйкес кестелерді қалыптастыруды және қарауды қамтамасыз ететін ? нәтижелер мәзірі
<variantright> жоғарғы контур
<variant> орта контур опциялары
<variant> қайта есептеу опциясы
<variant> сүзгі командасы
<variant> төменгі контур

<question2> project expert-те жобаның орындалуын бақылауға байланысты негізгі әрекеттер жобаның бағдарламалық модульдерімен қамтамасыз етіледі
<variantright> өзектендіру
<variant> жобаны талдау
<variant> қаржыландыру
<variant> инвестициялық жоспар
<variant> нәтиже

<question2> жоба сарапшысы жобаның екі күйін талдауға арналған: сақталған және ағымдағы, модуль ? жобаны талдау бөлімі
<variantright> өзгерістерді талдау
<variant> бизнесті бағалау
<variant> қаржылық көрсеткіштер
<variant> шығынсыздықты талдау
<variant> инвестицияларды бағалау

<question2> project expert-те есептеу көкжиегі шегінде компанияның (жобаның) болжамды құнының өзгеру динамикасын есептеу және графикалық түрде ұсыну модульге мүмкіндік береді ?.. жобаны талдау бөлімі
<variantright> бизнесті бағалау
<variant> монте-карло
<variant> өзгерістерді талдау
<variant> инвестициялардың тиімділігі
<variant> инвестицияларды талдау

<question2> жоба сарапшысы модуль жобаларын талдау кезінде пайдаланушының жұмысын автоматтандыруға қызмет етеді
<variantright> сараптамалық қорытынды
<variant> жоба бөлімін есептеуді баптау
<variant> жоба бөлімінің деректерін көрсету
<variant> нәтижелер бөлімінің есебі
<variant> талдау бөлімін есептеуді теңшеу

<question2> project expert-те бағдарламаның экран формаларын орналастыру параметрлерін анықтайтын командалар, мәзір бөлімі бар
<variantright> терезе
<variant> анықтама
<variant> қызмет
<variant> нәтижелер
<variant> файл

<question2> project expert-те модуль стандартты емес форматтағы есептерді жасауға мүмкіндік береді
<variantright> бөлім пайдаланушысының кестесі
<variant> жоба бөлімін есептеуді баптау
<variant> жоба бөлімінің деректерін көрсету
<variant> нәтижелер бөлімінің есебі
<variant> талдау бөлімінің деректерін көрсету

<question2> жоба менеджері немесе кәсіпорын project expert-те деректерді жаңарту қолданылады
<variantright> толық
<variant> cash flow
<variant> жалпы
<variant> келіспеушілік
<variant> келісу

<question2> гант диаграммасында әр жұмыс қалай көрінеді?
<variantright> уақыт шкаласында сызық
<variant> сызық ұзындығы
<variant> уақыт шкаласы
<variant> мектепте орналасқан желі 
<variant> сызықтық кесте

<question2> бж өндірушілеріне қажетті ұсыныстар мен нұсқаулықтар беріледі
<variantright> смм/cmmi әдістемесі
<variant> iso 15288 стандарты
<variant> iso 9000 стандарты 
<variant> posix стандарты 
<variant> smm (материалдық модель) 

<question2> конфигурацияны басқару?
<variantright> 2, 3, 4, 5, 6 тұжырымдамалар 
<variant> 1 тұжырымдамасы
<variant> өнімді сипаттайтын
<variant> 7 тұжырымдамасы
<variant> 8 және 9 тұжырымдамалар

<question2> жүйенің жетілуін бағалау жүйесі мен моделі
<variantright> smm (материалдық модель) 
<variant> iso 15288 стандарты
<variant> iso 9000 стандарты 
<variant> posix стандарты 
<variant> смм/cmmi әдістемесі

<question2> менеджердің шешім қабылдауды қолдау жүйесімен жұмысының қорытынды ақпараттық өнімдері (sppr) project expert бөлім ұсынады
<variantright> нәтижелер
<variant> қаржыландыру
<variant> жобаны талдау
<variant> өзектендіру
<variant> компания

<question2> шешімді қолдау генераторлары (gppr) соңғы пайдаланушының есептеулерін қамтамасыз ету үшін бірнеше әмбебап аналитикалық құралдармен жабдықталған электрондық кестелерді қамтиды
<variantright> мамандандырылған
<variant> әмбебап
<variant> егжей-тегжейлі
<variant> негізгі
<variant> қосымша

<question2> project expert қаржыландыру бөліміне өтуге болады
<variantright> жобадағы капиталда есеп айырысу жүргізілген кезде
<variant> кез келген сәтте
<variant> жоба қашан жасалды
<variant> нәтижелер бөлімі пайдаланушысының кестесі кезде
<variant> жобаның басындағы барлық деректер енгізілген кезде

<question2> project expert бағдарламасында монте-карло әдісін іске асыру кезінде статистикалық нәтижелерді сандық бағалау мынадай өлшемшарттар бойынша жүзеге асырылады:
<variantright> орташа мән
<variant> математикалық күту
<variant> дисперсия
<variant> математикалық талдау
<variant> максималды мәні

<question2> project expert бағдарламасы әдепкі бойынша орнатылады ? тәжірибе
<variantright> 1000
<variant> 100
<variant> 10 000
<variant> 10
<variant> 1

<question2> қаржылық жоспарлау технологиясында project expert модульдері кәсіпорынның қаржылық моделін құру кезеңін қолдайды
<variantright> инвестициялық жоспар
<variant> қаржыландыру
<variant> өзектендіру
<variant> қызмет
<variant> дисконттау

<question2> мәндер арасындағы тәуелділіктің графикалық бейнесі
<variantright> диаграмма
<variant> құрал дәрежесі
<variant> кесте
<variant> шамамен функция
<variant> жоспар

<question2> project expert кітапхана файлдары ? кеңейтімге ие
<variantright> pel
<variant> рех
<variant> pet
<variant> phf
<variant> реѕ

<question2> электронды кестелер санатына жатады
<variantright> бірінші деңгейдегі шешімдерді қолдау үшін шектеулі генераторлар
<variant> екінші деңгейдегі шешімдерді қабылдауды қолдаудың шектеулі генераторлары
<variant> бірінші деңгейдегі шешімдерді қолдау үшін шексіз генераторлар
<variant> қаржылық шешімдер қабылдауды қолдаудың дамыған мамандандырылған генераторлары
<variant> функционалдық - мамандандырылған компьютерлік құралдар

<question2> кез-келген материалдық жүйенің өмірлік цикліне қандай кезеңдер кіреді?
<variantright> енгізу, өсу, жетілу және құлдырау
<variant> жетілу, қанықтыру және құлдырау
<variant> жетілу, қанықтыру және құлдырау жолдары
<variant> өсу, құлдырау және құлдырау
<variant> енгізу, өсу және құлдырау

<question2> инновациялық өнімді өндірудің өмірлік циклінің қай кезеңі "өндірістің тез өсуімен, өндірістік қуаттылықтың едәуір артуымен және технологиялық процестің реттелуімен сипатталады"?
<variantright> өнеркәсіптік игеру
<variant> жаңалықтарды енгізу
<variant> көтеру
<variant> өтеу және тұрақтандыру
<variant> солу және құлдырау

<question2> болашақ ақша ағындарын бүгінгі құнға келтіру үшін қолданылатын коэффициент қалай аталады?
<variantright> дисконттау коэффициенті
<variant> салыстыру мөлшерлемесі
<variant> капиталдандыру коэффициенті
<variant> келтіру коэффициенті
<variant> табыстылық коэффициенті

<question2> егер сіз жобаны есептеу көкжиегін азайтсаңыз, интегралдық көрсеткіштер (npv, pi) қалай өзгереді?
<variantright> азаяды
<variant> өседі
<variant> бұрынғы деңгейде қалады (өзгермейді)
<variant> басында ұлғаяды соңында азаяды
<variant> басында азаяды соңында көбейеді

<question2> project expert жүйесінде қаржылық жоспар құжаттары қандай стандартта ұсынылған?
<variantright> бухгалтерлік есеп стандарттарында
<variant> халықаралық бухгалтерлік есеп жүйесінің стандарттарында (ias немесе gaap)
<variant> екі стандарт бойынша
<variant> салық салу туралы стандарттарда
<variant> ешқандай стандарттарда жоқ

<question2> төменде көрсетілгендердің қайсысы өмірлік циклдің бастапқы кезеңіне жатады?
<variantright> ғзж техникалық тапсырмасын әзірлеу
<variant> экономикалық тапсырманы әзірлеу
<variant> ғзж техникалық-экономикалық тапсырмасын әзірлеу
<variant> коммерциялық бөлігін әзірлеу
<variant> қарым-қатынастық тапсырманы әзірлеу

<question2> сапаны бақылаудың қай әдісі тиімді?
<variantright> таңдамалы
<variant> коммутативті
<variant> диффузиялық
<variant> радикалды
<variant> венчурлық

<question2> төменде көрсетілгендердің қайсысы өмірлік циклдің екінші кезеңіне жатады?
<variantright> теориялық және эксперименттік зерттеулер
<variant> технологиялық және коммутативті
<variant> диффузды және радикалды
<variant> теориялық және практикалық зерттеулер
<variant> тыңдалым және жобалық

<question2> project expert жүйесінде қаржы моделін құрудың негізгі мақсаты?
<variantright> бизнес-жоспарды әзірлеу
<variant> инновация енгізілгеннен кейін жылдық есепті әзірлеу
<variant> ескі өнімді сату жоспарын әзірлеу
<variant> бюджетті есептеу және инвестицияларға қажеттілік
<variant> жалақы қорын есептеу

<question2> project expert-те қандай дисконттау мөлшерлемесін таңдау керек?
<variantright> жылдық
<variant> тоқсандық
<variant> айлық
<variant> бүкіл кезең үшін 
<variant> 3 жыл үшін

<question2> объектіге бағытталған талдау мен жобалаудың құралдарына мыналар жатады:
<variantright> rational rose; ms visio; aris 
<variant> rational professional bundle; aris
<variant> model mart; idef0; jam
<variant> erwin; bpwin; idef0
<variant> rational rose; erwin; bpwin

<question2> tmainmenu компоненті не үшін арналған?
<variantright> негізгі мәзірді құру
<variant> қалқымалы мәзірлерді құру
<variant> мәтінді экранда көрсету
<variant> мәтінмәндік мәзірді құру
<variant> мәтінді пішінде көрсету

<question2> tpopupmenu компоненті не үшін арналған?
<variantright> контексті мәзірді құру
<variant> қалқымалы мәзірлерді құру
<variant> мәтінді экранда көрсету
<variant> негізгі мәзірді құру
<variant> мәтінді пішінде көрсету

<question2> tapplicationevents компоненті не үшін арналған?
<variantright> қолданба деңгейіндегі оқиғаларды бақылайды
<variant> мәтінді формада көрсетуге арналған
<variant> айналдырылатын тізімді көрсетуге мүмкіндік береді
<variant> күй жолағын жасауға мүмкіндік береді
<variant> пішіндегі графикалық кескінді көрсетеді

<question2> project options тіл қатынасу терезесінде орнатылған жоба параметрлері туралы ақпарат қандай кеңейтіммен бірге болады?
<variantright> dof 
<variant> dpr
<variant> dfm
<variant> pas
<variant> res

<question2> жоба файлын код редакторына жүктеу үшін қандай команданы пайдалану керек?
<variantright> project > view source
<variant> project > build project
<variant> project > options
<variant> file > new >unit
<variant> file > new >data module

<question2> dll жоба модулінің мәтіні қандай сөздерден басталады?
<variantright> library
<variant> function
<variant> exports
<variant> unit
<variant> project1

<question2> күрделі бағдарламалық жүйелерді әзірлеу және сүйемелдеу үшін бағдарламалық кешен қалай аталады?
<variantright> case-технологиясы
<variant> интернет технологиясы 
<variant> web-технологиясы
<variant> операциялық жүйелер
<variant> операциялық жүйелер қабықшалары

<question2> класс диаграммасы дегеніміз не?
<variantright> жүйенің құрылымын сипаттайтын статикалық құрылымдық диаграмма
<variant> объектінің қасиеті уақыт ішінде немесе кеңістікте болады
<variant> жүйенің жұмыс істейтін бағдарламалық модульдерін кодтау және генерациялау 
<variant> бұл нақты, нақты заттарды сипаттайтын термин
<variant> жүйенің қажетті мүмкіндіктері мен пайдаланушының қажеттіліктерін анықтау

<question2> атрибут - бұл ?
<variantright> объектінің қасиеті
<variant> арнайы термин
<variant> графиканы талдау
<variant> графикалық сипат
<variant> пиктограммалар комбинациясы

<question2> uml тілінде қандай бағдарлама жұмыс істейді?
<variantright> rational rose
<variant> borland delphi
<variant> abode photoshop
<variant> object pascal
<variant> corel draw

<question2> бағдарламалық құралдың өмірлік циклі - бұл оны құру туралы шешім қабылданған сәттен басталып, сол сәтте аяқталатын үздіксіз процесс ?
<variantright> жүйені пайдаланудан толық алып тастау
<variant> жүйені пайдалануға түпкілікті беру
<variant> ақпараттық жүйені тестілеу
<variant> ақпараттық жүйені верификациялау
<variant> жүйені тапсырыс берушіге беру

<question2> iso/iec 12207 стандартына сәйкес бағдарламалық құралдың өмірлік циклінің құрылымы процестердің үш тобына негізделген:
<variantright> негізгі, көмекші, ұйымдастыру процестері
<variant> негізгі, көмекші, техникалық процестер
<variant> негізгі, ұйымдастырушылық, техникалық процестер
<variant> негізгі, техникалық, конструкторлық процестер
<variant> қосалқы, ұйымдастырушылық, конструкторлық процестер

<question2> каскадты модельдің негізгі кемшілігі:
<variantright> нәтижелер алуда елеулі кешігу
<variant> жобалау құжаттамасының аяқталған жиынтығын қалыптастыру
<variant> жұмыстар мен шығындардың аяқталу мерзімдерін жоспарлау мүмкіндігі
<variant> келесі кезеңге өтуді анықтаудың қиындығы
<variant> барлық әзірлемені кезеңдерге бөлу

<question2> спиральды өмірлік цикл моделінің кемшілігі:
<variantright> келесі кезеңге өтуді анықтаудың қиындығы
<variant> нәтижелер алуда елеулі кешігу
<variant> жобалау құжаттамасының аяқталған жиынтығын қалыптастыру
<variant> жұмыстар мен шығындардың аяқталу мерзімдерін жоспарлау мүмкіндігі
<variant> барлық әзірлемені кезеңдерге бөлу

<question2> каскадты модельдің негізгі сипаттамасы:
<variantright> бір кезеңнен екінші кезеңге ауысу ағымдағы кезеңде жұмыс толық аяқталғаннан кейін ғана
<variant> алдыңғы кезеңдерге қайта оралу және бұрын қабылданған шешімдерді нақтылау мүмкін
<variant> талдаудың бастапқы кезеңіне өту спиральдың бір орамы аяқталғаннан кейін мүмкін болады
<variant> бір кезеңнен екінші кезеңге өту аралық кезеңнің белгіленген талаптарға сай келетіндігін анықтағаннан кейін орын алады
<variant> нәтижелер алуда елеулі кешігу

<question2> өмірлік циклдің қайтару моделінің негізгі сипаттамасы:
<variantright> алдыңғы кезеңдерге қайта оралу және бұрын қабылданған шешімдерді нақтылау мүмкін
<variant> бір кезеңнен екінші кезеңге ауысу ағымдағы кезеңде жұмыс толық аяқталғаннан кейін ғана
<variant> талдаудың бастапқы кезеңіне өту спиральдың бір орамы аяқталғаннан кейін мүмкін болады
<variant> бір кезеңнен екінші кезеңге өту аралық кезеңнің белгіленген талаптарға сай келетіндігін анықтағаннан кейін орын алады
<variant> нәтижелер алуда елеулі кешігу

<question2> спиральды өмірлік цикл моделінің негізгі сипаттамасы:
<variantright> талдаудың бастапқы кезеңіне өту спиральдың бір орамы аяқталғаннан кейін мүмкін болады
<variant> бір кезеңнен екінші кезеңге ауысу ағымдағы кезеңде жұмыс толық аяқталғаннан кейін ғана
<variant> алдыңғы кезеңдерге қайта оралу және бұрын қабылданған шешімдерді нақтылау мүмкін
<variant> бір кезеңнен екінші кезеңге өту аралық кезеңнің белгіленген талаптарға сай келетіндігін анықтағаннан кейін орын алады
<variant> нәтижелер алуда елеулі кешігу

<question2> uml тілінде жазықтықта графикалық таңбалар қолданылады. бұл ?
<variantright> геометриялық фигуралар арқылы бейнеленген екі өлшемді таңбалар
<variant> бекітілген өлшем мен пішіннің графикалық фигурасы
<variant> жекелеген графикалық символдарды қосатын сызық кесінділерінің реттілігі
<variant> жеке графикалық символдарды қосатын мәтін жолдары
<variant> мәтін жолдары, сызық кесінділерінің реттілігі. 

<question2> uml тілінде жолдар қолданылады. бұл ?
<variantright> жекелеген графикалық символдарды қосатын сызық кесінділерінің реттілігі
<variant> кейбір геометриялық фигуралармен бейнеленген екі өлшемді таңбалар
<variant> бекітілген өлшем мен пішіннің графикалық фигурасы
<variant> жеке графикалық символдарды қосатын мәтін жолдары
<variant> мәтін жолдары, сызықтар кесінділерінен алынған реттілік

<question2> uml-де коммуникация байланысы (communicate) диаграммалар нұсқасын пайдалану:
<variantright> актерлер мен пайдалану нұсқалары арасындағы байланыстарды көрсетеді
<variant> бір пайдалану жағдайына екіншісінің функционалдығын пайдалануға мүмкіндік береді
<variant> басқа пайдалану жағдайында ұсынылатын функционалдық мүмкіндіктерді қолдануға мүмкіндік береді
<variant> бірнеше актерлердің ортақ белгілері бар екенін көрсететін байланыстарды көрсетеді
<variant> объектілердің құрылымдық ұйымдастырылуына негізгі назар аударылатын диаграмма

<question2> uml-де қосылым байланысы (include) диаграммалар нұсқасын пайдалану:
<variantright> бір пайдалану жағдайына екіншісінің функционалдығын пайдалануға мүмкіндік береді
<variant> актерлер мен пайдалану нұсқалары арасындағы байланысты көрсетеді
<variant> пайдалану жағдайына тек қажет болған жағдайда ғана басқа пайдалану жағдайында ұсынылатын функционалдық мүмкіндіктерді қолдануға мүмкіндік береді
<variant> бірнеше актерлердің ортақ белгілері бар екенін көрсететін байланыстарды көрсетеді
<variant> хабарламаларды қабылдайтын және жіберетін объектілердің құрылымдық ұйымдастырылуына басты назар аударылатын диаграмма

<question2> uml-де кеңейту байланысын (extend) диаграммалар нұсқасын пайдалану:
<variantright> басқа пайдалану жағдайында ұсынылатын функционалдық мүмкіндіктерді қолдануға мүмкіндік береді
<variant> бір пайдалану жағдайына басқа пайдалану жағдайының функционалдығын қажет болған жағдайда ғана пайдалануға мүмкіндік береді
<variant> актерлер мен пайдалану нұсқалары арасындағы байланыстарды көрсетеді
<variant> қажет болған жағдайда ғана бірнеше актерлердің ортақ белгілері бар екенін көрсететін байланыстарды көрсетеді
<variant> хабарламаларды қабылдайтын және жіберетін объектілердің құрылымдық ұйымдастырылуына басты назар аударылатын диаграмма

<question2> жүйелік инженерия өмірлік циклінің процестеріндегі стандартты көрсетіңіз:
<variantright> iso 15288:2002
<variant> iso 19760:2003
<variant> iso 19760:2005
<variant> iso 15504:1-9:1997
<variant> iso 15504:1-9:1998

<question2> өмірлік цикл - бұл ? 
<variantright> ақауды қалыптастырудың реті
<variant> жобаны әзірлеу мен енгізу барысында операцияларды басқару
<variant> бағдарламалық қамтамасыздандырудың сәйкестігін тексеру
<variant> өмірлік цикл бойынша дұрыс орындалуын қамтамасыз ету
<variant> бағдарламалық қамтамасыз етудің сапасын талап ету

<question2> процестердің жетілуі - бұл ?
<variantright> бақылаудың тиімділігі, нәтижелілігі
<variant> жобаның өмірлік циклін басқару
<variant> жобаны іске асырудағы операцияларды басқару
<variant> бқ талаптарына және сапалық сипаттамаларына
<variant> бқ-ны толықтай қамтамасыз ету саясаты

<question2> валидация - бұл ?
<variantright> тапсырыс берушінің талаптары, қажеттіліктеріне сәйкестігін тексеру
<variant> өмірлік циклде жүзеге асыруды қамтамасыз ету процесі
<variant> бақылаудың дәрежесі сапаны біртіндеп сандық бағалау мүмкіндігі
<variant> бқ жасау ережесін анықтайтын әдістемелік нормативті құжат
<variant> қамтамасыз етуді іске асыру барысында операцияларды басқару

<question2> верификация - бұл ?
<variantright> бағдарламалық қамтамасыз етуді, дұрыс енгізуді қамтамасыз ету
<variant> клиенттің талаптары мен күтілетін қажеттіліктерін тексеру
<variant> өнімнің сапасын кезең-кезеңімен сандық бағалау мүмкіндігі
<variant> бқ жасау ережесін анықтайтын әдістемелік нормативті құжат
<variant> өнімді іске асыру барысында операцияларды басқару

<question2> бағдарламалық қамтамасыз етуді дамытудың негізгі ресурстары
<variantright> мерзім, уақыт, шығындар
<variant> уақыт, адамдық, ресурстар
<variant> шығындар, адамдық, ресурстар
<variant> бағдарламалық қамтамасыз ету
<variant> уақытты есептеу, бағдарламалау

<question2> класс қасиеттерінің сипаттамалары қолданылмайды
<variantright> қорытуда
<variant> көрінуде
<variant> стереотиптерде
<variant> әртүрлілікте
<variant> хабарламада

<question2> uml-да байланыс түрлері жоқ
<variantright> хабарлама
<variant> тәуелділік
<variant> қорыту
<variant> ассоциациялар
<variant> композиция

<question2> бағдарламалық қамтамасыз қолданылу сипаттамасы
<variantright> бағдарламалық, қамтамасыз етудің өнімділігі
<variant> адам қызметінің жоғары жылдамдығы
<variant> визуалды және нақты бейнені тану
<variant> бірнеше балама таңдау, олардың сипаттамасы
<variant> функционалдық пернелерді пайдалану

<question2> өмірлік цикл үлгісінің схемасында ұсынылған тәртіпте орындалатын модель не деп аталады
<variantright> каскадты
<variant> спираль
<variant> инкрементальды
<variant> эволюциялық
<variant> стандартталған

<question2> талаптарды қалыптастыруға және қайта жобалауға көп қайтарылған үлгі ?
<variantright> спираль
<variant> каскадты
<variant> инкрементальды
<variant> эволюциялық
<variant> стандартталған

<question2> сапаны басқару процесі
<variantright> процесті енгізу
<variant> қолдану саласын анықтау
<variant> жоспарлау
<variant> іске асыру және мониторинг
<variant> жобаны басқаруды талдау

<question2> жобаны басқару процесі
<variantright> орындау және бақылау
<variant> процесті енгізу
<variant> өндірістік қолдау
<variant> верификация
<variant> валидация

<question2> ірі фирмалар өз өнімдерінің сапасын жақсарту үшін әзірленген стандарттар
<variantright> корпоративтік
<variant> өнеркәсіптік
<variant> білім беру
<variant> жалпыға ортақ
<variant> халықаралық

<question2> кейбір саланың ұйымдарында жұмыс істейтін нормативтер
<variantright> өнеркәсіптік
<variant> корпоративтік
<variant> білім беру
<variant> жалпыға ортақ
<variant> халықаралық

<question2> ақпараттық технологиялар жобаларының дамуының реті
<variantright> тұжырымдаманы әзірлеу - жоспарлау - дамыту - тұрақтандыру - енгізу
<variant> жоспарлау - тұжырымдаманы әзірлеу - әзірлеу - енгізу - тұрақтандыру
<variant> дамыту - тұжырымдаманы әзірлеу - жоспарлау - енгізу - тұрақтандыру
<variant> жоспарлау - тұрақтандыру - дамыту - енгізу - тұжырымдаманы әзірлеу
<variant> жоспарлау - дамыту - тұрақтандыру - енгізу - тұжырымдаманы әзірлеу

<question2> мәліметтер ағынының диаграммасының негізгі компоненттері ? қолданылмайды
<variantright> жоба менеджері
<variant> сыртқы нысандар
<variant> жүйелер/кіші жүйелер
<variant> деректерді сақтау құрылғылары
<variant> деректер ағындары

<question2> бағдарламалық қамтамасыз етудің даму стилін анықтайтын әдістердің және құралдардың жиынтығы ?
<variantright> әдіснама
<variant> бағдарламалық қамтамасыз ету
<variant> өмір циклін тексеру 
<variant> тексеру
<variant> өмір циклін бағалау

<question2> үлгінің негізгі құраушы бөліктерінде ? қолданылмайды
<variantright> мотивация
<variant> сипаттамасы
<variant> мәселе
<variant> нәтижелер
<variant> шешім

<question2> үлгі кемшілігі
<variantright> қолдану бағдарламаның кәсіби өсуін бәсеңдетеді
<variant> әзірлеушілерге бір-бірін түсінуге мүмкіндік береді
<variant> қолданбалы бағдарламалау тілінің тәуелсіздігі
<variant> үлгіні қайта пайдалану мүмкіндігі
<variant> үлгілер үшін қол жетімділік

<question2> бағдарламалық қамтамасыздандыру дизайнын нақты тапсырмасы үшін типтік дизайн шешімі ?
<variantright> үлгі
<variant> мотивация
<variant> түсіндіру
<variant> тексеру
<variant> класс диаграммасы

<question2> мінез-құлықтың мінездемелері ?
<variantright> делдал
<variant> қасбет
<variant> орынбасар
<variant> прототип
<variant> жалғыз

<question2> үлгі адаптерін тағайындау
<variantright> үйлесімділік интерфейстерді түрлендіру
<variant> объектілерді ағаш құрылымдарына айналдырады
<variant> өзара байланысты объектілерді құру интерфейсі
<variant> жобаны жасау үшін алгоритмдер отбасын анықтайды
<variant> көптеген делдалдар арқылы сұрау жіберу мүмкіндігі

<question2> бірнеше генеративті үлгілерді көрсетіңіз
<variantright> жалғыз, құрылысшы прототип
<variant> декоратор, қасбет, көпір, прототип
<variant> зауыттық әдіс, көпір, құрылысшы
<variant> міндеттер тізбегі, прототип, көпір
<variant> депутат, байланыстырушы, декоратор

<question2> бірқатар құрылымдық үлгілерді көрсетіңіз
<variantright> декоратор, қасбет, көпір
<variant> жалғыз, құрылысшы
<variant> зауыттық әдіс, көпір
<variant> міндеттер тізбегі, көпір
<variant> депутат, байланыстырушы

<question3> қандай мінез-құлықтың белгілерін көрсетіңіз
<variantright> командалар, итератор келуші
<variant> жалғыз, құрылысшы, прототип
<variant> зауыттық әдіс, көпір, құрылысшы
<variant> міндеттер тізбегі, прототип
<variant> депутат, байланыстырушы, декоратор

<question3> объектілі-бағытталған бағдарламалау (oбб) ?
<variantright> объектілерді қолданумен, бағдарламалау
<variant> қолданыстағы немесе жасанды жүйенің моделі
<variant> міндеттің сипаттамасы және оны бағдарламалық тілде шешу жолдары
<variant> бағдарламаның шынайы бөлігі
<variant> пәндік доменнің математикалық моделі

<question3> бағдарламада пайдаланылатын заттарды тану үшін тағайындаңыз
<variantright> идентификаторлар
<variant> объектіні жариялау
<variant> түйінді сөздер
<variant> түрлері мен класстары
<variant> функционалдық үлгілер

<question3> объектілердің барлық топтарының жалпы сипаттамалары ?
<variantright> түрлері мен класстары
<variant> идентификаторлар
<variant> түйінді сөздер
<variant> объектіні жариялау
<variant> функционалдық үлгілер

<question3> инкапсуляция ?
<variantright> ақпаратты оқшаулау мүмкіндігі
<variant> бағдарламалық қамтаманың кезкелген бөлігі
<variant> бағдарламалық қамтаманың басқа бөліктері 
<variant> кластың барлық мүшелері жабық болғанда
<variant> кластың барлық мүшелері ашық болғанда

<question3> абстракция ?
<variantright> объектінің маңызды сипаттамалау, айқындау
<variant> объектінің жекелеген элементтерін бөлу процесі
<variant> сабақтардың өзара ауыстырылуына кедергі келтіретін шектеу
<variant> абстракцияның ретті немесе реттелген жүйесі
<variant> объектінің сыныбы бойынша шектеу

<question3> инкапсуляция ?
<variantright> объектінің элементтерін, бір-бірінен бөлу процесі
<variant> объектінің маңызды сипаттамаларын айқындау
<variant> абстракцияның реттелген немесе реттелген жүйесі
<variant> нысан класстары бойынша шектеу
<variant> уақыттың немесе кеңістіктің объектісінің болуы

<question3> иерархия - бұл ?
<variantright> абстракцияның рейтингтік жүйесі
<variant> объектінің маңызды сипаттамаларын белгілеу
<variant> объектінің жеке элементтерін бірбірінен бөлу процесі
<variant> жүйенің оның ыдырау мүмкіндігіне байланысты қасиеті
<variant> объектілердің әртүрлі класстары бойынша шектеу

<question3> жазу ?
<variantright> объектілер класы бойынша шектеу
<variant> объектінің элементтерін бірбірінен бөлу процесі
<variant> оның ыдырауымен байланысты жүйенің мүлкі
<variant> абстракцияның ретті немесе реттелген жүйесі
<variant> әртүрлі объектілердің мүлкі уақытында бар

<question3> тұрақтылық - бұл ?
<variantright> объектінің мүлігі уақыт, кеңістікте болуы
<variant> кластардың өзара алмастырылуына кедергі келтіретін шектеу
<variant> объектінің жеке элементтерін бір-бірінен бөлу процесі
<variant> жүйенің оның ыдырау мүмкіндігіне байланысты қасиеті
<variant> абстракцияның ретті немесе реттелген жүйесі

<question3> объективті бағдарлаудың негізгі ұғымдары
<variantright> объект пен класс
<variant> объект құрылымы
<variant> объектінің сипаттамасы
<variant> қласстың синтаксисі
<variant> объектілер жиынтығы

<question3> класстар ?
<variantright> құрылымдық ұйымдар
<variant> топтық ұйымдар
<variant> мінез-құлық субъектілері
<variant> аннотациялар
<variant> қатынастар мен сипаттамалар

<question3> класс ?
<variantright> ортақ құрылым, мінез-құлыққа байланысты объектілер жиынтығы
<variant> иерархиялық құрылым және кез келген объектілердің сипаттамасы
<variant> ортақ құрылыммен байланыстырылған нысандардың жиынтығы
<variant> жалпы мінез-құлықпен байланысты объектілер жиынтығы
<variant> тапсырмалардың жалпылығымен байланысты объектілер жиынтығы

<question3> класс идентифицирленеді ?
<variantright> атау, атрибуттар операциялар
<variant> атауы, сипаттамасы, ұзақтығы
<variant> термин, атау, атрибуттар
<variant> аты, қызметі, түрі
<variant> типтер, атрибуттар, операциялар

<question3> класс операциясы ?
<variantright> класс нысанынан сұрауға болатын қызмет
<variant> мәндердің жиынын сипаттайтын класстың аталған сипаты
<variant> объектілердің даналарының болуына қарамастан элементтердің сипаттамасы
<variant> басқа барлық класстардан бірінен айырмашылығы бар мәтіндік жол
<variant> осы объектілердің даналарына қарамастан қызметтердің сипаттамасы

<question3> класстың атрибуты ?
<variantright> мәндердің жиынын сипаттайтын класс сипаты
<variant> кез келген класс нысанынан сұрауға болатын аталған қызмет
<variant> объектілердің даналарының болуына қарамастан элементтердің сипаттамасы
<variant> басқа барлық класстардан бірегей ерекшеленетін мәтіндік жол
<variant> осы объектілердің даналарына қарамастан қызметтердің сипаттамасы

<question3> жаңа объектіні инициализациялау үшін класс әдісі не деп аталады
<variantright> дизайнер
<variant> деструктор
<variant> хабарландыру
<variant> қоңырау шалу
<variant> функциясы

<question3> класс спецификациясы - бұл ?
<variantright> заттардың және қызметтердің сипаттамалары, объектілер саны
<variant> басқа барлық класстардан айырмашылығы бар мәтіндік жол
<variant> әртүрлі класстардың мәндерінің жиынтығын сипаттайды
<variant> құрылым функцияларобъектілер арасындағы қасиеттер
<variant> осы класстың кез келген объектісінен сұрауға болатын аталған қызмет

<question3> сынақ уақытына байланысты тест әдісін көрсетіңіз.
<variantright> альфа тестілеу
<variant> оң сынақ
<variant> интуитивті тестілеу
<variant> қара жәшікті тексеру
<variant> қолма-қол тестілеу

<question3> автоматтандыру деңгейіне байланысты тестілеу әдісін көрсетіңіз
<variantright> қолмен сынау
<variant> оң сынақ
<variant> интуитивті тестілеу
<variant> қара жәшікті тексеру
<variant> альфа тестілеу

<question3> жүйенің біліміне байланысты тестілеу әдісін көрсетіңіз
<variantright> қара жәшікті тексеру
<variant> оң сынақ
<variant> интуитивті тестілеу
<variant> қолмен сынау
<variant> альфа тестілеу

<question3> бағдарламаның коды ?
<variantright> компьютермен байланысу үшін пайдаланатын тіл
<variant> пайдаланушы экранда көретін терезені құрастырады
<variant> ақпарат беруге мүмкіндік беретін бағдарламаның бір бөлігі
<variant> ақпарат алуға мүмкіндік беретін бағдарламаның бөлігі
<variant> операцияны жылдам бастауға мүмкіндік береді

<question3> жоба (project) ?
<variantright> объектілер жиынтығы
<variant> бағдарламалық қамтамасыз етуді құру үшін негіз
<variant> формасы және оның компоненттері
<variant> код үзінділерінің жиынтығы
<variant> компоненттерді көрсету

<question3> oбъектіге-бағытталған бағдарламалау сипаттары
<variantright> мұра, полиморфизм инкапсуляция
<variant> мұра, полиморфизм, достық
<variant> мұрагерлік, достық, инкапсуляция
<variant> полиморфизм, достық, инкапсуляция
<variant> мұра, полиморфизм, интерфейс

<question3> сынақ әдістерінің жіктелмейтін сипаттамасын көрсетіңіз
<variantright> сыртқы ортаға әсер ету
<variant> тестілеу кезінде
<variant> сынау объектісі үшін
<variant> сценарийлердің позитивтілігі негізінде
<variant> автоматтандыру деңгейі бойынша

<question3> интеграциялық тестілеу ?
<variantright> бағдарламаға компоненттерінің әрекеттесуін тексеру
<variant> жүйенің бір элементінің жұмысын тексеру
<variant> сыртқы қосымшаларға тестілік интерфейстер
<variant> бқ құрылымын әдістемелік талдау және талдау жүргізу
<variant> бқ басқару элементтеріндегі сипат мәндерін өзгерту

<question3> жүйені тестілеу ?
<variantright> сыртқы қосымшаларға тестілік интерфейстер
<variant> жүйенің бір элементінің жұмысын тексеріңіз
<variant> бағдарламалық компоненттердің өзара әрекеттесуін тексеріңіз
<variant> бқ құрылымын әдістемелік талдау және талдау жүргізу
<variant> бқ басқару элементтеріндегі сипат мәндерін өзгерту

<question3> бағдарламалық қамтамасыз етуді тексеру ?
<variantright> көрсетілген бағдарламаның сәйкестігін тексеру
<variant> клиенттің талаптарына сәйкестігін бағдарламалық қамтамасыз ету
<variant> тест тапсырмаларының тізбегін өңдеу
<variant> бағдарламалық қамтаманың құрылымын талдау және талдау
<variant> бағдарламалық компоненттердің өзара әрекеттесуін талдау және тексеру

<question3> қара жәшік әдісінде ?
<variantright> шешілетін мәселе туралы ақпарат пайдаланылады
<variant> бағдарлама құрылымы туралы ақпарат пайдаланылады
<variant> бағдарламадағы қателер туралы ақпарат жинақталады
<variant> өмірлік циклдің сенімділігі туралы ақпарат
<variant> бағдарламалық құрал дұрыстығына қатысты ақпарат

<question3> ақ жәшік әдісінде ?
<variantright> бағдарлама құрылымы ақпарат пайдаланылады
<variant> шешілетін проблема туралы ақпарат пайдаланылады
<variant> бағдарламадағы қателер туралы ақпарат жинақталады
<variant> бағдарламалық құрал сенімділігі туралы ақпарат
<variant> бағдарламалық құрал дұрыстығына қатысты ақпарат

<question3> uml тұжырымдамалық моделі ?
<variantright> субъектілер, қарым-қатынастар, диаграммалар
<variant> қатынастар, диаграммалар пакеттер
<variant> субъектілер, қатынастар тораптар
<variant> диаграммалар, жазбалар класстар
<variant> объектілер, диаграммалар түйіндер

<question3> uml моделінің құрылымдық элементі
<variantright> класс
<variant> автомат
<variant> пакеттер
<variant> ескертулер
<variant> өзара әрекеттесу

<question3> uml моделінің топтастырылған элементі
<variantright> пакеттер
<variant> автомат
<variant> класс
<variant> ескертулер
<variant> өзара әрекеттесу

<question3> uml моделінің аннотациялық субъектінің элементі
<variantright> ескертулер
<variant> автомат
<variant> класс
<variant> пакеттер
<variant> өзара әрекеттесу

<question3> uml моделінің мінез-құлық элементі
<variantright> автоматика
<variant> түйіндер
<variant> класс
<variant> пакеттер
<variant> өзара әрекеттесу

<question3> объектіге-бағытталған жүйенің негізгі элементі
<variantright> класс
<variant> атрибуты
<variant> мәні
<variant> операциясы
<variant> домені

<question3> бірнеше мәнді қабылдайтын класстың қасиеттері болып табылады
<variantright> атрибут
<variant> класс
<variant> домен
<variant> операция
<variant> мән

<question3> пайдаланушы функцияны сипаттайтын типтік пайдаланушының араласуы - бұл ?
<variantright> прецедент
<variant> өзара әрекеттесу
<variant> кеңейту
<variant> хабарлама
<variant> делегирлеу

<question3> берілетін нысандар арасында деректермен алмасу ерекшелігі - бұл ?
<variantright> хабарлама
<variant> өзара әрекеттесу
<variant> кеңейту
<variant> прецедент
<variant> делегирлеу

<question3> хабарламаны алу нәтижесі болып табылады
<variantright> әрекет
<variant> өзара әрекеттесу
<variant> кеңейту
<variant> прецедент
<variant> делегирлеу

<question3> бірліктерді тестілеу стандарты ?
<variantright> ieee 1008-87
<variant> ansi - ieee-729-83
<variant> iso 19760: 2003
<variant> iso 15504: 1-9: 1998
<variant> ansi - ieee-709-73

<question3> қосалқы станциялар мен компоненттердің сапалық сипаттамаларының моделіне не кірмейді
<variantright> қауіпсіздік
<variant> сенімділік
<variant> тиімділігі
<variant> қолданумүмкіндігі
<variant> сүйемелдеу

<question3> бағдарламалық қамтама сапасының индикаторларының бірінші деңгейі - бұл
<variantright> функционалдыжарамдылық
<variant> бағдарламалықпакеттіңсенімділігі
<variant> бағдарламалықпакеттіңтиімділігі
<variant> шектеуліресурстар
<variant> ілеспебағдарламалықжасақтама

<question3> тән ерекшеліктері стандартты түрде көрсетіледі ?
<variantright> iso 9126: 1
<variant> ieee 107-86
<variant> ieee 1008-87
<variant> ansi / ieee-729-83
<variant> ansi / ieee-789-63

<question3> жүйенің кейбір бөліктері арасындағы байланыс көрсетілген үлгі болып табылады
<variantright> қатынас моделі
<variant> интерфейс үлгісі
<variant> динамикалық модел
<variant> статикалық модел
<variant> репозиторийдің моделі

<question3> жүйені пайдалану кезінде процестерді ұйымдастыру ? ұсынылған үлгі болып табылады
<variantright> динамикалық модель
<variant> интерфейс үлгісі
<variant> қатынас моделі
<variant> статикалық модель
<variant> репозиторийдің моделі

<question3> деректер қорын бөлісуге негізделген жүйелік үлгі болып табылады
<variantright> репозиторидің моделі
<variant> интерфейс үлгісі
<variant> қатынас моделі
<variant> статикалық модель
<variant> динамикалық модель

<question3> бірнеше процессорлар арасында деректер мен процестерді таратуды көрсететін жүйе моделі
<variantright> клиент / сервер моделі
<variant> интерфейс үлгісі
<variant> қатынас моделі
<variant> статикалық модель
<variant> динамикалық модель

<question3> бағдарламаларды басқарудың кезеңдері
<variantright> талдау, жобалау, кодтау тестілеу
<variant> талдау, жоспарлау, тестілеу, сипаттама
<variant> талдау, жобалау, жоспарлау, тестілеу
<variant> талдау, кодтау, тестілеу, сипаттама
<variant> талдау, тестілеу, жобалау, тәуекел

<question3> спираль үлгісінің артықшылықтары:
<variantright> бағдарламалық қамтамасыз етуді, нақты көрсете алады
<variant> даму эволюциясының кезегінде тәуекелді нақты ескеруге мүмкіндік береді
<variant> дамудың итеративті құрылымында жүйелік тәсілдің қадамын қамтиды
<variant> бағдарламалық қамтамасыз етуді дамыту үшін симуляцияны пайдаланады
<variant> бағдарламалық өнімдерді әзірлеуде модельдеуді қолданады

<question3> компонентке бағдарланған модельдің артықшылықтары
<variantright> бағдарламалық өнімді әзірлеу уақытын 30% ға азайтады
<variant> бағдарламалық қамтамасыз етуді әзірлеу құнының 70%-ға
<variant> өнімділікті бір жарым есе арттырады
<variant> бағдарламалық қамтамасыз етуді әзірлеу уақытын 30% -ға арттырады
<variant> өнімділіктің өнімділігін екі есеге арттырады

<question3> классикалық өмір циклінің артықшылығы
<variantright> жоспар, уақыт кестесін береді
<variant> жоспар мен кестені береді
<variant> құрылыс курсын реттейді
<variant> қоршаған ортаның өзгеруіне бейімделу
<variant> сатылар бойынша көрінетін жобалардың нәтижелері

<question3> өлшемі бағытталған бағдарламалардың болмауы
<variantright> бағдарламалау тіліне, бағдарламалауға байланысты
<variant> бастапқы деректерді алу күрделілігі
<variant> есептік емес бағдарламалау тіліне бейімделмеген
<variant> бағдарламалау тілінен тәуелсіз
<variant> функционалды емес бағдарламалау тіліне бейімделген

<question3> бағдарлама элементін қорғау үшін әзірлеуші болуы керек
<variantright> қателерді өңдеуді, қамтамасыз етеді
<variant> нашар деректерді имитациялайтын сынақтар жүргізеді
<variant> жоспарлау жүйесіндегі сынақтарға қатысады
<variant> ақпаратты қорғау құралдарын сипаттау
<variant> бағдарламалық құрал интерфейсінің қателерін талдау

<question3> прототиптеудің артықшылығы
<variantright> бағдарламалық, қамтамасыз етуді анықтау
<variant> тапсырыс берушінің бағдарламасын бағалау
<variant> жобаның орналасуын құру
<variant> жылдам жобалау
<variant> орналасу дизайны

<question3> өңдеу функцияларының тізімін анықтайтын модель
<variantright> функционалды
<variant> ақпарат
<variant> мінез-құлық
<variant> алдын ала
<variant> іс жүргізу

<question3> жүйенің қажетті динамикасын бекітетін үлгі
<variantright> мінез-құлық
<variant> іс жүргізу
<variant> ақпарат
<variant> функционалды
<variant> алдын ала

<question3> көп қабатты жүйені білдіретін үлгі
<variantright> дерексіз, машинаның моделі
<variant> орталықтандырылған басқару моделі
<variant> басқару және сақтау моделі
<variant> деректер қоймасының моделі
<variant> оқиғаларды басқару моделі

<question3> басқа кіші жүйелердің жұмысын басқаратын модель
<variantright> орталықтандырылған басқару моделі
<variant> басқару және сақтау моделі
<variant> оқиғаларды басқару моделі
<variant> деректер қоймасының моделі
<variant> дерексіз машинаның моделі

<question3> сыртқы оқиғаларды бақылайтын модель
<variantright> оқиғаларды басқару моделі
<variant> деректі машинаның моделі
<variant> басқару және сақтау моделі
<variant> орталықтандырылған басқару моделі
<variant> дерексіз машинаның моделі

<question3> еркін тәуелді модульдер қатарын ыдырататын жүйе сипаты
<variantright> модулярлық
<variant> байланыс
<variant> қатынас
<variant> үзіліс
<variant> басқару

<question3> «қара жәшік» рөлін атқаратын модуль деп 
<variantright> идеалды модуль
<variant> қарқынды модуль
<variant> индуктивті модуль
<variant> қуатты модуль
<variant> пассивті модуль

<question3> модульдің ішкі сипаттамасын қалай атаймыз
<variantright> байланыс
<variant> қатынас
<variant> модулярлық
<variant> үзіліс
<variant> басқару

<question3> функционалдық ұқсастық қағидасына сәйкес біріктірілген модульдің байланысы
<variantright> логикалық байланыс
<variant> уақытша байланыс
<variant> жылдам байланыс
<variant> баяу байланыс
<variant> сәйкестік бойынша байланыс

<question3> бағдарламалық құралды әзірлеу технологиясы ?
<variantright> бағдарламалық жасақтама жасау, қағидалар жүйесі
<variant> сенімді бағдарламалық қамтамасыз ету жүйесі
<variant> тиімді бағдарламалық қамтамасыз ету жүйесі
<variant> нақты уақыт режиміндегі компьютерлер жүйесі
<variant> компьютерлер үшін инженерлік қағиданың жүйесі

<question3> классикалық бағдарламалық қамтамасыз етудің өмірлік циклінің бірінші кезеңі
<variantright> жүйелік талдау
<variant> талаптарды талдау
<variant> жобалау
<variant> кодтау
<variant> қадағалау

<question3> бағдарламалық қамтамасыз етудің функцияларын, сипаттамаларын және интерфейсін сипаттайтын сахна
<variantright> талдау жасау
<variant> жүйелік талдау
<variant> жобалау
<variant> кодтау
<variant> қадағалау

<question3> бағдарламалық жасақтаманың архитектурасы мен алгоритмдік құрылымын құру кезеңі
<variantright> жобалау
<variant> талаптарды талдау
<variant> жүйелі талдау
<variant> кодтау
<variant> қадағалау

<question3> дизайн нәтижелерінің бағдарламалау тіліне аударылған сатысы
<variantright> кодтау
<variant> жобалау
<variant> талаптарды талдау
<variant> жүйелік талдау
<variant> қадағалау

<question3> бағдарламалық жасақтаманың ақауларын анықтауға арналған бағдарламаны орындау кезеңі
<variantright> тестілеу
<variant> кодтау
<variant> жобалау
<variant> талаптарды талдау
<variant> қадағалау

<question3> модульдің ішкі сипаттамасы
<variantright> байланыс
<variant> қатынас
<variant> модулярлық
<variant> үзіліс
<variant> басқару

<question3> «қара жәшік» рөлін атқаратын модуль
<variantright> идеалды модуль
<variant> қарқынды модуль
<variant> индуктивті модуль
<variant> қуатты модуль
<variant> пассивті модуль

<question3> сарқырама үлгісінің элементтерін біріктіретін модель
<variantright> қосымша модель
<variant> прототипті
<variant> rad үлгісі
<variant> спираль үлгісі
<variant> бағдарланған модель

<question3> бағдарламалық қамтамасыздандырудың өте қысқа циклін қамтамасыз ететін модель
<variantright> rad-үлгісі
<variant> қосымша модель
<variant> прототибинизация
<variant> спираль үлгісі
<variant> бағдарланған модель

<question3> классикалық өмір циклінің ең жақсы қасиеттеріне және прототиптерге негізделген модель
<variantright> спираль үлгісі
<variant> rad үлгісі
<variant> қосымша модель
<variant> прототибинизация
<variant> бағдарланған модель

<question3> минималды бағдарламалық қамтама конфигурациясының элементтері
<variantright> жоба жоспары
<variant> клиенттің жоспары
<variant> бағдарламалық қамтама
<variant> техникалық тапсырма
<variant> техникалық жобалау

<question3> мінез-құлықтың белгілерін көрсетіңіз
<variantright> командалар, итератор келуші
<variant> жалғыз, құрылысшы, прототип
<variant> зауыттық әдіс, көпір, құрылысшы
<variant> міндеттер тізбегі, прототип
<variant> депутат, байланыстырушы, декоратор

<question3> rad технологиясының жетіспеушілігі
<variantright> маңызды, адами ресурстар
<variant> сызықты дәйекті даму
<variant> өңдеу жылдамдығы төмен
<variant> өтінімнің орындалуы төмен
<variant> елеулі техникалық тәуекелдер

<question3> rad технологиясының артықшылықтары
<variantright> бағдарламалық қамтамасыз ету, жылдам дамуы
<variant> сызықты дәйекті даму
<variant> өңдеу жылдамдығы төмен
<variant> өтінімнің орындалуы төмен
<variant> маңызды адами ресурстар

<question3> спецификация процесі сипатталған?.
<variantright> кесте
<variant> диаграмма бойынша
<variant> алгоритм
<variant> блоксхема
<variant> теңдеу арқылы

<question3> спецификация процесі пайда болады?.
<variantright> диаграмма
<variant> кесте
<variant> алгоритм
<variant> блоксхема
<variant> теңдеу арқылы

<question3> өлшемге негізделген метрикалар ?
<variantright> бағдарламалық өнімді өлшеу, оның даму процесі
<variant> бағдарламалық өнімді және оның даму процесіне толықтырулар
<variant> бағдарламалық өнімді ауыстыру және оның даму процесі
<variant> бағдарламалық жасақтама өнімімен оның даму процесін тексеру
<variant> бағдарламалық өнімді және оның даму процесін бағалау

<question3> өлшемі бағытталған бағдарламалардың артықшылықтары
<variantright> latitude, қарапайымдылығы
<variant> бағдарламалау тіліне тәуелділік
<variant> субъективтілік жанама өлшеу
<variant> бағдарламалау тіліне тәуелді емес
<variant> ерте сатысында қолданылады

<question3> өлшемге бағдарланған метриканың кемшіліктері
<variantright> бағдарламалау тіліне байланысты
<variant> latitude қарапайымдылығы және есептеудің жеңілдігі
<variant> субъективтілік, жанама өлшеу
<variant> бағдарламалау тіліне тәуелді емес
<variant> алдын ала сатысында қолданылады

<question3> функционалдық бағытталған метриканың артықшылықтары
<variantright> бағдарламалау тіліне байланысты емес
<variant> бағдарламалау тіліне байланысты
<variant> latitude және қарапайымдылық
<variant> субъективтілік, жанама өлшеу
<variant> алдын ала сатысында қолданылады

<question3> функционалдық бағытталған метриканың кемшіліктері
<variantright> субъективтілік, жанама өлшеу
<variant> бағдарламалау тіліне байланысты
<variant> latitude және қарапайымдылық
<variant> субъективтілік жанама өлшеу
<variant> алдын ала сатысында қолданылады

<question3> рөлдердің үлгісі ?
<variantright> жүйелік пайдаланушы, рөлдерінің тізімі
<variant> маңызды пайдалану жағдайлары
<variant> өзара байланысты контексттер жиынтығы
<variant> жүйені пайдалану контексті
<variant> интерфейстің көрнекі дизайны

<question3> міндеттердің үлгісі ?
<variantright> маңызды пайдалану жағдайлары
<variant> жүйенің пайдаланушы рөлдерінің тізімі
<variant> өзара байланысты контексттер жиынтығы
<variant> жүйені пайдалану контексті
<variant> интерфейстің көрнекі дизайны

<question3> мазмұн үлгісі ?
<variantright> өзара байланысты контексттер жиынтығы
<variant> маңызды пайдалану жағдайлары
<variant> жүйенің пайдаланушы рөлдерінің тізімі
<variant> жүйені пайдалану контексті
<variant> маңызды пайдалану тізімі

<question3> операциялық модель ?
<variantright> жүйені пайдалану контексті
<variant> маңызды пайдалану жағдайлары
<variant> өзара байланысты контексттер жиынтығы
<variant> жүйенің пайдаланушы рөлдерінің тізімі
<variant> интерфейстің көрнекі дизайны

<question3> өмір цикл - бұл?.. 
<variantright> ақауды қалыптастырудың реті
<variant> жобаны әзірлеу мен енгізу барысында операцияларды басқару
<variant> бағдарламалық жасақтаманың сәйкестігін тексеру
<variant> өмірлік циклы бойынша дұрыс орындалуын қамтамасыз ету
<variant> бағдарламалық қамтамасыз етудің сапасын талап ету 

<question3> процестердің жетілуі дегеніміз ?
<variantright> бақылаудың тиімділігі, нәтижелілігі
<variant> жобаның өмірлік циклін басқару
<variant> жобаны іске асырудағы операцияларды басқару
<variant> бқ талаптарына және сапалық сипаттамаларына
<variant> бқ-ны толықтай қамтамасыз ету саясаты

<question3> басқа класстағы бір класстың міндеттерін қайталау механизмі
<variantright> мұра
<variant> оқшаулау
<variant> инкапсуляция
<variant> жабық
<variant> абстракция

<question3> бағдарламаны кодтау - бұл ?
<variantright> алгоритмдік, бағдарламалық тіл
<variant> жекелеген элементтердің өзара әрекеттесуі
<variant> бағдарламалық өнімдерді енгізу
<variant> бағдарламалық қамтамасыз ету жоспары
<variant> бағдарламада ақауларды анықтау

<question3> бағдарламалық жасақтаманы тестілеу
<variantright> бағдарламадағы ақауларды іздеу, табу
<variant> бағдарламалық қамтамасыз ету жоспары
<variant> бағдарламалық өнімдерді енгізу
<variant> жеке түзетулердің өзара әрекеті
<variant> бағдарлама алгоритмдік тілде

<question3> алдағы жұмыстың бүкіл көлемін болжайтын үрдістер
<variantright> ауыр процестер
<variant> жеңілдетілген процестер
<variant> ұялы үдерістер
<variant> арнайы үдерістер
<variant> өңделетін процестер

<question3> аспект негізіндегі бағдарламалау тұжырымдамаға негізделген бағдарламалау әдісі
<variantright> аспект
<variant> субъектілер
<variant> класс
<variant> операциялар
<variant> үлгілері

<question3> аспект болып табылады ?
<variantright> функционалдылықты жүзеге асыратын модуль
<variant> кодты енгізу құралы
<variant> класстың иерархиялық құрылымын өзгерту
<variant> мұраның иерархиялық құрылымын өзгерту
<variant> класстың иерархиялық құрылымында тұрақтылық

<question3> құрылымдық схеманың өзгеруі
<variantright> класстық диаграмма
<variant> белсенді диаграмма
<variant> жағдайлардың диаграммасы
<variant> соңғы мемлекеттік аппарат диаграммасы
<variant> өзара әрекеттесу диаграммасы

<question3> міндеттердің нақты класы үшін типтік архитектуралық шешім болып табылады
<variantright> үлгі
<variant> мәні
<variant> сервер
<variant> клиент
<variant> диаграмма
`